{
    "major name": "Anatomy and Physiology, and Neuroscience",
    "overview": [
        "The Honours program in Anatomy and Physiology, and Neuroscience is an advanced and specialised one-year course of study and practical skill development; it provides an opportunity to experience the life of a biomedical researcher.",
        "The Honours program consists of a combination of compulsory course work and a research project. The research component is carried out under the supervision in one of the research groups in Department of Anatomy and Physiology. Students work nearly full time in the research group designing, executing and analysing experiments. The course year starts in February and ends in November and is only available full time.",
        "There is a strong emphasis on learning to critically evaluate scientific publications and presenting your research findings to a wide audience. Therefore, the course provides valuable real-world skills that are relevant and valuable preparation for a diverse range of professions, not solely for biomedical research.",
        "Admission requirements",
        "In addition to satisfying the Bachelor of Science (Degree with Honours) entry requirements, students are required to have completed stream specific prerequisites. Details of stream specific prerequisites can be found at the Bachelor of Science (Degree with Honours) entry and participation requirements page."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "The Honours program consists of 100 credit points completed over 12 months full time comprising of two (2) Advanced Coursework subjects and a Research Project.",
            "To be awarded Honours with a specialisation in Physiology, students must successfully complete the following:",
            [
                "BIOM40001 - Introduction to Biomedical Research (12.5 points)",
                "PHYS90008 - Advanced Seminars in Physiology (12.5 points)",
                "PHYS40005 and PHYS40006 - Physiology Research Project (75 points)"
            ],
            "There are no elective subjects in this Honours program."
        ],
        "Subject Options": [],
        "Coursework Component": [
            "Students must complete 25 credit points of advanced coursework subjects. This is achieved by enrolling in the following subjects in the appropriate semesters.",
            {
                "BIOM40001": "Introduction To Biomedical Research Credits",
                "PHYS90008": "Advanced Seminars in Biomedical Sciences Credits"
            }
        ],
        "Research Component": [
            "Students must complete a total of 75 credit points of research across the duration of the Honours program. This is achieved by enrolling in a combination of the following subjects in the appropriate semesters.",
            {
                "PHYS40005": "Anatomy & Physiology Research Project P1 Credits",
                "PHYS40006": "Anatomy & Physiology Research Project P2 Credits"
            }
        ],
        "Links": [
            "https://biomedicalsciences.unimelb.edu.au/departments/physiology"
        ]
    }
}