{
    "major name": "Architecture",
    "overview": [
        "THE COURSE STRUCTURE BELOW ONLY APPLIES TO RE-ENROLLING STUDENTS WHO COMMENCED THEIR STUDIES PRIOR TO 2016",
        "Architecture is a discipline that uses broad skill sets. The Bachelor of Environments is an ideal degree on which to build an architectural career that is relevant to the 21st Century. Increasingly architects need to be able to work effectively with multidisciplinary teams. As an Architect students will need to be expert at creating innovative solutions for complex and often conflicting scenarios. The contemporary issues that confront designers include climate change, globalisation, urbanisation and new technologies. While difficult, they are also opportunities to inspire and inform your education and your future practice as an architect.",
        "Design lies at the heart of the architectural process and is underpinned by expertise in history, theory, environmental and construction technology and communication. In the Architecture major of the Bachelor of Environments students will learn to develop their designs using modelling and rendering techniques through studio-based classes, contributing to a creative and challenging learning experience.",
        "From 2016 double majorsare available for certain majors within the Bachelor of Environments. Further information on double majors can be found here:http://edsc.unimelb.edu.au/double-majors.",
        "Careers and Further Study: Upon completion of the Bachelor of Environments with a major in Architecture, students will have the option of either finding employment or applying to continue into the two-year Master of Architecture program, which will allow students to become professional architects. The Master of Architecture is a 200 point professional degree that emphasises the central role of design in the studio. For more information on the Master of Architecture please visit the Melbourne School of Design web site:http://msd.unimelb.edu.au/"
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "100 points of Architecture subjects."
        ],
        "Subject Options": [
            "The following description of the Architecture major aligns with the Study Plan Structure viewable on the Portal for students who commenced the Bachelor of Environments in 2015 or later.",
            "The components within the structure of this major have been designed to enforce the requirements of both this specific major and of the course overall, e.g. the requirement that at least 62.5 points of Environments discipline subjects (which can include subjects taken within the major) are taken at each of Level 2 and Level 3.",
            "From 2016 double majorsare available for certain majors within the Bachelor of Environments. Further information on double majors can be found here:http://edsc.unimelb.edu.au/double-majors. If you are interested in any double majors, please check the sample course plan before selecting any elective subjects",
            "PRE-2015 STUDENTS: Students who commenced the Bachelor of Environments prior to 2015 should refer to the handbook entry for the year they commenced in conjunction with the 2015 handbook listings for Environments elective and Breadth subject listings. View 2014 Bachelor of Environments Handbook entry."
        ],
        "Level 1 Environments & Enabling Electives (37.5 points)": [
            "In order to complete this major, enrol into ALL these subjects in your first year:",
            {
                "ENVS10004": "Designing Environments Credits",
                "ENVS10003": "Constructing Environments Credits",
                "ABPL10004": "Global Foundations of Design Credits"
            },
            "Architecture major - core subjects (87.5 points)",
            "All of",
            {
                "ABPL20033": "Architectural Technology Credits",
                "ABPL20036": "Environmental Building Systems Credits",
                "ABPL30041": "Architectural Tectonics Credits",
                "ABPL30048": "Architecture Design Studio: Air Credits",
                "ABPL30050": "Modern Architecture: MoMo to PoMo Credits",
                "ABPL30037": "Architecture Design Studio: Fire Credits"
            }
        ],
        "Design Studio subjects (12.5 points)": [
            "Select one of",
            {
                "ABPL20027": "Architecture Design Studio: Earth Credits",
                "ABPL20028": "Architecture Design Studio: Water Credits"
            },
            "IMPORTANT: Completion of both of the subjects above is strongly recommended. Therefore it is strongly recommended that the subjectnotchosen as this elective in the major is taken as an Environments Discipline subject."
        ],
        "Environments Discipline subjects (50 points)": [
            "Choose the total of",
            "50 points of Environments Discipline subjects",
            "RULES:",
            "Please note these rules when choosing the Environments Discipline subjects below",
            [
                "1. Must complete 25 points level 2 subjects"
            ],
            {
                "Environments Discipline subjects": " Credits"
            }
        ],
        "Breadth subjects and restrictions for Architecture major students": [
            "The breadth requirements for the Bachelor of Environments include the restriction of some subjects as breadth options, depending on an individual student’s choice of major. Subjects in the Handbook that are marked as available as breadth in the Bachelor of Environments may be subject to further restrictions, depending up which major a student is completing in that course. For detailed information on these Restrictions for Breadth Options view 2016 Handbook.",
            "Students undertaking the Architecture major are not permitted to take as breadth:",
            [
                "any Art History subjects (subject codes beginning AHIS)",
                "any of the following Level 2 or Level 3 Planning, Design or Construction subjects."
            ],
            {
                "ABPL20034": "Urban History Credits",
                "ABPL20037": "Urban Design Studies Credits",
                "ABPL20038": "Explorations (Landscape Studio 1) Credits",
                "ABPL20035": "Cities: From Local to Global Credits",
                "ABPL20039": "History of Designed Landscapes Credits",
                "ABPL20040": "Landscape Studio 2: Site Plan & Design Credits",
                "ABPL20042": "Construction of Residential Buildings Credits",
                "ABPL20047": "Site Tectonics Credits",
                "ABPL30042": "Landscape Studio: Urban Open Space Credits",
                "ABPL30043": " Credits",
                "ABPL30046": "Steel and Concrete Structural Systems Credits",
                "ABPL30049": "Case Studies in Landscape Architecture Credits",
                "ABPL30051": "Urban Morphological Mapping Credits",
                "ABPL20053": "Construction of Concrete Buildings Credits",
                "ABPL20041": "The Construction Context Credits"
            }
        ],
        "Notes": [
            "For more information on this major and to view a sample course plan please visit:http://edsc.unimelb.edu.au/sample-course-plans-bachelor-environments",
            "The Bachelor of Environments Architecture major provides a pathway into the Master of Architecture. The Master of Architecture program is recognised and accredited by the Australian Institute of Architects (AIA), the Architects Accreditation Council of Australia (AACA) and the Architects Registration Board of Victoria (ARBV)."
        ]
    }
}