{
    "major name": "Asian Studies",
    "overview": [
        "Knowledge about Asia is a crucial national asset at a time of rapid globalisation and social change. The Asian Studies program at the University of Melbourne is one of the largest in Australia and comprises a comprehensive range of subjects in the intellectual, cultural, political and religious traditions of Asia, with a focus on China, Indonesia, Japan and South-east Asia. Asian Studies subjects are taught in English and do not require language prerequisites. Study abroad programs are available and Asialink offers a stimulating program of events and activities with an Asian focus."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "This major requires the completion of:",
            [
                "\n25 credit points of Level 1 subjects, comprising of:\n\n12.5 credit points of Level 1 electives and 12.5 credit points of Arts Discovery (for a single major) OR 25 credit points of Level 1 electives (for a double major)\n",
                "25 credit points of Level 2 selective subjects",
                "12.5 credit points of Level 2 electives",
                "12.5 credit points of Level 3 Capstone subjects",
                "25 credit points of Level 3 Asian Studies subjects includingA minimum of 12.5 credit points of Level 3 selective subjects\n",
                "A minimum of 12.5 credit points of Level 3 selective subjects"
            ],
            "25 credit points of Level 1 subjects, comprising of:",
            "12.5 credit points of Level 1 electivesand12.5 credit points of Arts Discovery (for a single major)",
            "OR",
            "25 credit points of Level 1 electives (for a double major)",
            [
                "A minimum of 12.5 credit points of Level 3 selective subjects"
            ],
            "*Notes:",
            "Students must undertake the Arts Discovery subject as part of the course requirements and the Arts Discovery can be counted in one major only. For this major, you will need to complete two Level 1 subjects.",
            "If you are completing a single major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 elective subject.",
            "If you are completing a double major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 Elective subject OR Two Level 1 Elective subjects."
        ],
        "Links": [
            "http://www.asiainstitute.unimelb.edu.au/"
        ],
        "Level 1 electives": [
            {
                "ASIA10001": "Language and Power in Asian Societies Credits",
                "ASIA10002": "Asian Century: Meaning and Impact Credits"
            }
        ],
        "Level 2 selective subjects": [
            {
                "ASIA20001": "Media and Urban Culture in Asia Credits",
                "ASIA20003": "Genders and Desires in Asia Credits",
                "ASIA20004": "Asian Arts: Networks and Hubs Credits",
                "ASIA20008": "Digital Asia Credits",
                "ASIA20007": "Human Rights in Asia and the Middle East Credits"
            }
        ],
        "Level 2 electives": [
            {
                "INDO20018": "Indonesian Politics and Society Credits",
                "CHIN20007": "Chinese Studies: Culture and Empire Credits",
                "CHIN20008": "China Since Mao Credits",
                "CHIN20030": "Activism and Social Change in China Credits",
                "HIST20034": "Modern Southeast Asia Credits",
                "INDO20001": "Yogyakarta Summer Intensive Credits",
                "ISLM20015": "Politics: Middle East and South Asia Credits",
                "JAPN20005": "Contemporary Japan Credits",
                "KORE20002": "Contemporary Korea Credits"
            }
        ],
        "Level 3 Capstone subject": [
            {
                "ASIA30002": "Identity, Ideology & Nationalism in Asia Credits"
            }
        ],
        "Level 3 selective subjects": [
            {
                "ASIA30003": "Asian Religions in Societal Context Credits",
                "ASIA30004": "Corruption in Asia Credits",
                "ISLM30018": "Diplomacy: Middle East and South Asia Credits",
                "ASIA30005": "Global Cultures of Japan and Korea Credits"
            }
        ],
        "Level 3 electives": [
            {
                "CHIN30002": "Taiwan & Beyond: Chinese Settler Culture Credits",
                "JAPN30002": "Social Problems in Japan Credits",
                "POLS30011": "Chinese Politics and Society Credits",
                "KORE30001": "Korean Politics and Society Credits",
                "KORE30002": "Two Koreas in the World Credits"
            }
        ]
    }
}