{
    "major name": "Biochemistry and Pharmacology",
    "overview": [
        "The Honours degree in Biochemistry and Pharmacology is a one-year, full-time course of advanced study (25%) and research (75%). Completion of Honours allows students to continue onto higher degree study (e.g., PhD) and provides intensive practical training in current experimental techniques, the opportunity to develop oral and written communication skills and the experience of working in an active, multidisciplinary research environment. Most students start their studies at the beginning of Semester one (February), although mid-year entry (August) is also a possibility. Entry is by merit and open to Science/Biomedical graduates who have completed a major in Biochemistry and Molecular Biology or Pharmacology (or related discipline) and obtained an average of at least 3rd class Honours in their third year."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "The Honours program consists of 100 credit points completed over 12 months full time (or part time equivalent) comprising of two (2) Advanced Coursework subjects and a Research Project.To be awarded Honours with a specialisation in Biochemistry and Molecular Biology, students must successfully complete the following:",
            [
                "BCMB40002 Advanced Studies in Biochemistry (12.5 points)",
                "BIOM40001 Introduction to Biomedical Research (12.5 points)",
                "Biochemistry & Pharmacology Research (75 points) (BCMB40009 and BCMB40010 OR BCMB40013 and BCMB40014)"
            ],
            "There are no elective subjects in this Honours program."
        ],
        "Subject Options": [],
        "Coursework Component": [
            "Students must complete 25 credit points of advanced coursework subjects. This is achieved by enrolling in the following subject in the appropriate semester.",
            {
                "BCMB40002": "Biochemistry & Pharmacology Coursework Credits",
                "BIOM40001": "Introduction To Biomedical Research Credits"
            }
        ],
        "Research Component": [
            "Students must complete a total of 75 credit points of research across the duration of the Honours program.",
            "Students who commence inFebruary (start year)will complete:",
            {
                "BCMB40009": "Biochemistry & Pharmacology Research 1 Credits",
                "BCMB40010": "Biochemistry & Pharmacology Research 2 Credits"
            },
            "Students who commence inAugust (mid year)will complete:",
            {
                "BCMB40011": "Biochemistry & Pharmacology Research 1 Credits",
                "BCMB40012": "Biochemistry & Pharmacology Research 2 Credits"
            }
        ],
        "Links": [
            "https://biomedicalsciences.unimelb.edu.au/departments/biochemistry"
        ]
    }
}