{
    "major name": "Biomedical Engineering Systems",
    "overview": [
        "Students who have completed the Biomedical Engineering Systems major will be able to rigorously integrate the fundamental mathematics of systems modelling with the fundamental sciences of biology, chemistry and physics in the formulation and solution of problems involving biomedical systems. More specifically, core skills and knowledge that will be developed include: fundamental scientific comprehension that will lead to accurate mathematical modelling of biological and engineering systems, analytical and abstract thinking, problem-solving and design skills, ability to carry out laboratory experiments to confirm possible solutions to complex problems. At all levels of this major, we will ensure the development of excellent communication skills that will enable our graduates to deliver complex scientific information in a clear and concise fashion. The Biomedical Engineering Systems major will open up pathways for students leading to accredited professional or scientific research careers in biomedical engineering (through further study in the Masters in Engineering or PhD programs respectively), applied mathematics, applied science, teaching, management and finance."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "50 credit points",
            {
                "BMEN30008": "Biosystems Design Credits",
                "BMEN30009": "Introduction to Biomaterials Credits",
                "BMEN30010": "Mechanics for Bioengineering Credits"
            },
            "AND",
            {
                "BMEN30006": "Circuits and Systems Credits",
                "ELEN30012": "Signals and Systems Credits"
            }
        ],
        "Notes": [
            "In addition to these four core subjects, students must complete either MAST20029 Engineering Mathematics OR both of MAST20009 Vector Calculus AND MAST20030 Differential Equations at Level 2."
        ]
    }
}