{
    "major name": "BioSciences",
    "overview": [
        "The Graduate Diploma in Science (Advanced) in BioSciences is a one-year program designed to extend students' knowledge and skills through a supervised research project together with advanced coursework in biosciences disciplines. Alternatively, students are also able to complete the Graduate Diploma in Science (Advanced) by coursework alone (100 point coursework option), without a research component.",
        "For those undertaking the research project, this program provides students with the opportunity to design and conduct, under supervision, independent research. Specific research projects will depend upon the availability of appropriate expertise, but may address a broad spectrum of BioSciences issues within the School of BioSciences research domains of Molecular, Cell and Developmental Biology and/or Ecology and Evolutionary Biology. Students will assimilate and critically evaluate new knowledge within a scientific paradigm, and communicate that knowledge to others. Students should also develop skills in managing a scientific research project, writing scientific reports, and making an oral presentation.",
        "Students undertaking the research project also complete four advanced coursework subjects. Alternatively, those doing the 100 point course option complete eight advanced coursework subjects. By undertaking coursework subjects, students further their specialist knowledge in areas of biosciences research and provide specific training in experimental design, statistical analysis, critical review of research papers and presentation of oral and written reports."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points"
        ],
        "Subject Options": [
            "For both the coursework and research project program OR the coursework only program",
            "Students must take one of:",
            {
                "BIOL90002": "Applied Statistics for Biologists Credits",
                "MAST90044": "Thinking and Reasoning with Data Credits"
            },
            "and both of:",
            {
                "SCIE90013": "Communication for Research Scientists Credits",
                "BIOL90040": "Graduate Seminar in BioSciences Credits"
            },
            "And either:",
            "Coursework only option-  students must take 62.5 points  of graduate-level subjects from those listed as discipline elective subjects in the MSc (BioSciences) -https://handbook.unimelb.edu.au/courses/mc-scibio/course-structure",
            "Coursework and research project option- students must take 12.5 points of graduate-level subjects from those listed as discipline elective subjects in the MSc (BioSciences) -https://handbook.unimelb.edu.au/courses/mc-scibio/course-structureand a two-part BioSciences Minor Research Project, which can be undertaken as either:",
            {
                "BIOL90028": "BioSciences Minor Research Project Part1 Credits",
                "BIOL90030": "BioSciences Minor Research Project Part2 Credits"
            },
            "OR",
            {
                "BIOL90029": "BioSciences Minor Research Project Part1 Credits",
                "BIOL90031": "BioSciences Minor Research Project Part2 Credits"
            }
        ]
    }
}