{
    "major name": "Climate, Environment and Health",
    "overview": [
        "Students undertaking this specialisation will examine global environmental challenges, their profound implications for population health and health systems, and the need for interdisciplinary solutions now, and in coming decades. The specialisation aims to improve students’ understanding and interpretation of contemporary frameworks for action on climate change and health, including environmental health risk and governance, sustainable healthcare, and global and planetary health. Students will be exposed to widely used decision-support tools and develop skills in vulnerability and capacity assessment, policy agenda setting, adaptation and mitigation actions, and evaluation in climate change and other environmental health areas. Students will analyse the governance of climate change and environmental health risks that include prevention and protection using an equity, justice and ‘systems’ lens.  In doing so, key national and international regulatory and legislative structures and directives, and innovative programs related to environmental health protection and climate change adaptation and mitigation will be explored across multiple settings.  As a result, students will become familiar with and critique relevant policies and international agreements pertaining to environment, climate change and health. Students will also learn to identify complex systems, barriers and enablers implicated in processes of responding to environmental challenges on global, national, and local scales.  This subject is aimed at students, who, as current or future decision makers would like to lead and implement change through advocacy, development, implementation, and evaluation of environmental change and health strategies and policies.",
        "Last updated: 17 July 2024"
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "Standard 200 Point Program (no Advanced Standing):",
            "SIX core subjects and NINE elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects, EIGHT elective subjects and either a Research Project or Professional Practice unit",
            "175 Point Pathway:",
            "SIX core subjects and SEVEN elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects, SIX elective subjects and either a Research Project or Professional Practice unit",
            "150 Point Pathway:",
            "SIX core subjects and FIVE elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects and FOUR elective subjects and either a Research Project or Professional Practice unit"
        ],
        "Subject Options": [],
        "Core Subjects": [
            {
                "POPH90217": "Foundations of Public Health Credits",
                "POPH90013": "Biostatistics Credits",
                "POPH90014": "Epidemiology 1 Credits",
                "POPH90218": "Public Health Leadership and Management Credits",
                "POPH90231": "Qualitative Research in Public Health Credits",
                "POPH90274": "Prioritising & Planning in Public Health Credits"
            }
        ],
        "Highly Recommended Electives": [
            {
                "POPH90303": "Climate Change and Health Credits",
                "POPH90230": "Planetary and Global Health Credits",
                "POPH90309": "Environmental Health Credits",
                "POPH90304": "Sustainability and Healthcare Credits"
            }
        ],
        "Other Recommended Electives": [
            {
                "MEDI90107": "Disaster Medicine Principles & Responses Credits",
                "POPH90206": "Health Policy Credits",
                "ENST90004": "Climate Change Politics and Policy Credits",
                "POPH90201": "Community Engagement for Health Impact Credits",
                "ABPL90022": "Healthy Communities Credits",
                "POPH90307": "Health System Transformation Credits",
                "ENST90033": "Climate Change Mitigation Credits",
                "POPH90209": "Comparative Health Systems Credits",
                "MULT90004": "Environmental Sustainability Credits",
                "MULT90005": "Partnerships for Sustainable Futures Credits",
                "ENST90034": "Adapting to Climate Change Credits"
            }
        ],
        "Capstone": [
            "There are three Capstone options to choose from - please refer to the Course Entry for detailed information on each of these:",
            [
                "1. Research Project",
                "2. Professional Practice Unit",
                "3. Capstone selective subject & an additional elective"
            ]
        ]
    }
}