{
    "major name": "Construction",
    "overview": [
        "THE COURSE STRUCTURE BELOW ONLY APPLIES TO RE-ENROLLING STUDENTS WHO COMMENCED THEIR STUDIES PRIOR TO 2016",
        "Construction explores the management of people, processes and materials on specific building projects as well as more broadly, across the building industry. Just as the building industry embraces both building and commerce, so will your studies in construction, with subjects undertaken in everything from construction, structures, commerce, management and law. The breadth of the construction profession is further revealed by site visits, guest speakers and teachers who work in the industry who will ensure that your studies are grounded in the real world.",
        "Double majorsare available for certain majors within the Bachelor of Environments. Further information on double majors can be found here:http://edsc.unimelb.edu.au/double-majorsCareers and Further Study:Bachelor of Environments graduates with a construction major might work in construction management or quantity surveying in Australia or internationally. The construction major provides a strong grounding that prepares you for further studies in the Master of Construction Management. For more information on the Master of Construction Management, please visit the Melbourne School of Design web site:http://www.msd.unimelb.edu.au/"
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "100 points of Construction subjects."
        ],
        "Subject Options": [
            "The following description of the Construction major aligns with the Study Plan Structure viewable on the Portal for students who commenced the Bachelor of Environments in 2015 or later.The components within the structure of this major have been designed to enforce the requirements of both this specific major and of the course overall, e.g. the requirement that at least 62.5 points of Environments discipline subjects (which can include subjects taken within the major) are taken at each of Level 2 and Level 3.",
            "Double majorsare available for certain majors within the Bachelor of Environments. Further information on double majors can be found here:http://edsc.unimelb.edu.au/double-majors, if you are interested in any double majors, please check the sample course plan before selecting any elective subjects.PRE-2015 STUDENTS: Students who commenced the Bachelor of Environments prior to 2015 should refer to the handbook entry for the year they commenced in conjunction with the 2015 handbook listings for Environments elective and Breadth subject listings. View 2014 Bachelor of Environments Handbook entry"
        ],
        "Level 1 Environments & Enabling Electives (25 points)": [
            "In order to complete this major, enrol into ALL these subjects in your first year:",
            {
                "ABPL10005": "Understanding the Built Environment Credits",
                "ENVS10009": " Credits"
            },
            "Please noteENVS10009 is not offered in 2017. Students majoring in Construction who have not yet completed this subject may replace it with CONS10001 Principles of Building. For further assistance and information please contactSTOP 1.",
            "IMPORTANT:",
            [
                "1. If you do not have the required mathematics background of VCE Mathematical Methods Units 3 and 4, enrol into MAST10012 Introduction to Mathematics",
                "2. ENVS10005 Governing Environments is recommended to be taken as an Environments Elective.",
                "3. 25 points of recommended breadth subjects can also be chosen as Enabling Electives (see below)"
            ]
        ],
        "Construction major - core subjects (100 points)": [
            "All of",
            {
                "ABPL20036": "Environmental Building Systems Credits",
                "ABPL20042": "Construction of Residential Buildings Credits",
                "ABPL20053": "Construction of Concrete Buildings Credits",
                "ABPL30039": "Construction Contract Administration Credits",
                "ABPL30040": "Measurement of Building Works Credits",
                "ABPL30044": "Industry Partner project Studio Credits",
                "ABPL30046": "Steel and Concrete Structural Systems Credits",
                "ABPL30055": "Construction Management Credits"
            }
        ],
        "Environments Discipline subjects (50 points)": [
            "Choose the total of",
            "50 points of Environments Discipline subjects",
            "RULES:",
            "Please note these rules when choosing the Environments Discipline subjects below",
            [
                "1. Must complete 25 points level 2 subjects"
            ],
            {
                "Environments Discipline subjects": " Credits"
            }
        ],
        "Breadth subjects and restrictions for Construction major students": [
            "RECOMMENDED BREADTH SUBJECTS",
            "In order to meet the requirements for accreditation, students intending to major in Construction are strongly recommended to undertake the following subjects as breadth.25 points of these subjects can also be taken as an Enabling Electives (see above).",
            {
                "ECON10004": "Introductory Microeconomics Credits",
                "BLAW10001": "Principles of Business Law Credits",
                "MGMT20001": "Organisational Behaviour Credits",
                "ACCT10001": "Accounting Reports and Analysis Credits"
            },
            "BREADTH RESTRICTIONS",
            {
                "Restrictions for Breadth Options": " Credits"
            },
            "Students undertaking the Construction major are not permitted to take as breadth:",
            [
                "any Accounting subjects (subject codes beginning ACCT) - with the exception of ACCT10001 Accounting Reports and Analysis"
            ],
            [
                "any Civil Engineering subjects (subject codes beginning CVEN)"
            ],
            [
                "any Economics subjects (subject codes beginning ECON) - with the exception of ECON10004 Introductory Microeconomics"
            ],
            [
                "any Engineering subjects (subject codes beginning ENGR)"
            ],
            [
                "any Geomatics subjects (subject codes beginning GEOM)"
            ],
            [
                "any Management subjects (subject codes beginning MGMT) - with the exception of MGMT20001 Organisational Behaviour"
            ],
            [
                "any of the following subjects:"
            ],
            {
                "ABPL20031": "Principles of Property Credits",
                "ABPL20004": "Principles of Property Valuation Credits",
                "ABPL20033": "Architectural Technology Credits",
                "ABPL30006": "Property Resource Analysis Credits",
                "ABPL30012": "Property Management Credits",
                "ABPL30041": "Architectural Tectonics Credits",
                "ABPL30045": "Property Analysis Studio Credits",
                "ABPL20035": "Cities: From Local to Global Credits"
            }
        ],
        "Notes": [
            "1) For more information on this major and to view a sample course plan please visit:http://edsc.unimelb.edu.au/sample-course-plans-bachelor-environments",
            "The Australian Institute of Building (AIB) has accredited the Bachelor of Environments Construction major as a qualification for AIB Associate membership.",
            "The Bachelor of Environments Construction major provides a pathway into the Master of Construction Management. It is expected that graduates of the Master of Construction Management will have completed the academic requirements for corporate membership of:",
            [
                "Australian Institute of Building (AIB)",
                "Australian Institute of Quantity Surveyors (AIQS)",
                "Royal Institution of Chartered Surveyors (RICS)"
            ],
            "2) B-ENVS majoring in construction students who commenced their studies prior to 2016 and have not completed ENVS 10009 structural environment, may replace this subject with CONS10001 principle of buildings."
        ]
    }
}