{
    "major name": "Criminology",
    "overview": [
        "Criminology draws knowledge and perspectives from a range of disciplines such as law, sociology, psychology, psychiatry and history. Initially, criminology had a strong practical focus: its role was to advise governments on issues such as policing, the management of prisons, sentencing and offender treatment. Concern with policy and practice remains, but criminologists now work in a much wider range of fields including crime prevention, corporate and white-collar crime, business regulation, drug policy and consumer and environmental protection. Criminology doesn’t take crime and criminal law for granted. As an academic discipline it continually questions why different societies define and respond to crime in different ways, and why approaches to punishment and other forms of social control have varied so much from era to era. Increasingly criminologists also study the ways cultures depict crime: whether in newspapers, television and other mass media or in films, novels and art."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "This major requires the completion of:",
            [
                "25 credit points of Level 1 subjects, comprising of either:",
                "\n\n12.5 credit points of Level 1 electives and 12.5 credit points of Arts Discovery (for a single major) OR 25 credit points of Level 1 electives (for a double major)\n",
                "12.5 credit points of Level 2 core subjects",
                "25 credit points of Level 2 electives",
                "12.5 credit points of Level 3 Capstone subjects",
                "25 credit points of Level 3 electives"
            ],
            "12.5 credit points of Level 1 electivesand12.5 credit points of Arts Discovery (for a single major)",
            "OR",
            "25 credit points of Level 1 electives (for a double major)",
            "The subjects MULT20003 is compulsory in the Criminology, Politics and International Studies, and Sociology majors. Students who are completing two majors in any two of these disciplines can only count MULT20003 towards one major. One additional Level 2 subject and one additional Level 3 subject must be completed for the other major.",
            "*Notes:",
            "Students must undertake the Arts Discovery subject as part of the course requirements and the Arts Discovery can be counted in one major only. For this major, you will need to complete two Level 1 subjects.",
            "If you are completing a single major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 elective subject",
            "If you are completing a double major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 Elective subject OR Two Level 1 Elective subjects"
        ],
        "Links": [
            "http://ssps.unimelb.edu.au/study-areas/criminology"
        ],
        "Level 1 electives": [
            {
                "CRIM10001": "Crime, Criminology, and Critique Credits",
                "CRIM10002": "Law in Society Credits"
            }
        ],
        "Level 2 core subject": [
            {
                "MULT20003": "Critical Analytical Skills Credits"
            }
        ],
        "Level 2 electives": [
            {
                "CRIM20002": "Criminal Law and Political Justice Credits",
                "CRIM20003": "Policing Credits",
                "CRIM20004": "Order, Disorder, Crime, and Deviance Credits",
                "CRIM20006": "Punishment and Social Control Credits",
                "CRIM20007": "Cybercrime and Digital Criminology Credits",
                "CRIM20008": "Terrorism: Shifting Paradigms Credits",
                "CRIM20009": "Race, Ethnicity, Crime and Justice Credits",
                "CRIM20010": "Law, Justice and Social Change Credits",
                "GEND20003": "Genders, Bodies & Sexualities Credits",
                "MULT20008": "Australian Indigenous Politics Credits",
                "SOCI20017": "Sexualising Society Credits",
                "CRIM20011": "Abolition Credits"
            }
        ],
        "Level 3 Capstone subject": [
            {
                "CRIM30014": "Contemporary Critical Criminology Credits"
            }
        ],
        "Level 3 electives": [
            {
                "CRIM30001": "Crime and Public Policy Credits",
                "CRIM30002": "Global Criminology Credits",
                "CRIM30005": "Corporate Power and White Collar Crime Credits",
                "CRIM30006": "Crime and Culture Credits",
                "CRIM30010": "Managing Justice: Agencies and the State Credits",
                "CRIM30011": "Young People, Crime and Justice Credits",
                "CRIM30012": "Law in Social Theory Credits",
                "MULT30017": "Australian Indigenous Public Policy Credits",
                "SOCI30013": "Survey Design and Analysis Credits",
                "SOCI30014": "Race and Racism in Australia Credits",
                "CRIM30013": "Gender and Crime Credits"
            }
        ]
    }
}