{
    "major name": "Critical Care",
    "overview": [
        "The Department of Critical Care Honours program is designed to offer research projects for students who want to gain experience in medical research but who are not yet enrolled in a medical degree. A particularly attractive aspect of the program is each project addresses a research problem directly relevant to acute human disease.",
        "The projects offered are from leading clinician/scientists in the areas of anaesthesia, emergency medicine and intensive care medicine. All supervisors have prominent national or international profiles with outstanding track records of exceptional mentorship and supervision.",
        "The research project is complemented by a series of seminars and workshops that focuses on critical care research. The focus of the coursework is to provide students a comprehensive knowledge base to facilitate a pragmatic approach that can be used for both research and clinical care purposes. All of the projects offer the opportunity of progression on to higher degrees including a PhD or continued participation during a postgraduate professional degree (medicine, etc.)."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "To be awarded Honours with a specialisation in Critical Care, students must successfully complete 100 credit points over 12 months full time comprising of two (2) advanced coursework subjects and a research project. There are no elective subjects in this Honours program."
        ],
        "Subject Options": [
            "Students must complete 25 credit points of advanced coursework subjects. This is achieved by enrolling in the following subjects in the appropriate semester:",
            {
                "BIOM40001": "Introduction To Biomedical Research Credits",
                "BMSC40011": "Advancing Critical Care Credits"
            },
            "Students must complete a total of 75 credit points of research across the duration of the Honours program:",
            {
                "BMSC40009": "Critical Care Research Project Part 1 Credits",
                "BMSC40010": "Critical Care Research Project Part 2 Credits"
            }
        ]
    }
}