{
    "major name": "Discrete Mathematics / Operations Research",
    "overview": [
        "This specialisation of the Graduate Diploma allows students who have completed an undergraduate degree to refocus or expand their body of knowledge by completing the requirements of the Discrete Mathematics / Operations Research specialisation in the Mathematics and Statistics major of the Bachelor of Science. It provides a pathway into the Master of Science (Mathematics and Statistics)."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "125 credit points",
            "Completion of 125 points:",
            [
                "50 points of study at Level 2 or above",
                "50 points of study at Level 3",
                "25 point of study at Level 9"
            ]
        ],
        "Subject Options": [
            "Subject prerequisites:Details of stream specific requirements can be found at the Graduate Diploma in Science entry and participation requirements page."
        ],
        "Level 2": [
            "Students should select 50 points of level 2 options to meet the pre-requisites for their level 3 choices.",
            "Students must take one of:",
            {
                "MAST20018": "Discrete Maths and Operations Research Credits"
            },
            "Plus one of:",
            {
                "MAST20026": "Real Analysis Credits",
                "MAST20033": "Real Analysis: Advanced Credits"
            },
            "Plus one of:",
            {
                "MAST20004": "Probability Credits",
                "MAST20006": "Probability for Statistics Credits"
            },
            "Plus: one level 2 MAST subject that will meet the pre-requisites for level 3 options."
        ],
        "Level 3": [
            "Students must select 50 points of level 3 subjects.",
            "Students must take all three of:",
            {
                "MAST30012": "Discrete Mathematics Credits",
                "MAST30013": "Techniques in Operations Research Credits",
                "MAST30021": "Complex Analysis Credits"
            },
            "Plus: one of any other level 3 subject offered by the Department of Mathematics and Statistics."
        ],
        "Level 9": [
            "Plus: 25 points of level 9 subjects selected from listed discipline subjects in theMaster of Science (Mathematics and Statistics)program."
        ]
    }
}