{
    "major name": "Environmental Science",
    "overview": [
        "THE COURSE STRUCTURE BELOW ONLY APPLIES TO RE-ENROLLING STUDENTS WHO COMMENCED THEIR STUDIES PRIOR TO 2016",
        "Impact on the Earth's environment arises from human activities, including land degradation and industrial pollution, as well as naturally occurring phenomena, such as earthquakes, cyclones and tsunamis. Studies in Environmental Science provides students with the skills to identify and understand the causes or environmental problems triggered by human activity.",
        "Careers and Further Study",
        "A major in Environmental Science opens doors to laboratory, outdoor and indoor careers. Specialisations can include studies in hydrogeology, marine and terrestrial ecology, conservation biology and assessing and measuring environmental risk.",
        "The Environmental Science major also provides a pathway to the Master of Science (Environmental Science) which was launched in 2009. For more information on the Master of Science please visit the Melbourne Graduate School of Science web site:http://graduate.science.unimelb.edu.au"
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "112.5 credit points",
            "112.5 points of Environmental Science subjects."
        ],
        "Subject Options": [
            "The following description of the Environmental Science major aligns with the Study Plan Structure viewable on the Portal for students who commenced the Bachelor of Environments in 2015 or later.",
            "The components within the structure of this major have been designed to enforce the requirements of both this specific major and of the course overall, e.g. the requirement that at least 62.5 points of Environments discipline subjects (which can include subjects taken within the major) are taken at each of Level 2 and Level 3.",
            "PRE-2015 STUDENTS: Students who commenced the Bachelor of Environments prior to 2015 should refer to the handbook entry for the year they commenced in conjunction with the 2015 handbook listings for Environments elective and Breadth subject listings. View 2014 Bachelor of Environments Handbook entry."
        ],
        "Level 1 Optional Core and Environments & Enabling Electives (25 points)": [
            "In order to complete this major, enrol in the following Level 1 Optional Core subject:",
            {
                "ENVS10001": "Natural Environments Credits"
            },
            "IMPORTANT: This subject can also be taken as a Level 1 Environments Elective.",
            "PLUS one of the following:",
            {
                "MAST10002": "Data & Decisions Credits",
                "MAST10005": "Calculus 1 Credits",
                "MAST10006": "Calculus 2 Credits",
                "MAST10007": "Linear Algebra Credits",
                "MAST10010": "Data Analysis Credits"
            },
            "This requirement may be taken as breadth."
        ],
        "Environmental Science major - core subjects (37.5 points)": [
            "All of",
            {
                "ECOL20003": "Ecology Credits",
                "EVSC30002": "Problem Solving in Environmental Science Credits",
                "EVSC30003": "Environmental Risk Assessment Credits"
            }
        ],
        "Major Electives & Environments Discipline subjects": [
            "Choose the total of",
            [
                "1. 75 points of Major elective subjects;",
                "2. 37.5 points of Environments Discipline subjects"
            ],
            "RULES:",
            "Please note these rules when choosing the Major electives & Environments Discipline subjects below",
            [
                "1. Must complete 50 points level 2 subjects",
                "2. Must complete 37.5 points level 3 subjects"
            ]
        ],
        "Major Electives (75 points)": [
            "Select from the list below",
            {
                "CHEM10004": "Chemistry 2 Credits",
                "CHEM20011": "Environmental Chemistry Credits",
                "CHEM20018": "Chemistry: Reactions and Synthesis Credits",
                "CHEM20019": "Practical Chemistry 2 Credits",
                "CHEM20020": "Chemistry: Structure and Properties Credits",
                "EVSC20001": "Leaves to Landscape Credits",
                "MAST20006": "Probability for Statistics Credits",
                "MAST20005": "Statistics Credits",
                "GEOG20002": "Landscapes and Environmental Change Credits",
                "ERTH20001": "Dangerous Earth Credits",
                "BOTA30004": "Vegetation Management and Conservation Credits",
                "CHEM30012": "Analytical & Environmental Chemistry Credits",
                "ECOL30005": "Applied Ecology Credits",
                "ERTH30001": "Hydrogeology/Environmental Geochemistry Credits",
                "GEOG30022": "Riverine Landscapes: Hydrology & Ecology Credits",
                "GEOM30009": "Imaging the Environment Credits",
                "MAST30025": "Linear Statistical Models Credits",
                "EVSC30006": "Ecology of Urban Landscapes Credits",
                "GEOG30001": "Geomorphology: Catchment to Coast Credits",
                "ECOL30007": "Marine Biodiversity and Biogeography Credits",
                "ENST20002": " Credits",
                "FRST30002": "Fire in the Australian Landscape Credits"
            }
        ],
        "Environments Discipline subjects (37.5 points)": [
            {
                "Environments Discipline subjects": " Credits"
            }
        ],
        "Breadth subjects and restrictions for Environmental Science major students": [
            "The breadth requirements for the Bachelor of Environments include the restriction of some subjects as breadth options, depending on an individual student’s choice of major. Subjects in the Handbook that are marked as available as breadth in the Bachelor of Environments may be subject to further restrictions, depending up which major a student is completing in that course. For detailed information on these Restrictions for Breadth Options view 2016 Handbook.",
            "Students undertaking the Environmental Science major are not permittedto take as breadth:",
            [
                "any Agricultural Science subjects (subject codes beginning AGRI )"
            ],
            [
                "any Biology subjects (subject codes beginning BIOL)"
            ],
            [
                "any Biochemistry and Molecular Biology subjects (subject codes beginning BCMB)"
            ],
            [
                "any Botany/Plant Science subjects (subject codes beginning BOTA)."
            ],
            [
                "any Chemistry subjects (subject codes beginning CHEM)"
            ],
            [
                "any Civil Engineering subjects (subject codes beginning CVEN)"
            ],
            [
                "any Engineering subjects (subject codes beginning ENGR)"
            ],
            [
                "any Environmental Science subjects (subject codes beginning EVSC)"
            ],
            [
                "any Geography subjects (subject codes beginning GEOG)"
            ],
            [
                "any Geomatics subjects (subject codes beginning GEOM)"
            ],
            [
                "any Mathematics and Statistics subjects (subject codes beginning MAST)"
            ],
            [
                "any Physics subjects (subject codes beginning PHYC)"
            ]
        ],
        "Notes": [
            "For more information on this major and to view a sample course plan please visit:http://edsc.unimelb.edu.au/sample-course-plans-bachelor-environments"
        ]
    }
}