{
    "major name": "Epidemiology and Biostatistics",
    "overview": [
        "After completing subjects within this specialisation, students will be trained to design epidemiological studies and appraise epidemiological literature. Students will also develop a broad understanding and sound practical skills in biostatistics that will enable them to analyse and appropriately interpret epidemiological data.",
        "Depending on which electives are taken, students will develop skills in reporting the results of epidemiological studies, performing systematic reviews of epidemiological literature, including meta-analysis, and in specialised areas such as genetic epidemiology and the epidemiology of infectious diseases.",
        "Students taking subjects from this specialisation will train to work in the field of health and public health research. On graduation they will be ready to contribute to the improvement of population health through quantitative research and discovery. At graduation students will be able to develop and conduct health research and be able to analyse data from health research projects and routine data collections. Additionally, students will discover ‘contemporary’ epidemiological thinking and skills, and upon graduation will become frontrunners in this emerging area. The skills developed in this stream could be applied to many different fields in public and clinical health research, including but not limited to, mental health, sexual health, infectious diseases, and non-communicable disease prevention and management, health service improvement. Such skills can be applied in an Australian or international setting.",
        "Possible roles in the field of epidemiology and biostatistics include epidemiologist, health data analyst, research assistant, research fellow and PhD student. Organisations that employ people in the epidemiology and biostatistics field include national, regional, state/provincial governments; large health care services providers; research institutions, and academic institutions.",
        "Last updated: 17 July 2024"
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "Standard 200 Point Program (no Advanced Standing):",
            "SIX core subjects and NINE elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects, EIGHT elective subjects and either a Research Project or Professional Practice unit",
            "175 Point Pathway:",
            "SIX core subjects and SEVEN elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects, SIX elective subjects and either a Research Project or Professional Practice unit",
            "150 Point Pathway:",
            "SIX core subjects and FIVE elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects and FOUR elective subjects and either a Research Project or Professional Practice unit"
        ],
        "Subject Options": [],
        "Core Subjects": [
            {
                "POPH90217": "Foundations of Public Health Credits",
                "POPH90013": "Biostatistics Credits",
                "POPH90014": "Epidemiology 1 Credits",
                "POPH90218": "Public Health Leadership and Management Credits",
                "POPH90231": "Qualitative Research in Public Health Credits",
                "POPH90274": "Prioritising & Planning in Public Health Credits"
            }
        ],
        "Highly Recommended Electives": [
            {
                "POPH90144": "Regression Methods in Health Research Credits",
                "POPH90242": "Epidemiology 2 Credits"
            }
        ],
        "Other Recommended Electives": [
            {
                "POPH90243": "Epidemiology in Practice Credits",
                "POPH90112": "Infectious Disease Epidemiology Credits",
                "POPH90145": "Survival Analysis & Regression for Rates Credits",
                "POPH90111": "Genetic Epidemiology Credits",
                "POPH90271": "Infectious Diseases Modelling Credits",
                "POPH90093": "Economic Evaluation 1 Credits"
            }
        ],
        "Capstone": [
            "There are three Capstone options to choose from - please refer to the Course Entry for detailed information on each of these:",
            [
                "1. Research Project",
                "2. Professional Practice Unit",
                "3. Capstone selective subject & an additional elective"
            ]
        ]
    }
}