{
    "major name": "Genetics",
    "overview": [
        "Students completing a Genetics major will be prepared for careers or advanced study which involve the application of fundamental genetics, genomics, evolutionary, population and ecological genetics to all areas of biology, biomedical sciences and biotechnology. Graduates will develop knowledge and skills in the theory of genetics and molecular biology, population genetics and evolution and in experimental design, data recording and analysis and scientific writing, which are essential preparation for roles in universities, research institutes, government departments, hospitals and in the biotechnology industry.",
        "This major will integrate knowledge across the breadth of genetics, including an integrated practical capstone subject in which the students develop an understanding of the application of experimental analysis to solving problems in biology. Students will gain experience preparing them for the workplace by participating in problem-solving, synthesis of information, written work, and independent as well as collaborative activities. The transferable skills developed in this major can be used in broad careers in science, including conservation, teaching, forensics, publishing, genetic counselling and research and in careers beyond the field of science."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "50 credit points",
            {
                "GENE30001": "Evolutionary Genetics and Genomics Credits",
                "GENE30002": "Genes: Organisation and Function Credits",
                "GENE30004": "Genetic Analysis Credits"
            },
            "AND",
            {
                "BCMB30003": "Molecular Aspects of Cell Biology Credits",
                "BOTA30002": "Plant Evolution Credits",
                "CEDB30002": "Concepts in Cell & Developmental Biology Credits",
                "GENE30005": "Human and Medical Genetics Credits",
                "MIIM30002": "Principles of Immunology Credits",
                "MIIM30011": "Medical Microbiology: Bacteriology Credits",
                "SCIE30001": "Science Research Project Credits",
                "SCIE30002": "Science and Technology Internship Credits",
                "ZOOL30004": "Evolutionary Applications Credits"
            }
        ]
    }
}