{
    "major name": "Health, Gender and Society",
    "overview": [
        "It is well established that deep social inequalities undermine public health in societies across the globe.  These inequalities shape health outcomes, the experience of and access to health care, and the effectiveness of health promotion interventions.  In this specialisation you will learn how intersecting social structures and processes like colonialism and racism, patriarchy, capitalism and ableism drive disparities in health.  You will acquire tools to conduct meaningful research with communities to address wicked health problems and to jointly develop health interventions with the communities that have the most at stake in them. In this specialisation you will develop knowledge and skills in community engagement and health advocacy that look beyond notions of individual behaviour change to addressing the causes of inequity, and in developing solutions that contribute to fairer and healthier societies.  You will have the option of conducting a research project in an area of your interest with an expert in health sociology, medical anthropology, community psychology, social epidemiology, gender, women’s health, ethics, disability, justice health and children’s participation. Possible roles open to students who complete this specialisation include health promotion officer, community development officer, community health and engagement officer, environmental health officer, health policy adviser, technical adviser and research officer.  Organisations employing graduates with the skills developed in this specialisation are diverse.  Past graduates have gone on to positions with local, state/provincial and federal governments; national and international non-government organisations; community-based organisations; UN agencies; think tanks and advocacy organisations; universities and research institutes; health and social care service providers; as consultants in the private sector; and to entry into higher degree research programs.",
        "Last updated: 17 July 2024"
    ],
    "ILOs": [],
    "structure": {
        "Structure": [],
        "Standard 200 Point Program (no Advanced Standing):": [
            "SIX core subjects and NINE elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects, EIGHT elective subjects and either a Research Project or Professional Practice unit",
            "175 Point Pathway:",
            "SIX core subjects and SEVEN elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects, SIX elective subjects and either a Research Project or Professional Practice unit",
            "150 Point Pathway:",
            "SIX core subjects and FIVE elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects and FOUR elective subjects and either a Research Project or Professional Practice unit"
        ],
        "Subject Options": [],
        "Core Subjects": [
            {
                "POPH90217": "Foundations of Public Health Credits",
                "POPH90013": "Biostatistics Credits",
                "POPH90014": "Epidemiology 1 Credits",
                "POPH90218": "Public Health Leadership and Management Credits",
                "POPH90231": "Qualitative Research in Public Health Credits",
                "POPH90274": "Prioritising & Planning in Public Health Credits"
            }
        ],
        "Highly Recommended Electives": [
            {
                "POPH90201": "Community Engagement for Health Impact Credits",
                "POPH90199": "Gender and Health Credits",
                "POPH90300": "Health and Social Justice Credits",
                "POPH90200": "Advanced Qualitative Health Research Credits"
            }
        ],
        "Other Electives": [
            {
                "POPH90205": "Social Determinants of Health Inequality Credits",
                "POPH90066": "Women and Global Health Credits",
                "POPH90291": "Indigenous Health in a Global Context Credits",
                "POPH90270": "Bioethics in Practice Credits",
                "POPH90189": "Health Program Design & Implementation Credits",
                "POPH90020": "Health Promotion Credits",
                "POPH90297": "Preventing Violence Against Women Credits"
            }
        ],
        "Capstone": [
            "There are three Capstone options to choose from - please refer to the Course Entry for detailed information on each of these:",
            [
                "1. Research Project",
                "2. Professional Practice Unit",
                "3. Capstone selective subject and an additional elective"
            ]
        ]
    }
}