{
    "major name": "History and Philosophy of Science",
    "overview": [
        "The aim of History and Philosophy of Science is to understand science: how it works, its historical development and its function in modern society. History and Philosophy of Science integrates philosophical, historical and sociological approaches to the study of science. It thus provides students with an insight into scientific methods and objectives without actually having to do science. Students will gain analytical skills in evaluating scientific (and non-scientific) knowledge as well as a broad understanding of the historical development of science in its interactions with philosophy, religion and society."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "This major requires the completion of:",
            [
                "25 credit points of Level 1 subjects, comprising of either:",
                "\n\n12.5 credit points of Level 1 electives and 12.5 credit points of Arts Discovery (for a single major) OR 25 credit points of Level 1 electives (for a double major)\n",
                "37.5 credit points of Level 2 electives",
                "12.5 credit points of Level 3 capstone subjects",
                "25 credit points of Level 3 electives"
            ],
            "12.5 credit points of Level 1 electivesand12.5 credit points of Arts Discovery (for a single major)",
            "OR",
            "25 credit points of Level 1 electives (for a double major)",
            "Level 1 subjects must be successfully completed before progressing to Level 2 subjects; Level 2 subjects must be successfully completed before progressing to Level 3 subjects.",
            "*Note:",
            "Students must undertake the Arts Discovery subject as part of the course requirements and the Arts Discovery can be counted in one major only. For this major, you will need to complete two Level 1 subjects.",
            "If you are completing a single major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 elective subject.",
            "If you are completing a double major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 Elective subject OR Two Level 1 Elective subjects."
        ],
        "Links": [
            "http://shaps.unimelb.edu.au/history-philosophy-science"
        ],
        "Level 1 electives": [
            {
                "HPSC10002": "Science, Philosophy and Society Credits",
                "HPSC10001": "Plato to Einstein: A History of Science Credits"
            }
        ],
        "Level 2 electives": [
            {
                "HPSC20015": "Astronomy in World History Credits",
                "HPSC20002": "A History of Nature Credits",
                "HPSC20009": "Technology & Contemporary Life Credits",
                "HPSC20020": "God and the Natural Sciences Credits",
                "HPSC20026": "Philosophy of Science Credits",
                "PHIL20033": "The Philosophy of Mind Credits",
                "HPSC20023": "Sex and Gender in the Sciences Credits",
                "HPSC20024": "Debating Science in Society Credits",
                "HPSC20025": "Breeding Better Humans? A History Credits",
                "HIST20080": "Witch-Hunting in European Societies Credits"
            }
        ],
        "Level 3 capstone subject": [
            {
                "HPSC30035": "The Dynamics of Scientific Change Credits"
            }
        ],
        "Level 3 electives": [
            {
                "HPSC30023": "Science and Society Credits",
                "HPSC30034": "Magic, Reason and Science, 1450-1750 Credits",
                "HPSC30019": "Minds and Madness Credits",
                "HPSC30037": "Copernicus to Darwin: A Cultural History Credits",
                "HPSC30038": "Exploring Digital Realities Credits",
                "HIST30004": "A History of Sexualities Credits"
            },
            "Students are recommended to take one of the following subject sequences within their major:",
            "Methodological Approaches to History and Philosophy of Science: HPSC30023, HPSC20026, HPSC30034, HPSC30035",
            "History of Science: HPSC20015, HPSC20022",
            "Science, Technology and Society: HPSC10003, HPSC20009, HPSC30023",
            "Life Sciences: HPSC20002",
            "Minds, Belief and History: HPSC20015, HPSC20020, HPSC30019, HPSC30034",
            "Philosophy of Science:  HPSC20020, HPSC20026, HPSC30035"
        ]
    }
}