{
    "major name": "Human Computer Interaction",
    "overview": [],
    "ILOs": [],
    "structure": {
        "Structure": [
            "75 credit points",
            "The Human Computer Interaction specialisation is completed by undertaking 75 credit points of required study.",
            "Note:",
            "Students entering the course with advanced standing who plan on completing a specialisation may need to enrol in core specialisation subjects in their commencing semester. Please check and follow the structure outlined for your intended specialisation and seek course planning advice.",
            "To obtain a specialisation in Human Computer Interaction, students must complete:",
            [
                "25 credit points of Year 3 core specialisation subjects",
                "A minimum of 37.5 credit points of Human Computer Interaction electives (Year 2: 25 credit points; Year 3: a minimum of 12.5 credit points)",
                "A maximum of 12.5 credit points of Year 3 Software Engineering/Approved electives"
            ],
            "Year 1",
            [
                "50 credit points of Year 1 compulsory subjects",
                "12.5 credit points of Year 1 Software Engineering Group A selectives",
                "12.5 credit points of Year 1 Software Engineering Group B selectives",
                "12.5 credit points of Year 1 Group A electives",
                "12.5 credit points of Year 1 Group B electives"
            ],
            "Year 2",
            [
                "75 credit points of Year 2 compulsory subjects",
                "25 credit points of Human Computer Interaction electives"
            ],
            "Year 3",
            [
                "50 credit points of Year 3 compulsory subjects",
                "25 credit points of Year 3 core specialisation subjects",
                "25 credit points of electives includingA minimum of 12.5 credit points of Human Computer Interaction electives\n",
                "A minimum of 12.5 credit points of Human Computer Interaction electives"
            ],
            [
                "A minimum of 12.5 credit points of Human Computer Interaction electives"
            ],
            "Progression:",
            "The core subject lists are divided into specific year levels, reflecting the recommended order of completing the course. There is, however, some flexibility between Year 2 and 3 core subjects, depending on the requisites set between them. Check the individual Handbook entries of these subjects for more detail."
        ],
        "Subject options": [],
        "Year 3 core specialisation subjects": [
            {
                "INFO90003": "Designing Novel Interactions Credits",
                "INFO90004": "Evaluating the User Experience Credits"
            },
            "(Must be completed in Year 3 of the course)"
        ],
        "Human Computer Interaction electives": [
            {
                "COMP90015": "Distributed Systems Credits",
                "COMP90018": "Mobile Computing Systems Programming Credits",
                "COMP90049": "Introduction to Machine Learning Credits",
                "GEOM90007": "Information Visualisation Credits",
                "INFO90005": "Information Architecture Credits",
                "INFO90006": "Fieldwork for Design Credits",
                "INFO90007": "Social Computing Credits"
            },
            "Master of Software Engineering subject lists",
            "Please see the main Master of Software Engineering page for remaining relevant subject lists."
        ]
    }
}