{
    "major name": "Indigenous Health",
    "overview": [
        "The Indigenous Health Specialisation of the MPH provides students with the knowledge and skills to contribute to programs and practices related to Indigenous health and increase their understanding of the determinants of Indigenous health. It will provide the rapidly expanding workforce in Indigenous public health with specialist knowledge aligned with their work.",
        "The specialisation aims to support students understanding of; the Indigenous determinants of health; contemporary Indigenous health status considering the historical context and the ongoing impact of colonisation; Indigenous knowledges relating to health; the importance of Indigenous concepts of place and the effect local, regional, urban, and global settings have on Indigenous health; and principles of effective collaboration with Indigenous communities, institutions, workers, and practitioners in critical areas of Indigenous health intervention in Indigenous contexts. In addition, Indigenous health focused public health content is integrated across the Master of Public Health.",
        "Possible roles in the Indigenous health field include health program coordinators, health program development officers, health policy officers, health policy advisors and health researchers. Organisations that employ people in Indigenous health include Aboriginal Community Controlled Health Services; national, regional, state/provincial, and local governments; globally and locally focused non-government and community based organisations, other health care services providers and academic institutions.",
        "Last updated: 17 July 2024"
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "Standard 200 Point Program (no Advanced Standing):",
            "SIX core subjects and NINE elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects, EIGHT elective subjects and either a Research Project or Professional Practice unit",
            "175 Point Pathway:",
            "SIX core subjects and SEVEN elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects, SIX elective subjects and either a Research Project or Professional Practice unit",
            "150 Point Pathway:",
            "SIX core subjects and FIVE elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects and FOUR elective subjects and either a Research Project or Professional Practice unit"
        ],
        "Subject Options": [],
        "Core Subjects": [
            {
                "POPH90217": "Foundations of Public Health Credits",
                "POPH90013": "Biostatistics Credits",
                "POPH90014": "Epidemiology 1 Credits",
                "POPH90218": "Public Health Leadership and Management Credits",
                "POPH90231": "Qualitative Research in Public Health Credits",
                "POPH90274": "Prioritising & Planning in Public Health Credits"
            }
        ],
        "Highly Recommended Electives": [
            {
                "POPH90200": "Advanced Qualitative Health Research Credits",
                "POPH90291": "Indigenous Health in a Global Context Credits",
                "POPH90308": "Indigenous Data Governance in Health Credits"
            }
        ],
        "Other Electives": [
            {
                "POPH90201": "Community Engagement for Health Impact Credits",
                "POPH90244": "Health and Human Rights Credits",
                "POPH90205": "Social Determinants of Health Inequality Credits"
            }
        ],
        "Capstone": [
            "There are three Capstone options to choose from - please refer to the Course Entry for detailed information on each of these:",
            [
                "1. Research Project",
                "2. Professional Practice Unit",
                "3. Capstone selective subject & an additional elective"
            ]
        ]
    }
}