{
    "major name": "Infectious Disease Epidemiology",
    "overview": [
        "Students taking subjects within this specialisation will develop a deep understanding of the fundamental differences between the epidemiology of infectious and non-infectious diseases. The key principles of transmission, immunity and control of infectious diseases will be introduced, along with appropriate data analysis techniques. Students will learn how to examine and appraise infectious disease surveillance systems and to analyse, interpret and present outbreak data. Using real world examples, students will be able to distinguish between different types of infectious disease modelling frameworks and develop confidence in assessing the suitability of models to support decision making. Possible roles in the infectious diseases field include epidemiologist, public health officer, outbreak investigator, program support officer, research assistant and control program evaluator. Organisations that employ people in the infectious diseases field include local, state and commonwealth governments, research and academic institutions, health care service providers, pharmaceutical companies and non-government organisations with a focus on health.",
        "Last updated: 17 July 2024"
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "Standard 200 Point Program (no Advanced Standing):",
            "SIX core subjects and NINE elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects, EIGHT elective subjects and either a Research Project or Professional Practice unit",
            "175 Point Pathway:",
            "SIX core subjects and SEVEN elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects, SIX elective subjects and either a Research Project or Professional Practice unit",
            "150 Point Pathway:",
            "SIX core subjects and FIVE elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects and FOUR elective subjects and either a Research Project or Professional Practice unit"
        ],
        "Subject Options": [],
        "Core Subjects": [
            {
                "POPH90217": "Foundations of Public Health Credits",
                "POPH90013": "Biostatistics Credits",
                "POPH90014": "Epidemiology 1 Credits",
                "POPH90218": "Public Health Leadership and Management Credits",
                "POPH90231": "Qualitative Research in Public Health Credits",
                "POPH90274": "Prioritising & Planning in Public Health Credits"
            }
        ],
        "Highly Recommended Electives": [
            {
                "POPH90112": "Infectious Disease Epidemiology Credits",
                "POPH90144": "Regression Methods in Health Research Credits",
                "POPH90271": "Infectious Diseases Modelling Credits"
            }
        ],
        "Other Recommended Electives": [
            {
                "POPH90243": "Epidemiology in Practice Credits",
                "POPH90058": "Health Program Evaluation 1 Credits",
                "POPH90242": "Epidemiology 2 Credits",
                "POPH90145": "Survival Analysis & Regression for Rates Credits",
                "POPH90068": "Prevention and Control of STIs and HIV Credits",
                "POPH90093": "Economic Evaluation 1 Credits",
                "POPH90301": "Pandemic Preparedness and Response Credits"
            }
        ],
        "Capstone": [
            "There are three Capstone options to choose from - please refer to the Course Entry for detailed information on each of these:",
            [
                "1. Research Project",
                "2. Professional Practice Unit",
                "3. Capstone selective subject & an additional elective"
            ]
        ]
    }
}