{
    "major name": "Islamic Studies",
    "overview": [
        "The Islamic Studies program offers students an opportunity to study the development of Islamic history, civilisation and culture from an interdisciplinary perspective. Students will gain insight into and understanding of key areas associated with Islamic Studies such as the foundation texts, early and modern history, philosophical and political thought. Muslim societies in majority and minority contexts, unity and diversity, as well as ethnicity and identity. Subjects in Islamic Studies are taught in English."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "This major requires the completion of:",
            [
                "25 credit points of Level 1 subjects, comprising of either:",
                "\n\n12.5 credit points of Level 1 electives and 12.5 credit points of Arts Discovery (for a single major) OR 25 credit points of Level 1 electives (for a double major)\n",
                "12.5 credit points of Level 2 core subjects",
                "25 credit points of Level 2 electives",
                "12.5 credit points of Level 3 capstone subjects",
                "25 credit points of Level 3 electives"
            ],
            "12.5 credit points of Level 1 electivesand12.5 credit points of Arts Discovery (for a single major)",
            "OR",
            "25 credit points of Level 1 electives (for a double major)",
            "Level 1 subjects must be successfully completed before progressing to Level 2 subjects; Level 2 subjects must be successfully completed before progressing to Level 3 subjects.",
            "*Notes:",
            "Students must undertake the Arts Discovery subject as part of the course requirements and the Arts Discovery can be counted in one major only. For this major, you will need to complete two Level 1 subjects.",
            "If you are completing a single major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 elective subject.",
            "If you are completing a double major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 Elective subject OR Two Level 1 Elective subjects."
        ],
        "Links": [
            "http://www.asiainstitute.unimelb.edu.au/study/islamic_studies"
        ],
        "Level 1 electives": [
            {
                "ISLM10003": "Understanding Islam and Muslim Societies Credits",
                "ISLM10002": "Islam in the Modern World Credits"
            }
        ],
        "Level 2 core subject": [
            {
                "ISLM20003": "The Qur'an: An Introduction Credits"
            }
        ],
        "Level 2 electives": [
            {
                "ASIA20003": "Genders and Desires in Asia Credits",
                "JEWI20006": "Israelis & Palestinians: Conflict, Peace Credits",
                "JEWI20007": "Modern Israel: Good Bad and Disputed Credits",
                "ISLM20015": "Politics: Middle East and South Asia Credits",
                "ISLM20016": "Spirituality in Islam Credits",
                "POLS20025": "International Relations: Key Concepts Credits",
                "INDO20017": "Indonesia in the World Credits",
                "ASIA20007": "Human Rights in Asia and the Middle East Credits"
            }
        ],
        "Level 3 capstone subject": [
            {
                "ISLM30017": "Contemporary Challenges and Islam Credits"
            }
        ],
        "Level 3 electives": [
            {
                "ASIA30003": "Asian Religions in Societal Context Credits",
                "ISLM30003": "Islam and Ethics: Doctrines and Debates Credits",
                "ISLM30018": "Diplomacy: Middle East and South Asia Credits",
                "ISLM30021": "Islam and Gender Credits",
                "SPAN30022": "Tales of Muslim Spain Credits"
            }
        ]
    }
}