{
    "major name": "Italian Studies",
    "overview": [
        "Italian is one of the world’s most important languages strongly influencing languages and cultures around the world. A knowledge of Italian opens up access to a wide range of areas, including history, art, music, as well as to other languages, such as French and Spanish. The overall objective of the Italian Studies program is to teach students to process information from a wide variety of materials in Italian, both written and spoken, and to produce accounts and discussions of that information in a variety of forms. In subjects at all levels, you will be guided towards undertaking independent research projects into areas including language, literature, politics, cinema, theatre, travel writing, food and wine, immigration and identity.",
        "Italian language subjects are organised in a progressive sequence (of units) from Italian 1 through to Italian 6 and beyond. Entry and exit points are determined by the student’s background in the language, placement testing if required, prerequisites, or at the discretion of the Italian Program. Students normally progress through the subjects in consecutive order. Mid-year entry is also possible into subjects with even numbers, subject to appropriate prior experience and approval from the head of the Italian Studies program. Accelerated progression is possible on advice from the Italian Studies program."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "Students will have their appropriate entry point determined by the Italian Studies program, based on evidence of prior learning and/or results of a placement test as required. Please refer to the following link for further information:",
            "Link",
            "The entry points for this major are:",
            [
                "Italian Studies 1 entry point: for students who have very little or no background in the Italian language",
                "Italian Studies 3 entry point: usually for students who have undertaken four or five years of secondary school Italian",
                "Italian Studies 5 entry point: usually for VCE Italian students",
                "Italian Studies 7 entry point: usually for native speakers or near-native speakers of Italian, or for candidates who have spent a number of years in an Italian speaking country"
            ]
        ],
        "Links": [
            "http://languages-linguistics.unimelb.edu.au/"
        ],
        "This major requires the completion of either:": [],
        "Entry Point 1": [
            [
                "25 credit points of EP1 Level 1 Core subjects",
                "37.5 credit points of EP1 Level 2 Core subjects",
                "12.5 credit points of EP1 Level 3 Core subject and 12.5 credit points of Level 3 Capstone Subject and 12.5 credit points of Level 3 Elective subject*"
            ],
            "12.5 credit points of EP1 Level 3 Core subjectand12.5 credit points of Level 3 Capstone Subjectand12.5 credit points of Level 3 Elective subject*"
        ],
        "Entry Point 3": [
            [
                "25 credit points of EP3 Level 1 Core subjects",
                "37.5 credit points of EP3 Level 2 Core subjects",
                "12.5 credit points of EP3 Level 3 Core subjects and 12.5 credit points of Level 3 Capstone Subject and 12.5 credit points of Level 3 Elective subject*"
            ],
            "12.5 credit points of EP3 Level 3 Core subjectsand12.5 credit points of Level 3 Capstone Subjectand12.5 credit points of Level 3 Elective subject*"
        ],
        "Entry Point 5": [
            [
                "25 credit points of EP5 Level 1 Core subjects",
                "37.5 credit points of EP5 Level 2 Core subjects",
                "12.5 credit points of EP5 Level 3 Core subjects and 12.5 credit points of Level 3 Capstone Subject and 12.5 credit points of Level 3 Elective subject*"
            ],
            "12.5 credit points of EP5 Level 3 Core subjectsand12.5 credit points of Level 3 Capstone Subjectand12.5 credit points of Level 3 Elective subject*"
        ],
        "Entry Point 7": [
            [
                "25 credit points of EP7 Level 1 Core subjects",
                "25 credit points of EP7 Level 2 Core subjects and 12.5 credit points of Level 2 Elective subject*",
                "12.5 credit points of Level 3 Capstone Subject and 25 credit points of Level 3 Elective subjects*"
            ],
            "25 credit points of EP7 Level 2 Core subjectsand12.5 credit points of Level 2 Elective subject*",
            "12.5 credit points of Level 3 Capstone Subjectand25 credit points of Level 3 Elective subjects*",
            "* Elective subjects should be taken from group A or subject to convenor approval from group B"
        ],
        "Subject Options": [],
        "Italian Studies Entry Point 1": [],
        "Italian Studies Entry Point 3": [],
        "Italian Studies Entry Point 5": [],
        "Italian Studies Entry Point 7": [],
        "Electives for all Entry Points": [],
        "Level 1 Core subjects - Entry Point 1": [
            {
                "ITAL10004": "Italian 1 Credits",
                "ITAL10005": "Italian 2 Credits",
                "ITAL10008": "Italian 1 (Intensive) Credits"
            }
        ],
        "Level 2 Core subjects - Entry Point 1": [
            {
                "ITAL20007": "Italian 3 Credits",
                "ITAL20008": "Italian 4 Credits",
                "ITAL20009": "Italian Cultural Studies A Credits"
            }
        ],
        "Level 3 Core subjects - Entry Point 1": [
            {
                "ITAL30003": "Italian 5A Credits"
            }
        ],
        "Level 3 Capstone Subject": [
            {
                "ITAL30007": "To Hell with Dante Credits"
            },
            "Students may substitute ITAL20001 Italian Cultural Studies B for either Contemporary Italy: Study Abroad (ITAL20004) or Languages of Venice: Study Abroad (ITAL20006). ITAL20004 and ITAL20006 are selection based and students will need to be selected into one of these subjects. To substitute ITAL20009 students will need to submit an Enrolment Variation form and attach the outcome email from the Faculty of Arts confirming their selection into either ITAL20004 or ITAL20006.",
            "Link"
        ],
        "Level 1 Core subjects - Entry Point 3": [
            {
                "ITAL10001": "Italian 3 Credits",
                "ITAL10002": "Italian 4 Credits"
            }
        ],
        "Level 2 Core subjects - Entry Point 3": [
            {
                "ITAL20009": "Italian Cultural Studies A Credits",
                "ITAL20010": "Italian 6 Credits",
                "ITAL20011": "Italian 5 Credits"
            }
        ],
        "Level 3 Core subjects - Entry Point 3": [
            {
                "ITAL30015": "Italian 7 Credits"
            }
        ],
        "Level 1 Core subjects - Entry Point 5": [
            {
                "ITAL10006": "Italian 5 Credits",
                "ITAL10007": "Italian 6 Credits"
            }
        ],
        "Level 2 Core subjects - Entry Point 5": [
            {
                "ITAL20001": "Italian Cultural Studies B Credits",
                "ITAL20002": "Italian 7 Credits",
                "ITAL20003": "Italian 8 Credits"
            }
        ],
        "Level 3 Core subjects - Entry Point 5": [
            {
                "ITAL30001": "Italian 9 Credits"
            }
        ],
        "Level 1 Core subjects - Entry Point 7": [
            {
                "ITAL10009": "Italian 7 Credits",
                "ITAL10010": "Italian 8 Credits"
            }
        ],
        "Level 2 Core subjects - Entry Point 7": [
            {
                "ITAL20001": "Italian Cultural Studies B Credits",
                "ITAL20012": "Italian 9 Credits"
            }
        ],
        "Level 2 Electives Group A - Entry Point 7": [
            {
                "ITAL20004": "Contemporary Italy Study Abroad Credits",
                "ITAL20006": "Languages of Venice: Study Abroad Credits"
            }
        ],
        "Level 2 Electives Group B - Entry Point 7": [
            {
                "EURO20001": "Language and Society in Europe Credits",
                "EURO20002": "European Modernism Credits",
                "EURO20003": "Memory & Memoirs of 20th Century Europe Credits",
                "EURO20005": "Screening Europe: Image and Identity Credits",
                "EURO20006": "Europe and its Others Credits",
                "EURO20007": "A Taste of Europe: Melbourne Intensive Credits",
                "EURO20008": "Experiencing Italian Foodscapes Credits"
            }
        ],
        "Level 3 Electives - Group A": [
            {
                "ITAL30005": "Contemporary Italy Study Abroad Credits",
                "ITAL30006": "Italian Fictions Credits",
                "ITAL30010": "Imaging Italy Credits",
                "ITAL30012": "Languages of Venice: Study Abroad Credits",
                "ITAL30016": "Italian 8 Credits"
            }
        ],
        "Level 3 Electives - Group B": [
            {
                "EURO30001": "Language and Society in Europe Credits",
                "EURO30002": "Memory & Memoirs of 20th Century Europe Credits",
                "EURO30003": "European Modernism Credits",
                "EURO30004": "Screening Europe: Image and Identity Credits",
                "EURO30005": "Europe and its Others Credits",
                "EURO30006": "A Taste of Europe: Melbourne Intensive Credits",
                "EURO30007": "Experiencing Italian Foodscapes Credits",
                "LANG30001": "Languages at Work Credits",
                "ARTS30002": "Introduction to Language Translation Credits"
            }
        ]
    }
}