{
    "major name": "Landscape Ecosystem Management",
    "overview": [
        "The Landscape Management major explores rural and urban ecosystems and the human activities that shape these systems. Parks and public open space, protected areas, residential environments, forests and agricultural landscape provide important ecological, amenity and social values, affording, for example, biodiversity, recreation opportunities and economic products such as food production or housing. The major will provide students with an understanding of how these landscapes function, and their use and importance to society. Students will develop an understanding of physical and social components of landscape such as plants, fauna, soils, water, social and economic sub-systems and the complex interrelations between these. Throughout the major, understanding of ecosystems is explored in the context of management issues and strategies, allowing students to develop skills for professional practice in landscape management.",
        "Careers and Further Study",
        "Through its emphasis on solution based learning and practical field work, the landscape management major provides an academic basis for employment in horticulture or natural resource management. It also offers a pathway to professional graduate programs such as the Master of Urban Horticulture, Master of Forest Ecosystem Science and the Master of Environment. For more information on these graduate programs please visit the Melbourne School of Land and Environment web site:http://land-environment.unimelb.edu.au/graduate/"
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "112.5 credit points",
            "112.5 points of Landscape Management subjects."
        ],
        "Subject Options": [
            "The following description of the Landscape Management major aligns with the Study Plan Structure viewable on the Portal for students who commenced the Bachelor of Environments in 2015 or later.",
            "The components within the structure of this major have been designed to enforce the requirements of both this specific major and of the course overall, e.g. the requirement that at least 62.5 points of Environments discipline subjects (which can include subjects taken within the major) are taken at each of Level 2 and Level 3.",
            "PRE-2015 STUDENTS: Students who commenced the Bachelor of Environments prior to 2015 should refer to the handbook entry for the year they commenced in conjunction with the 2015 handbook listings for Environments elective and Breadth subject listings. View 2014 Bachelor of Environments Handbook entryhere"
        ],
        "Level 1 Optional Core (50 points)": [
            "In order to complete this major, you must enrol in the following subjects in your first year:",
            {
                "BIOL10001": "Biology of Australian Flora & Fauna Credits",
                "ENVS10002": " Credits",
                "ENVS10001": "Natural Environments Credits"
            },
            "And you must enrol in at least one of the following:",
            {
                "ENVS10007": " Credits",
                "ENVS10005": " Credits",
                "ENVS10011": " Credits"
            }
        ],
        "Landscape Management major - core subjects (75 points)": [
            "All of",
            {
                "ECOL20003": "Ecology Credits",
                "ENST20001": "Human Behaviour and Environment Credits",
                "EVSC20005": " Credits",
                "EVSC30007": "Landscape Ecosystem Project Credits"
            },
            [
                "EVSC20001",
                "EVSC20002"
            ]
        ],
        "Major Electives & Environments Discipline subjects": [
            "Choose the total of",
            [
                "1. 37.5 points of Major elective subjects;",
                "2. 37.5 points of Environments Discipline subjects"
            ],
            "RULES:",
            "Please note these rules when choosing the Major electives & Environments Discipline subjects below",
            [
                "1. Must complete 50 points level 3 subjects"
            ]
        ],
        "Major Electives (37.5 points)": [
            "Select from the list below",
            {
                "HORT20026": " Credits",
                "GEOG20003": "Environmental Politics and Management Credits",
                "BOTA30004": "Vegetation Management and Conservation Credits",
                "EVSC30006": "Ecology of Urban Landscapes Credits",
                "GEOM20013": "Applying Digital Infrastructure Credits",
                "HORT20027": "Greening Landscapes Credits",
                "FRST30001": "Forest Systems Credits",
                "FRST30002": " Credits",
                "FRST20014": " Credits"
            }
        ],
        "Environments Discipline subjects (37.5 points)": [
            "Select from this list:Environments Discipline subjects"
        ],
        "Breadth subjects and restrictions for Landscape Management major students": [
            "The breadth requirements for the Bachelor of Environments include the restriction of some subjects as breadth options, depending on an individual student’s choice of major. Subjects in the Handbook that are marked as available as breadth in the Bachelor of Environments may be subject to further restrictions, depending up which major a student is completing in that course. Detailed information on theseRestrictions for Breadth Optionsis available.",
            "Students undertaking the Landscape Management major are not permitted to take as breadth:",
            [
                "any Agricultural Science subjects (subject codes beginning AGRI)"
            ],
            [
                "any Biology subjects (subject codes beginning BIOL)"
            ],
            [
                "any Botany/Plant Science subjects (subject codes beginning BOTA)"
            ],
            [
                "any Earth Sciences subjects (subject codes beginning ERTH)"
            ],
            [
                "any Ecology subjects (subject codes beginning ECOL)"
            ],
            [
                "any Environmental Science subjects (subject codes beginning EVSC)"
            ],
            [
                "any Geography subjects (subject codes beginning GEOG)"
            ],
            [
                "any Geology subjects (subject codes beginning GEOL)"
            ],
            [
                "any Horticulture subjects (subject codes beginning HORT)"
            ]
        ],
        "Notes": [
            "For more information on this major and to view a sample course plan see:http://edsc.unimelb.edu.au/sample-course-plans-bachelor-environments"
        ]
    }
}