{
    "major name": "Landscape Architecture",
    "overview": [
        "THE COURSE STRUCTURE BELOW ONLY APPLIES TO RE-ENROLLING STUDENTS WHO COMMENCED THEIR STUDIES PRIOR TO 2016",
        "Landscape Architecture is a design profession which provides a unique bridge between design and the environmental sciences. This major explores the practice, theory, history, and long-standing ecological sensibilities of the discipline. Landscape Architecture ranges across all scales of design encompassing large-scale public projects such as the Olympic Parks in Sydney and Beijing, to suburban development, to smaller urban spaces and gardens.",
        "Landscape Architecture offers creative opportunities to engage in core ecological, cultural and social issues faced today. Students of Landscape Architecture are attracted to its creativity and diversity, its challenges and demands.",
        "From 2016 double majorsare available for certain majors within the Bachelor of Environments. Further information on double majors can be found here:http://edsc.unimelb.edu.au/double-majors.",
        "Careers and Further Study",
        "A major in Landscape Architecture prepares students either for employment or the two-year Master of Landscape Architecture program to become an accredited landscape architect. For more information about the Master of Landscape Architecture, please visit the Melbourne School of Design web site:http://msd.unimelb.edu.au/"
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "100 points of Landscape Architecture subjects."
        ],
        "Subject Options": [
            "The following description of the Landscape Architecture major aligns with the Study Plan Structure viewable on the Portal for students who commenced the Bachelor of Environments in 2015 or later.",
            "The components within the structure of this major have been designed to enforce the requirements of both this specific major and of the course overall, e.g. the requirement that at least 62.5 points of Environments discipline subjects (which can include subjects taken within the major) are taken at each of Level 2 and Level 3.",
            "From 2016 double majorsare available for certain majors within the Bachelor of Environments. Further information on double majors can be found here:http://edsc.unimelb.edu.au/double-majors. If you are interested in any double majors, please check the sample course plan before selecting any elective subjects",
            "PRE-2015 STUDENTS: Students who commenced the Bachelor of Environments prior to 2015 should refer to the handbook entry for the year they commenced in conjunction with the 2015 handbook listings for Environments elective and Breadth subject listings. View 2014 Bachelor of Environments Handbook entry."
        ],
        "Level 1 Environments & Enabling Electives (12.5 points)": [
            "In order to complete this major, enrol in ONE of the following subjects:",
            {
                "ENVS10004": "Designing Environments Credits",
                "ABPL10003": "Visualising Environments Credits"
            },
            "IMPORTANT:ENVS10006 Mapping Environments is recommended to be taken as an Environments Elective."
        ],
        "Landscape Architecture major - core subjects (75 points)": [
            "All of",
            {
                "ABPL20047": "Site Tectonics Credits",
                "HORT20026": "Designing with Plants Credits",
                "ABPL30042": "Landscape Studio: Urban Open Space Credits",
                "ABPL30049": "Case Studies in Landscape Architecture Credits",
                "ABPL30061": "Landscape Studio: Designed Ecologies Credits"
            }
        ],
        "Major electives subjects (25 points)": [
            "Selecttwoof",
            {
                "ABPL20027": "Architecture Design Studio: Earth Credits",
                "ABPL20038": "Explorations (Landscape Studio 1) Credits",
                "ABPL20040": "Landscape Studio 2: Site Plan & Design Credits"
            }
        ],
        "Environments Discipline subjects (50 points)": [
            "Choose the total of",
            [
                "1. 50 points of Environments Discipline subjects"
            ],
            "RULES:",
            "Please note these rules when choosing the Environments Discipline subjects below",
            [
                "1. Must complete 12.5 points level 2 subjects",
                "2. Must complete 12.5 points level 3 subjects"
            ],
            {
                "Environments Discipline subjects": " Credits"
            }
        ],
        "Breadth subjects and restrictions for Landscape Architecture major students": [
            "The breadth requirements for the Bachelor of Environments include the restriction of some subjects as breadth options, depending on an individual student’s choice of major. Subjects in the Handbook that are marked as available as breadth in the Bachelor of Environments may be subject to further restrictions, depending up which major a student is completing in that course. For detailed information on these Restrictions for Breadth Options view 2016 Handbook",
            "Students undertaking the Landscape Architecture major are not permitted to take as breadth:",
            [
                "any Botany/Plant Science subjects (subject codes beginning BOTA)"
            ],
            [
                "any Ecology subjects (subject codes beginning ECOL)"
            ],
            [
                "any Horticulture subjects (subject codes beginning HORT)"
            ],
            [
                "any of the following Level 2 or Level 3 Design subjects:"
            ],
            {
                "ABPL20027": "Architecture Design Studio: Earth Credits",
                "ABPL20028": "Architecture Design Studio: Water Credits",
                "ABPL20030": "Foundations of Architecture Credits",
                "ABPL20036": "Environmental Building Systems Credits",
                "ABPL30037": "Architecture Design Studio: Fire Credits",
                "ABPL30048": "Architecture Design Studio: Air Credits",
                "ABPL30050": "Modern Architecture: MoMo to PoMo Credits",
                "ABPL30051": "Urban Morphological Mapping Credits",
                "ABPL30053": "Formative Ideas in Architecture Credits"
            }
        ],
        "Notes": [
            "For more information on this major and to view a sample course plan please visit:http://edsc.unimelb.edu.au/sample-course-plans-bachelor-environments",
            "The Bachelor of Environments Landscape Architecture major provides a pathway into the Master of Landscape Architecture. The Master of Landscape Architecture program is recognised and accredited by the Australian Institute of Landscape Architects (AILA)."
        ]
    }
}