{
    "major name": "Management",
    "overview": [
        "Effective managers lead businesses and organisations in achieving their goals. Studying management equips you with the leadership, analysis, planning and decision-making skills you need to succeed from day one.",
        "By undertaking a major in Management, you will learn about your own personal effectiveness, how to work in teams, and how to solve real organisational problems. You will understand the principles of making good business decisions, managing business operations, dealing with change, thinking globally, and acting ethically. In this major, you can choose subjects from specialist areas including business management, human resource management, international business and operations management.",
        "Career options are many and varied, including positions in management consulting, senior business leadership positions, equity and diversity officer, human resources manager, project manager, change management specialist, recruitment consultant, manager of business process improvement, research and development management, and many others.",
        "The Management major is also a valuable complement to studies in another area, such as accounting or finance."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "37.5 credit points",
            "To obtain a major in Management students need to complete:",
            [
                "12.5 credit points of capstone subjects",
                "25 credit points of Level 3 Management electives"
            ],
            "OR",
            "(for a Double major with Marketing only)*",
            [
                "37.5 credit points of Level 3 Management electives"
            ],
            "*Notes",
            [
                "BUSA30000 must form part of ONE major. Students seeking a double major in Management and Marketing, must complete an additional Level 3 subject in the second major (e.g. 37.5 points of Level 3 subjects not including BUSA30000).",
                "For students who commenced the Bachelor of Commerce prior to 2018, BUSA30000 is not a compulsory requirement for the Management or Marketing majors, but is highly recommended."
            ]
        ],
        "Subject lists": [],
        "Capstone subject": [
            {
                "BUSA30000": "Business Judgement Credits"
            }
        ],
        "Level 3 Management electives": [
            {
                "MGMT30004": "Managing Globally Credits",
                "MGMT30006": "Managing Entrepreneurship and Innovation Credits",
                "MGMT30008": "Managing Sustainably Credits",
                "MGMT30011": "Managing Supply Chain Networks Credits",
                "MGMT30012": "Management Consulting Credits",
                "MGMT30013": "Managing for Competitive Advantage Credits",
                "MGMT30017": "Global Management Consulting Credits",
                "MGMT30019": "The Future of Work Credits"
            }
        ]
    }
}