{
    "major name": "Marketing",
    "overview": [
        "Marketing is essential to the health of any profitable enterprise, whether in the public or private sector. Marketing allows you to manage a brand and contribute to an organisation’s business strategy. A major in marketing will provide you with the tools and skills you need to build relationships with your audience. You will learn how to research and evaluate market opportunities. You will learn how to create compelling value propositions for customers. We will teach you how to design products and communication campaigns that will engage and excite customers. And you will see the importance of putting the customer at the centre of everything the organisation does.",
        "Teaching topics span the breadth of marketing education including advertising, product and brand management, strategic marketing, market research, service and relationship marketing, global marketing, digital marketing and consumer behaviour. Marketing studies offer vital skills and knowledge to underpin your career growth, whatever path you choose to take.",
        "All students graduating with a Bachelor of Commerce majoring in marketing become Associate Members of the Australian Marketing Institute (AMI). Combined with some years of work experience and professional development, you may then become eligible for accreditation as a Certified Practicing Marketer (CPM)."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "37.5 credit points",
            "To obtain a major in Marketing students need to complete:",
            [
                "12.5 credit points of capstone subjects",
                "25 credit points of Level 3 Marketing electives"
            ],
            "OR",
            "(for a Double major with Management only)*",
            [
                "37.5 credit points of Level 3 Marketing electives"
            ],
            "*Notes",
            [
                "BUSA30000 must form part of ONE major. Students seeking a double major in Management and Marketing, must complete an additional Level 3 subject in the second major (e.g. 37.5 points of Level 3 subjects not including BUSA30000).",
                "For students who commenced the Bachelor of Commerce prior to 2018, BUSA30000 is not a compulsory requirement for the Management or Marketing majors, but is highly recommended."
            ]
        ],
        "Subject lists": [],
        "Capstone subject": [
            {
                "BUSA30000": "Business Judgement Credits"
            }
        ],
        "Level 3 Marketing electives": [
            {
                "MKTG30003": "Service and Relationship Marketing Credits",
                "MKTG30006": "Retailing Credits",
                "MKTG30009": "Digital Marketing Credits",
                "MKTG30010": "Advertising and Promotions Credits",
                "MKTG30012": "Business and Marketing Ethics Credits",
                "MKTG30013": "Strategic Marketing Credits"
            }
        ]
    }
}