{
    "major name": "Medicine (St Vincent's Hospital)",
    "overview": [
        "The Honours’ program at the St. Vincent’s Academic Centre (comprising of the Dept. of Medicine, Dept. of Surgery, St. Vincent’s Institute, O’Brien Institute and various Departments in St. Vincent’s Hospital) is an advanced level of study designed to allow students to specialize their knowledge in a particular area of pre-clinical and/ or clinical research. This program provides a strong foundation for the future direction of graduates, whether as a means of progressing to further research at PhD level, or improving the scope of employment in the fields of biomedical research.",
        "The course year starts in February and ends in November and is only available full time.",
        "Admission requirements",
        "In addition to satisfying the Bachelor of Science (Degree with Honours) entry requirements, students are required to have completed stream specific prerequisites. Details of stream specific prerequisites can be found at the Bachelor of Science (Degree with Honours) entry and participation requirements page."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "The Honours program consists of 100 credit points completed over 12 months full time (or part time equivalent) comprising of two (2) Advanced Coursework subjects and a Research Project.",
            "To be awarded Honours with a specialisation in Medicine (St Vincent's Hospital), students must successfully complete the following:",
            [
                "BIOM40001 - Introduction to Biomedical Research (12.5 points)",
                "MEDI40006 - Biomedical Advanced Coursework (12.5 points)",
                "MEDI40005 and MEDI40013 - Research Project - SVHM (75 points)"
            ],
            "There are no elective subjects in this Honours program."
        ],
        "Subject Options": [],
        "Coursework Component": [
            "Students must complete 25 credit points of advanced coursework subjects. This is achieved by enrolling in the following subjects in the appropriate semesters.",
            {
                "BIOM40001": "Introduction To Biomedical Research Credits",
                "MEDI40006": "Biomedical Advanced Coursework Credits"
            }
        ],
        "Research Component": [
            "Students must complete a total of 75 credit points of research across the duration of the Honours program. This is achieved by enrolling in a combination of the following subjects in the appropriate semesters.",
            {
                "MEDI40005": "Research Project - SVHM Part 1 Credits",
                "MEDI40013": "Research Project - SVHM Part 2 Credits"
            }
        ],
        "Links": [
            "MMS Precincts (unimelb.edu.au)"
        ]
    }
}