{
    "major name": "Medicine (Royal Melbourne Hospital)",
    "overview": [
        "The Department of Medicine Honours program is designed to offer projects at the leading edge of medical research into human diseases especially tailored for students who are not enrolled in Medicine. Each project tackles a specific translational medicine problem so that it is directly relevant to a major human disease and is performed in collaboration with research scientists at the leading edge their fields. The projects are designed so that they can be completed within the one year honours program and also to provide a direct conduit to higher degree studies.",
        "Admission requirements",
        "In addition to satisfying the Bachelor of Science (Degree with Honours) entry requirements, students are required to have completed stream specific prerequisites. Details of stream specific prerequisites can be found at the Bachelor of Science (Degree with Honours) entry and participation requirements page.",
        "Most students start their studies at the beginning of Semester one (February), although mid-year entry (August) is also a possibility."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "The Honours program consists of 100 credit points completed over 12 months full time (or part time equivalent) comprising of two (2) Advanced Coursework subjects and a Research Project.",
            "To be awarded Honours with a specialisation in Medicine (RMH), students must successfully complete the following:",
            [
                "BIOM40001 - Introduction to Biomedical Research (12.5 points)",
                "MEDI40004 - Seminars in Translational Medicine (12.5 points)",
                "Research Project (75 points) (BIOL40010 and BIOL40011)"
            ],
            "There are no elective subjects in this Honours program."
        ],
        "Subject Options": [],
        "Coursework Component": [
            "Students must complete 25 credit points of advanced coursework subjects. This is achieved by enrolling in the following subjects in the appropriate semesters.",
            {
                "BIOM40001": "Introduction To Biomedical Research Credits",
                "MEDI40004": "Seminars in Translational Medicine Credits"
            }
        ],
        "Research Component": [
            "Students must complete a total of 75 credit points of research across the duration of the Honours program.",
            {
                "BIOL40010": "Research Project - RMH Part 1 Credits",
                "BIOL40011": "Research Project - RMH Part 2 Credits"
            }
        ],
        "Links": [
            "http://www.medrmhwh.unimelb.edu.au/"
        ]
    }
}