{
    "major name": "Media and Communications",
    "overview": [
        "Media and Communications offers students foundational knowledge for the 21st century. It equips students with a critical understanding of the constantly changing global media environments and technologies, and provides core research and professional skills valued across a range of media sectors. The wide array of subjects that comprise the Media and Communications major cover key developments in media industries, new communication technologies, and their impact on politics, society and culture. While the main focus is on Australia and the Asia-Pacific, the course has a global orientation, reflecting today’s increasingly interconnected media systems, markets, and production ecologies of contemporary digital networks."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "This major requires the completion of:",
            [
                "25 credit points of Level 1 subjects, comprising of either:",
                "\n\n12.5 credit points of Level 1 electives and 12.5 credit points of Arts Discovery (for a single major) OR 25 credit points of Level 1 electives (for a double major)\n",
                "37.5 credit points of Level 2 electives",
                "12.5 credit points of Level 3 Capstone subjects",
                "25 credit points of Level 3 electives"
            ],
            "12.5 credit points of Level 1 electivesand12.5 credit points of Arts Discovery (for a single major)",
            "OR",
            "25 credit points of Level 1 electives (for a double major)",
            "Level 1 subjects must be successfully completed before progressing to Level 2 subjects; Level 2 subjects must be successfully completed before progressing to Level 3 subjects.",
            "*Note:",
            "Students must undertake the Arts Discovery subject as part of the course requirements and the Arts Discovery can be counted in one major only. For this major, you will need to complete two Level 1 subjects.",
            "If you are completing a single major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 elective subject.",
            "If you are completing a double major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 Elective subject OR Two Level 1 Elective subjects."
        ],
        "Notes": [
            "Not all Media and Communications subjects are available as breadth."
        ],
        "Links": [
            "http://www.culture-communication.unimelb.edu.au/study/mediacomm"
        ],
        "Level 1 electives": [
            {
                "MECM10003": "Media and Society Credits",
                "MECM10006": "Communication for Changemaking Credits"
            }
        ],
        "Level 2 electives": [
            {
                "MECM20003": "Internet Communication Credits",
                "MECM20006": "Understanding Australian Media Credits",
                "MECM20010": "Understanding Global Media Credits",
                "MECM20011": "Approaches to Media Research Credits",
                "MECM20013": "Text and Audio Journalism Credits",
                "MECM20014": "Visual Communication and Digital Media Credits",
                "MECM20015": "Advertising, Media and Society Credits"
            }
        ],
        "Level 3 capstone subject": [
            {
                "MECM30002": "Perspectives in Global Media Cultures Credits"
            }
        ],
        "Level 3 electives": [
            {
                "MECM30015": "Media and Communications Project Credits",
                "MECM30016": "Digital Media Research Credits",
                "MECM30004": "Media Industries & Technological Change Credits",
                "MECM30013": "Marketing Communications Credits",
                "MECM30017": "Digital and Mobile Journalism Credits",
                "CULS30006": "Global Cultures Credits"
            }
        ]
    }
}