{
    "major name": "Microbiology and Immunology",
    "overview": [
        "Microbiology is the study of microscopic organisms such as algae, bacteria, fungi, protozoa and viruses. Some microorganisms cause infections, but most live harmlessly and enhance our environment and our lives. Microbiology is a core discipline for most areas of biotechnology.Immunology is the study of the immune system. The immune system is involved in the defence of the body against infection and tumours. It also plays a role in some unwanted events, including allergies, autoimmunity and transplant rejection.Honours in Microbiology and Immunology represents a transition from an undergraduate experience taught in a traditiional lecture format, to being immersed into a laboratory-based cutting edge research environment. This includes designing and executing experiments, and the analysis, interpretation, presentation and communication of data generated by the research actvities. Honours in Microbiology and Immunology provides an opportunity to become directly involved in research that is addressing key questions in the fields of Microbiology and/or Immunology.",
        "The course year starts in February and ends in November and is only available full time.",
        "Admission requirements",
        "In addition to satisfying the Bachelor of Science (Degree with Honours) entry requirements, students are required to have completed stream specific prerequisites. Details of stream specific prerequisites can be found at the Bachelor of Science (Degree with Honours) entry and participation requirements page."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "The Honours program consists of 100 credit points completed over 12 months full time (or part time equivalent) comprising of two Advanced Coursework subjects and a Research Project.",
            "To be awarded Honours with a specialisation in Microbiology and Immunology, students must successfully complete the following:",
            [
                "MIIM40002 - Advanced Microbiology and Immunology  (12.5 points)",
                "BIOM40001 - Introduction to Biomedical Research (12.5 points)",
                "MIIM40005 and MIIM40006 - Microbiology and Immunology Research Project (75 points)"
            ],
            "There are no elective subjects in this Honours program."
        ],
        "Subject Options": [],
        "Coursework Component": [
            "Students must complete 25 credit points of advanced coursework subjects. This is achieved by enrolling in the following subjects in the appropriate semester.",
            {
                "MIIM40002": "Advanced Microbiology and Immunology Credits"
            }
        ],
        "Research Component": [
            "Students must complete a total of 75 credit points of research across the duration of the Honours program. This is achieved by enrolling in a combination of the following subjects in the appropriate semesters.",
            {
                "MIIM40005": "Micro & Immuno Research Project Part 1 Credits",
                "MIIM40006": "Micro & Immuno Research Project Part 2 Credits"
            }
        ],
        "Links": [
            "http://www.microbiol.unimelb.edu.au/"
        ]
    }
}