{
    "major name": "Optometry and Vision Sciences",
    "overview": [
        "Honours in Vision Sciences is a programme across two semesters designed to extend the student’s knowledge and skills through a supervised research project together with advanced coursework in the vision sciences. The research component will involve the student conducting an original research project in one of the laboratories of the Department of Optometry & Vision Sciences under the supervision of one or more academic staff from February to November. The research will be of a level that can potentially contribute to a publication, whether on its own or as part of a larger project. The coursework component will introduce students to current literature in the vision sciences and the various techniques used in different laboratories. There will be an emphasis also on developing the student’s communication skills both orally and in writing. The course year starts in February and ends in November and is only available full time.",
        "Admission requirements",
        "In addition to satisfying the Bachelor of Science (Degree with Honours) entry requirements, students are required to have completed stream specific prerequisites. Details of stream specific prerequisites can be found at the Bachelor of Science (Degree with Honours) entry and participation requirements page."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "The Honours program consists of 100 credit points completed over 12 months full time comprising of two (2) Advanced Coursework subjects and a Research Project.",
            "To be awarded Honours with a specialisation in Vision Science, students must successfully complete the following:",
            "BIOM40001 - Introduction to Biomedical Research (12.5 points)OPTO90018 - The Eye and Vision: A Window to Disease (12.5 points)OPTO40012 and OPTO40013 - Vision Science Research Project (75 points)",
            "There are no elective subjects in this Honours program."
        ],
        "Subject Options": [],
        "Coursework component": [
            "Students must complete 25 credit points of advanced coursework subjects. This is achieved by enrolling in the following subjects in the appropriate semesters.",
            {
                "BIOM40001": "Introduction To Biomedical Research Credits",
                "OPTO90018": "The Eye and Vision: A Window to Disease Credits"
            }
        ],
        "Research component": [
            "Students must complete a total of 75 credit points of research across the duration of the Honours program. This is achieved by enrolling in a combination of the following subjects in the appropriate semesters.",
            {
                "OPTO40012": "Vision Science Research Project Part 1 Credits",
                "OPTO40013": "Vision Science Research Project Part 2 Credits"
            }
        ],
        "Links": [
            "https://healthsciences.unimelb.edu.au/departments/optometry-and-vision-sciences"
        ]
    }
}