{
    "major name": "Otolaryngology",
    "overview": [
        "The Honours program in the Department of Otolaryngology offers an advanced level of study designed to allow students to specialise their knowledge in hearing sciences, and provides students with the skills required to carry out research related to the function of the auditory system, development of neural prostheses and/or the clinical treatment of hearing loss. In achieving this objective, students will develop abilities to critically analyse research literature, formulate research plans based on hypotheses and statistical requirements, present and defend research results and write a coherent research report. This one-year program provides a foundation for graduates wishing to pursue studies at the Masters or PhD levels, as well as those wishing to seek employment in a research environment. The course year starts in February and ends in November and is only available full time.",
        "Admission requirements",
        "In addition to satisfying the Bachelor of Science (Degree with Honours) entry requirements, students are required to have completed stream specific prerequisites. Details of stream specific prerequisites can be found at the Bachelor of Science (Degree with Honours) entry and participation requirements page."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "The Honours program consists of 100 credit points completed over 12 months full time (or part time equivalent) comprising of two (2) Advanced Coursework subjects and a Research Project.",
            "To be awarded Honours with a specialisation in Hearing Sciences (Otolaryngology), students must successfully complete the following:",
            [
                "BIOM40001 - Introduction to Biomedical Research (12.5 points)",
                "OTOL40002 - Otolaryngology Advanced Coursework (12.5 points)",
                "OTOL40001 and OTOL40003 - Otolaryngology Research Project (75 points)"
            ],
            "There are no elective subjects in this Honours program."
        ],
        "Subject Options": [],
        "Coursework Component": [
            "Students must complete 25 credit points of advanced coursework subjects. This is achieved by enrolling in the following subjects in the appropriate semesters.",
            {
                "BIOM40001": "Introduction To Biomedical Research Credits",
                "OTOL40002": "Otolaryngology Advanced Coursework Credits"
            }
        ],
        "Research Component": [
            "Students must complete a total of 75 credit points of research across the duration of the Honours program. This is achieved by enrolling in a combination of the following subjects in the appropriate semesters.",
            {
                "OTOL40001": "Otolaryngology Research Project Part 1 Credits",
                "OTOL40003": "Otolaryngology Research Project Part 2 Credits"
            }
        ],
        "Links": [
            "https://medicine.unimelb.edu.au/school-structure/surgery/about-us/department-precincts/otolaryngology"
        ]
    }
}