{
    "major name": "Paediatrics",
    "overview": [
        "The University of Melbourne Department of Paediatrics offers an Honours Course in collaboration with its campus partners at the Murdoch Childrens Research Institute and the Royal Children’s Hospital. Many diverse and exciting research programs are available on campus and include laboratory, clinical and public health research. The Honours subject provides students with the opportunity to design and conduct a biomedical research project, under supervision, in any one of these areas. Students will develop their own research project through hypothesis testing, experimental design and practical experimentation, statistical analysis, data interpretation and dissemination of the research findings via podium and written presentations. A molecular background in at least one of Biochemistry, Genetics, Biology or Anatomy & Cell Biology subjects is strongly recommended. The course year starts in February and ends in November and is only available full time.",
        "Admission requirements",
        "In addition to satisfying the Bachelor of Science (Degree with Honours) entry requirements, students are required to have completed stream specific prerequisites. Details of stream specific prerequisites can be found at the Bachelor of Science (Degree with Honours) entry and participation requirements page."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "The Honours program consists of 100 credit points completed over 12 months full time comprising of two (2) Advanced Coursework subjects and a Research Project.",
            "To be awarded Honours with a specialisation in the Biology of Human Health and Disease (Paediatrics), students must successfully complete the following:",
            [
                "BIOM40001 Introduction to Biomedical Research (12.5 points)",
                "PAED40002 The Biology of Human Health and Disease (12.5 points)",
                "PAED40001 and PAED40005 - Paediatrics Research Project (75 points)"
            ],
            "There are no elective subjects in this Honours program."
        ],
        "Subject Options": [],
        "Coursework Component": [
            "Students must complete 25 credit points of advanced coursework subjects. This is achieved by enrolling in the following subjects in the appropriate semesters.",
            {
                "BIOM40001": "Introduction To Biomedical Research Credits",
                "PAED40002": "Coursework in Paediatrics & Child Health Credits"
            }
        ],
        "Research Component": [
            "Students must complete a total of 75 credit points of research across the duration of the Honours program. This is achieved by enrolling in a combination of the following subjects in the appropriate semesters.",
            {
                "PAED40001": "Paediatrics Research Project Part 1 Credits",
                "PAED40005": "Paediatrics Research Project Part 2 Credits"
            }
        ],
        "Links": [
            "http://www.paediatrics.unimelb.edu.au/"
        ]
    }
}