{
    "major name": "Philosophy",
    "overview": [
        "Philosophy is the study of the most fundamental aspects of reality and value. Every area of inquiry and endeavour—from art and history through politics and economics to biology and mathematics—generates philosophical issues about our world and our place in it. Philosophers debate the meaning of life and the meaning of adverbs, the analysis of Divine foreknowledge and the analysis of colour, the nature of mathematics and the nature of terrorism.Work in philosophy involves the creative, critical task of constructing, clarifying and comparing ideas. We dig into the fundamental assumptions beneath our everyday views, to see how they hang together, how they can be improved, or how we might have reason to prefer one over another. We learn to take conflicting views seriously, to clarify imprecise concepts, and to synthesize new positions.You learn both traditional and contemporary approaches to individual topics in Philosophy. In tutorials and written work you practice the important skill of advancing cogent and informed arguments of your own.Students go on to apply their philosophical skills in a wide range of different careers where creative and analytic thinking is useful, such as law, education, analysis, advocacy and policy development."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "This major requires the completion of:",
            [
                "25 credit points of Level 1 subjects, comprising of either:",
                "\n\n12.5 credit points of Level 1 electives and 12.5 credit points of Arts Discovery (for a single major) OR 25 credit points of Level 1 electives (for a double major)\n",
                "37.5 credit points of Level 2 electives",
                "12.5 credit points of Level 3 Capstone Subjects",
                "25 credit points of Level 3 electives"
            ],
            "12.5 credit points of Level 1 electivesand12.5 credit points of Arts Discovery (for a single major)",
            "OR",
            "25 credit points of Level 1 electives (for a double major)",
            "*Notes",
            "Students must undertake the Arts Discovery subject as part of the course requirements and the Arts Discovery can be counted in one major only. For this major, you will need to complete two Level 1 subjects.",
            "If you are completing a single major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 elective subject.",
            "If you are completing a double major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 Elective subject OR Two Level 1 Elective subjects."
        ],
        "Links": [
            "http://shaps.unimelb.edu.au/philosophy"
        ],
        "Level 1 electives": [
            {
                "PHIL10002": "Philosophy: The Big Questions Credits",
                "PHIL10003": "Philosophy: The Great Thinkers Credits",
                "ARTS10004": "Philosophy, Politics and Economics Credits",
                "MULT10021": "The Buddhist Universe: An Introduction Credits"
            }
        ],
        "Level 2 electives": [
            {
                "HPSC20026": "Philosophy of Science Credits",
                "PHIL20008": "Ethical Theory Credits",
                "PHIL20030": "Logical Methods Credits",
                "PHIL20033": "The Philosophy of Mind Credits",
                "PHIL20039": "The Nature of Reality Credits",
                "PHIL20040": "Greek Philosophy Credits",
                "PHIL20041": "Phenomenology and Existentialism Credits",
                "PHIL20043": "History of Early Modern Philosophy Credits",
                "PHIL20044": "The Ethics of Capitalism Credits",
                "PHIL20045": "Freedom and Equality Across Borders Credits",
                "PHIL20046": "Feminism Credits",
                "HPSC20020": "God and the Natural Sciences Credits",
                "PHIL20047": "Knowledge and Reality Credits",
                "PHIL20048": "Values of Art Credits"
            }
        ],
        "Level 3 Capstone Subject": [
            {
                "PHIL30007": "The Philosophy of Philosophy Credits"
            }
        ],
        "Level 3 electives": [
            {
                "ISLM30003": "Islam and Ethics: Doctrines and Debates Credits",
                "PHIL30024": "The Foundations of Interpretation Credits",
                "PHIL30043": "The Power and Limits of Logic Credits",
                "PHIL30052": "Race and Gender: Philosophical Issues Credits",
                "PHIL30053": "Philosophy of Language Credits",
                "PHIL30054": "The Metaphysics of Ethics Credits",
                "PHIL30055": "Build-Your-Own: Metaphysics Credits"
            }
        ]
    }
}