{
    "major name": "Physiotherapy Science",
    "overview": [
        "The Department of Physiotherapy Honours program is designed to offer research projects for students who seek to gain experience in clinical physiotherapy science.  The Department of Physiotherapy offers substantial research expertise in a wide range of fields that provide project opportunities, including acute cardiorespiratory rehabilitation, exercise oncology, neurological rehabilitation, musculoskeletal, sports and exercise and paediatrics.",
        "The projects offered are from leading clinician/scientist/researchers, and the research teams have established national or international profiles with outstanding track records of exceptional mentorship and supervision.",
        "The research project is complemented by a series of seminars and workshops that focus on physiotherapy research. All of the projects offer the opportunity of progression to higher degrees including a Masters or PhD. This one-year program also provides an excellent foundation for graduates wishing to pursue physiotherapy or other health professional studies.",
        "The course starts in February, ends in November, and is only available full-time."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "The Honours program consists of 100 credit points completed over 12 months full time comprising of two (2) Advanced Coursework subjects and a Research Project.",
            "To be awarded Honours with a specialisation in Physiotherapy Science, students must successfully complete the following:",
            "Coursework Component",
            "Students must complete 25 credit points of advanced coursework subjects. This is achieved by enrolling in the following subjects in the appropriate semesters.",
            {
                "BIOM40001": "Introduction To Biomedical Research Credits",
                "PHTY40012": "Physiotherapy Research in Practice Credits"
            },
            "Research Component",
            "Students must complete a total of 75 credit points of research across the duration of the Honours program. This is achieved by enrolling in a combination of the following subjects in the appropriate semesters.",
            {
                "PHTY40013": "Physiotherapy Science Research Project 1 Credits",
                "PHTY40014": "Physiotherapy Science Research Project 2 Credits"
            }
        ],
        "Links": [
            "https://healthsciences.unimelb.edu.au/departments/physiotherapy/study/honours"
        ]
    }
}