{
    "major name": "Physical Geography",
    "overview": [
        "A specialisation in Physical Geography will provide students with skills and conceptual frameworks needed to understand the processes that shape the world around us. It brings many disciplines together to examine big picture issues, like climate change and inequality. In Physical Geography, particular attention is given to understanding the spatial and temporal scales of landscapes, their history and their biota, and the processes by which these vary.",
        "Geography is a field-based discipline, enabling students to gain hands-on research experience via practical laboratory classes, field trips, and group project work, whilst also being provided opportunities to develop critical intellectual skills, transferable professional skills, a sense of public responsibility and higher research degree capacities.",
        "Completion of the Graduate Diploma with a specialisation in Physical Geography will allow students to enter careers in the following areas: research institutions, teaching, environmental sciences, resource management and planning, environmental consultancies, industry and all levels of government.",
        "The Graduate Diploma (Physical Geography specialisation) also provides a pathway into the Master of Geography."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "125 credit points",
            "Completion of 125 points:",
            [
                "50 points of study at Level 2 or above;",
                "50 points of study at Level 3;",
                "25 point of study at Level 9"
            ]
        ],
        "Subject Options": [
            "Subject prerequisites:Details of stream specific requirements can be found at the Graduate Diploma in Science entry and participation requirements page."
        ],
        "Level 2": [
            "Students should select 50 points of level 2 options to meet the pre-requisites for their level 3 choices.",
            "Students must select at least three of:",
            {
                "ERTH20001": "Dangerous Earth Credits",
                "GEOG20002": "Landscapes and Environmental Change Credits",
                "GEOG20015": "Environmental Change & the Human Journey Credits",
                "GEOG20017": "Spatial Analysis in Geography Credits"
            },
            "Plus no more than one of:",
            {
                "FRST20014": "Forests in a Global Context Credits",
                "PPMN20002": "Climate Change: Why People Disagree Credits",
                "UNIB20001": "Climate Change ll Credits"
            }
        ],
        "Level 3": [
            "Students must select 50 points of level 3 subjects.",
            "Students must select at least three of:",
            {
                "GEOG30001": "Geomorphology: Catchment to Coast Credits",
                "GEOG30007": "China Field Class Credits",
                "GEOG30022": "Riverine Landscapes: Hydrology & Ecology Credits",
                "GEOG30023": "Global Climate Change in Context Credits",
                "GEOG30025": "Biogeography and Ecology of Fire Credits",
                "GEOG30033": "Arid Australia Field Class Credits"
            },
            "Plus no more than one of:",
            {
                "GEOG30019": "Sustainable Development Credits",
                "GEOG30021": "The Disaster Resilient City Credits",
                "GEOG30024": "Africa: Environment, Development, People Credits",
                "GEOG30026": "East Timor Field Class Credits",
                "GEOG30027": "Local Sites, Global Connections Credits",
                "GEOG30030": "Spatial Modelling for Nature and People Credits"
            }
        ],
        "Level 9": [
            "Plus 25 points of level 9 subjects selected from listed discipline subjects in theMaster of Geographyprogram."
        ]
    }
}