{
    "major name": "Politics and International Studies",
    "overview": [
        "The Major in Politics and International Studies enables students to develop an understanding of the main political issues, institutions, ideas, policies and actors that dominate local, national and international agendas. It includes the study of identity and community, power and how it is exercised and contested, democracy, the state and state system, governance beyond and below the state, public policy, political movements, war and conflict and conflict-resolution. The Major offers subjects on these themes from a variety of perspectives in political science, including international relations, public policy, political theory, political economy, comparative politics, Australian politics, indigenous studies, regional studies and feminism and gender studies, as well as subjects on research methods."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "This major requires the completion of:",
            [
                "25 credit points of Level 1 subjects, comprising of either:",
                "\n\n12.5 credit points of Level 1 electives and 12.5 credit points of Arts Discovery (for a single major) OR 25 credit points of Level 1 electives (for a double major)\n",
                "12.5 credit points of Level 2 core subjects",
                "25 credit points of Level 2 electives",
                "12.5 credit points of Level 3 Capstone subjects",
                "25 credit points of Level 3 electives"
            ],
            "12.5 credit points of Level 1 electivesand12.5 credit points of Arts Discovery (for a single major)",
            "OR",
            "25 credit points of Level 1 electives (for a double major)",
            "The subjects MULT20003 is compulsory in the Criminology, Politics and International Studies, and Sociology majors. Students who are completing two majors in any two of these disciplines can only count MULT20003 towards one major. One additional Level 2 subject must be completed for the other major.",
            "*Notes:",
            "Students must undertake the Arts Discovery subject as part of the course requirements and the Arts Discovery can be counted in one major only. For this major, you will need to complete two Level 1 subjects.",
            "If you are completing a single major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 elective subject.",
            "If you are completing a double major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 Elective subject OR Two Level 1 Elective subjects."
        ],
        "Links": [
            "http://ssps.unimelb.edu.au/study-areas/political-science"
        ],
        "Level 1 electives": [
            {
                "POLS10001": "Australian Politics Credits",
                "INTS10001": "International Politics Credits",
                "POLS10003": "Introduction to Political Ideas Credits"
            }
        ],
        "Level 2 core subject": [
            {
                "MULT20003": "Critical Analytical Skills Credits"
            }
        ],
        "Level 2 electives": [
            {
                "MULT20008": "Australian Indigenous Politics Credits",
                "POLS20006": "Contemporary Political Theory Credits",
                "POLS20008": "Public Policy Making Credits",
                "POLS20011": "The Politics of Sex Credits",
                "POLS20023": "Comparative Politics Credits",
                "POLS20025": "International Relations: Key Concepts Credits",
                "POLS20026": "Politics and the Media Credits",
                "POLS20031": "Political Economy Credits"
            }
        ],
        "Level 3 Capstone subject": [
            {
                "POLS30037": "Applied Political Science Project Credits"
            }
        ],
        "Level 3 electives": [
            {
                "ISLM30018": "Diplomacy: Middle East and South Asia Credits",
                "MULT30017": "Australian Indigenous Public Policy Credits",
                "POLS30001": "Parliamentary Internship Credits",
                "POLS30003": "Public Affairs Internship Credits",
                "POLS30007": "Australian Politics in the Long Run Credits",
                "POLS30011": "Chinese Politics and Society Credits",
                "POLS30015": "International Gender Politics Credits",
                "POLS30018": "European Integration: Politics of the EU Credits",
                "POLS30019": "Australian Foreign Policy Credits",
                "POLS30022": "Global Environmental Politics Credits",
                "POLS30028": "On Country Learning: Indigenous Studies Credits",
                "POLS30030": "American Politics Credits",
                "POLS30032": "Campaigns and Elections Credits",
                "POLS30033": "Democracy and its Dilemmas Credits",
                "POLS30034": "Political Psychology Credits",
                "POLS30035": "Policy Design: From Theory to Practice Credits",
                "POLS30036": "Race, Ethnicity, and Nationalism Credits"
            }
        ]
    }
}