{
    "major name": "Population and Global Health",
    "overview": [
        "The Honours program in the Melbourne School of Population and Global Health will provide students with skills and experience conducting research in an area of population and global health. Population Health researchers address questions designed to improve the health of populations in both Australia and globally, and use a range of approaches including for example; the analysis of population statistics; qualitative research with particular sub-groups in the population; analysis of legal and ethical issues in health, and; evaluation of health programs and policies.",
        "Honours students will have the opportunity to join one of the many research groups within the School. The groups use the approaches described above to address diverse areas of health including; sexual health; indigenous health; mental health; men’s health; women’s health and disease prevention.",
        "The opportunity to specialise provides a strong foundation for the future direction of Honours graduates, whether as a means of progressing to higher degree research at the Masters or PhD level, or improving the scope of employment options and professional advancement.",
        "The course year starts in February and ends in November and is only available full time.",
        "Admission requirements",
        "In addition to satisfying the Bachelor of Science (Degree with Honours) entry requirements, students are required to have completed stream specific prerequisites. Details of stream specific prerequisites can be found at the Bachelor of Science (Degree with Honours) entry and participation requirements page."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "Honours in Population and Global Health is a program of 100 credit points completed over 12 months full time (or part time equivalent) comprising of two (2) Advanced Coursework subjects and a Research Project."
        ],
        "Subject Options": [
            "To be awarded Honours with a specialisation in Population and Global Health, students must successfully complete the following core subjects:",
            {
                "POPH40005": "Population Health Research Project 1 Credits",
                "POPH40006": "Population Health Research Project 2 Credits"
            },
            "AND two subjects selected from:",
            {
                "POPH90231": "Qualitative Research in Public Health Credits",
                "POPH90014": "Epidemiology 1 Credits",
                "POPH90058": "Health Program Evaluation 1 Credits",
                "POPH90206": "Health Policy Credits",
                "POPH90270": "Bioethics in Practice Credits",
                "POPH90094": "Health Economics 1 Credits",
                "BIOM40001": "Introduction To Biomedical Research Credits"
            }
        ],
        "Links": [
            "https://mspgh.unimelb.edu.au/study/honours"
        ]
    }
}