{
    "major name": "Principles of Cultural Materials Conservation",
    "overview": [
        "The Graduate Certificate in Arts (Advanced) in Cultural Materials Conservation allows students to undertake coursework subjects in cultural materials conservation. The program provides students with an introduction to cultural material conservation that combines theory and practice. The program will emphasise the philosophical, intellectual, technical and scientific aspects of cultural material conservation, and will draw on the combined expertise of staff of the Centre, the Arts and Science Faculties, and the Ian Potter Museum of Art.",
        "Entry to the course is available on a full time or part time basis.",
        "It is strongly recommended that all commencing students have studied chemistry equivalent to 25 points of first year university or else complete theCCMC bridging course(https://arts.unimelb.edu.au/grimwade-centre-for-cultural-materials-conservation/teaching-and-learning/chemistry-bridging-course)offered in November and April, or equivalent.",
        "On successful completion of the Graduate Certificate in Arts (Advanced) in Cultural Materials Conservation, student may gain entry into the MC-CULMC Master of Cultural Materials Conservation."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "50 credit points",
            "Duration:6 months full-time / 1 year part-time",
            "Program Requirements -",
            [
                "core subjects (50 points)"
            ],
            "Total 50 points.",
            "Please note:",
            [
                "all listed subject pre-requisites must be met",
                "each subject commences with a pre-teaching period for students to become familiar with the course, undertake readings and any pre-teaching tasks. Subject information and reading materials are available via the Learning Management System (LMS) through the student portal."
            ]
        ],
        "Subject Options": [],
        "Core Subjects": [
            {
                "CUMC90022": "Digital Protocols Credits",
                "CUMC90023": "Content in the Field Credits",
                "CUMC90027": "RESPECT Credits",
                "CUMC90029": "Sustainable Collections Credits",
                "CUMC90031": "Analytical Science in Conservation Credits",
                "CUMC90032": "Technical Examination and Documentation Credits",
                "CUMC90033": "Cultural Materials Conservation Science Credits",
                "CUMC90040": "Conservation in Theory and Practice Credits"
            }
        ],
        "Links": [
            "http://arts.unimelb.edu.au/grimwadecentre#about"
        ]
    }
}