{
    "major name": "Property",
    "overview": [
        "THE COURSE STRUCTURE BELOW ONLY APPLIES TO RE-ENROLLING STUDENTS WHO COMMENCED THEIR STUDIES PRIOR TO 2016.",
        "Property is about ownership, management and occupation of land and buildings. It is concerned with the management of assets, people, processes and finances related to specific buildings and across the property industry. Just as the property industry embraces both buildings and commerce, so will students' studies in property, with subjects undertaken in everything from economics and finance, property valuation, construction, facility management to urban planning and law.",
        "Careers and Further Study",
        "Bachelor of Environments graduates with a Property major might obtain work in valuation, investment, development, portfolio management, property and facility management, corporate real estate and land economics. The Property major also provides a strong grounding to prepare you for further studies in the Master of Property. For more information on the Master of Property please visit the Melbourne School of Design web site:http://msd.unimelb.edu.au/"
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "100 points of Property subjects."
        ],
        "Subject Options": [
            "The following description of the Property major aligns with the Study Plan Structure viewable on the Portal for students who commenced the Bachelor of Environments in 2015 or later.The components within the structure of this major have been designed to enforce the requirements of both this specific major and of the course overall, e.g. the requirement that at least 62.5 points of Environments discipline subjects (which can include subjects taken within the major) are taken at each of Level 2 and Level 3.",
            "From 2016 double majorsare available for certain majors within the Bachelor of Environments. Further information on double majors can be found here:http://edsc.unimelb.edu.au/double-majors. If you are interested in any double majors, please check the sample course plan before selecting any elective subjects",
            {
                "here": " Credits"
            }
        ],
        "Level 1 Environments & Enabling Electives (25 points)": [
            "In order to complete this major, enrol into ALL these subjects in your first year:",
            {
                "ECON10004": "Introductory Microeconomics Credits",
                "ENVS10003": "Constructing Environments Credits"
            },
            "IMPORTANT:",
            [
                "1. If you do not have the required mathematics background of VCE Mathematical Methods Units 3 and 4, enrol into MAST10012 Introduction to Mathematics",
                "2. ECON10004 Introductory Microeconomics can also be taken as a Breadth Subject."
            ]
        ],
        "Property major - core subjects (100 points)": [
            "All of",
            {
                "ABPL20004": "Principles of Property Valuation Credits",
                "ABPL20031": "Principles of Property Credits",
                "ABPL30006": "Property Resource Analysis Credits",
                "ABPL30012": "Property Management Credits",
                "ABPL30045": "Property Analysis Studio Credits",
                "ABPL20052": "Investment and Finance for Property Credits",
                "ABPL20051": "Construction Industry Studies - Property Credits",
                "ABPL30059": "Property Case Studies Credits"
            }
        ],
        "Environments Discipline subjects (50 points)": [
            "Choose the total of",
            "50 points of Environments Discipline subjects",
            "RULES:",
            "Please note these rules when choosing the Environments Discipline subjects below",
            [
                "1. Must complete 12.5 points level 2 subjects",
                "2. Must complete 12.5 points level 3 subjects"
            ],
            {
                "Environments Discipline subjects": " Credits"
            }
        ],
        "Breadth subject and restrictions for Property major students": [
            "RECOMMENDED BREADTH SUBJECT",
            "In order to meet the requirements for accreditation, students intending to major in Property are strongly recommended to undertake the following subject as breadth. This subject can also be taken as a Level 1 Environments & Enabling Elective.",
            {
                "ECON10003": "Introductory Macroeconomics Credits"
            },
            "BREADTH RESTRICTIONS",
            {
                "Restrictions for Breadth Options": " Credits"
            },
            "Students undertaking the Property major are not permitted to take as breadth:",
            [
                "any Accounting subjects (subject codes beginning ACCT)"
            ],
            [
                "any Economics subjects (subject codes beginning ECON) - with the exception of ECON10004 Introductory Microeconomics and ECON10003 Introductory Macroeconomics"
            ],
            [
                "any Finance subjects (subject codes beginning FNCE)"
            ],
            [
                "any Management subjects (subject codes beginning MGMT)"
            ],
            [
                "any of the following Level 2 or Level 3 Construction subjects:"
            ],
            {
                "ABPL20036": "Environmental Building Systems Credits",
                "ABPL20053": "Construction of Concrete Buildings Credits",
                "ABPL30039": "Construction Contract Administration Credits",
                "ABPL30040": "Measurement of Building Works Credits",
                "ABPL30044": "Industry Partner project Studio Credits",
                "ABPL30055": "Construction Management Credits",
                "ABPL30046": "Steel and Concrete Structural Systems Credits",
                "ABPL20041": "The Construction Context Credits"
            }
        ],
        "Notes": [
            [
                "For more information on this major and to view a sample course plan please visit: http://edsc.unimelb.edu.au/sample-course-plans-bachelor-environments\n"
            ],
            "The Bachelor of Environments Property major provides a pathway into the Master of Property. It is expected that graduates of the Master of Property will have completed the academic requirements for membership of:",
            [
                "Australian Property Institute (API)",
                "Royal Institution of Chartered Surveyors (RICS)"
            ],
            [
                "students who have not completed VCE Mathematical Methods 3 and 4 or MAST10012 or equivalent cannot enrol in the Property Major, which begins with the second-year subject ABPL20031 Principles of Property."
            ],
            "Notes:",
            "Students who have not completed ABPL30045, may enroll in PROP30003",
            "Students who have not completed ABPL30012 may enroll in PROP30002",
            "Students  who have  not completed ABPL20051 may enroll in PROP20003",
            "Students who have not completed  ABPL20052 may enrol in PROP20001"
        ]
    }
}