{
    "major name": "Screen and Cultural Studies",
    "overview": [
        "Screen and Cultural Studies is a combined program and students can specialise in either area. The combined program covers the fields of film and popular media; screen histories; Australian, Hollywood, European and Asian cinemas; everyday life; television and entertainment; film genres including avant-garde and documentary; computer games; the Internet and the representation of global cultures. The major introduces students to the development and history of film and cultural studies. Theories include film and screen aesthetics; identity and gender; sexuality and spectatorship; media globalization; narrative structures and class ideologies. Students encounter a variety of screen media, net-based and popular cultures; engage cultural texts, sites and practices from a range of interpretive angles, including lifestyle and consumer studies, subcultural studies, and critical studies of sexuality, race and cultural globalization, and; explore their histories, significance and theories that help make sense of how they relate to power, commerce and lived culture today. Through innovative teaching, students in Screen and Cultural Studies encounter new ways of analysing contemporary screen media and culture. Academic staff in the discipline are specialists in screen cultures and media histories; entertainment cultures; gender, race and sexuality; postcolonialism and migration; European and Asian cinemas; cultural policy, and; media archaeology."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "100 credit points",
            "This major requires the completion of:",
            [
                "25 credit points of Level 1 subjects, comprising of either:",
                "\n\n12.5 credit points of Level 1 electives and 12.5 credit points of Arts Discovery (for a single major) OR 25 credit points of Level 1 electives (for a double major)\n",
                "37.5 credit points of Level 2 electives",
                "12.5 credit points of Level 3 Capstone subjects",
                "25 credit points of Level 3 electives"
            ],
            "12.5 credit points of Level 1 electivesand12.5 credit points of Arts Discovery (for a single major)",
            "OR",
            "25 credit points of Level 1 electives (for a double major)",
            "Level 1 subjects must be successfully completed before progressing to Level 2 subjects; Level 2 subjects must be successfully completed before progressing to Level 3 subjects.",
            "*Notes:",
            "Students must undertake the Arts Discovery subject as part of the course requirements and the Arts Discovery can be counted in one major only. For this major, you will need to complete two Level 1 subjects.",
            "If you are completing a single major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 elective subject.",
            "If you are completing a double major the correct enrolment for this major at level 1 is: The Arts Discovery subject and One Level 1 Elective subject OR Two Level 1 Elective subjects."
        ],
        "Links": [
            "http://www.culture-communication.unimelb.edu.au/study/screen-cultural"
        ],
        "Level 1 electives": [
            {
                "SCRN10001": "Introduction to Screen Studies Credits",
                "CULS10005": "Culture, Identity and Everyday Life Credits"
            }
        ],
        "Level 2 electives": [
            {
                "CULS20017": "Gender and Contemporary Culture Credits",
                "CULS20018": "Popular Culture: From K-pop to Selfies Credits",
                "SCRN20011": "Hollywood and Entertainment Credits",
                "CULS20014": "Consumer Culture, Media and Lifestyle Credits",
                "SCRN20013": "Australian Film and Television Credits",
                "SCRN20014": "Ensemble Filmmaking, Art and Industry Credits"
            }
        ],
        "Level 3 capstone subject": [
            {
                "CICU30012": "Creating Screen and Cultural Worlds Credits"
            }
        ],
        "Level 3 electives": [
            {
                "CULS30004": "Thinking Sex Credits",
                "CULS30005": "City Cultures, Urban Ecologies Credits",
                "CULS30006": "Global Cultures Credits",
                "SCRN30001": "Art Cinema and the Love Story Credits",
                "SCRN30005": "The Environmental Screenscape Credits",
                "SCRN30004": "Film Noir: History and Sexuality Credits"
            }
        ]
    }
}