{
    "major name": "Screen Producing",
    "overview": [
        "The Screen Producing Specialisation provides students with industry-leading knowledge and skills to work as professional producers in the rapidly evolving screen industry. The specialisation develops students' theoretical and practical understanding of all aspects of the functional and technical role of the producer, focusing on the creative, practical and business aspects of being a successful producer.",
        "In a deeply collaborative learning environment and with mentoring from staff and industry guests, students will develop the interpersonal and intellectual skills that enable a producer to effectively lead a creative project and develop their own and others' works. Students will establish themselves as multifaceted autonomous producers, with strong capacities in the business, creative development and leadership dimensions of the producer role, while also undertaking research with practice in emerging and innovative directions of contemporary screen culture and storytelling.",
        "Screen Producing students undertake an individual or collaborative producer-led project which they can develop to take to the marketplace upon graduation.",
        "Screen Producing Specialisation graduates will establish themselves as world artistic citizens and cultural agents within the international professional film, television, arts and streaming markets with the view to actively participating in the industry with a tailored and unique producing philosophy and a strong, diverse and resilient skill base."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "43.75 credit points",
            "To obtain a specialisation in Screen Producing, students must complete:",
            [
                "43.75 credit points of core subjects"
            ]
        ],
        "Subject Options": [
            {
                "FLTV90051": "Screen Making 2 (Screen Producing) Credits",
                "FLTV90056": "Screen Project (Screen Producing) Credits"
            }
        ]
    }
}