{
    "major name": "Sexual Health",
    "overview": [
        "Students taking subjects from this specialisation will be immersed in ‘content and thinking’ relevant to the current practice and theory of sexual and reproductive health from a public health perspective. This includes current thinking around adolescent sexuality and wellbeing, recent and emerging threats to STI control, as well as current research and practice in all aspects of sexual and reproductive health. Australia is used as a case example and comparisons are made with other similar countries as well as with dissimilar environments and communities worldwide. International experts from Australia and overseas with contrasting expertise in the field contribute to the teaching adding a broad and diverse approach to understanding the varied influences on sexual health.  Global issues, such as HIV control and prevention, reproductive health rights (including abortion and unmet need for contraception), social determinants, cultural differences, rising STI rates and increasing antibiotic resistance are addressed. Clinicians, social scientists, researchers, epidemiologists and health promotion experts all contribute to a broad-based public health approach to sexual health.",
        "Possible roles in the field include government roles in notification and disease control, health promotion, sexuality educators, clinical roles in sexual health in hospitals and community settings and research roles in social science and epidemiological aspects of sexual health. Organisations that employ people in the sexual health field include Health promotion organisations, community health, public hospitals, state government infectious diseases departments, surveillance and notification departments and public health departments of universities.",
        "Last updated: 17 July 2024"
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "Standard 200 Point Program (no Advanced Standing):",
            "SIX core subjects and NINE elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects, EIGHT elective subjects and either a Research Project or Professional Practice unit",
            "175 Point Pathway:",
            "SIX core subjects and SEVEN elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects, SIX elective subjects and either a Research Project or Professional Practice unit",
            "150 Point Pathway:",
            "SIX core subjects and FIVE elective subjects and the Capstone Selective POPH90227 Public Health in PracticeORSIX core subjects and FOUR elective subjects and either a Research Project or Professional Practice unit"
        ],
        "Subject Options": [],
        "Core Subjects": [
            {
                "POPH90217": "Foundations of Public Health Credits",
                "POPH90013": "Biostatistics Credits",
                "POPH90014": "Epidemiology 1 Credits",
                "POPH90218": "Public Health Leadership and Management Credits",
                "POPH90231": "Qualitative Research in Public Health Credits",
                "POPH90274": "Prioritising & Planning in Public Health Credits"
            }
        ],
        "Highly Recommended Electives**": [
            {
                "POPH90070": "Clinical Sexual & Reproductive Health Credits",
                "POPH90169": "Adolescent Sexuality and Sexual Health Credits",
                "POPH90068": "Prevention and Control of STIs and HIV Credits",
                "POPH90069": "Sexual and Reproductive Health Credits"
            },
            "**Of the 4 sexual health subjects above, a minimum of two should be taken. Students can take all four but one of the subjectsPOPH90070Clinical Sexual and Reproductive Healthis only available to those with a clinical background (eg nurses, doctors, Indigenous health workers). Non-clinicians may take the other three subjects."
        ],
        "Other Recommended Electives": [
            {
                "POPH90199": "Gender and Health Credits",
                "POPH90066": "Women and Global Health Credits",
                "POPH90297": "Preventing Violence Against Women Credits",
                "POPH90302": "Introduction to Health Services Research Credits"
            }
        ],
        "Capstone": [
            "There are three Capstone options to choose from - please refer to the Course Entry for detailed information on each of these:",
            [
                "1. Research Project",
                "2. Professional Practice Unit",
                "3. Capstone selective subject & an additional elective."
            ],
            "Please Note: Research Project",
            "If a student wants to do a qualitative research project in sexual health, the following advanced qualitative subject should be taken:",
            {
                "POPH90200": "Advanced Qualitative Health Research Credits"
            },
            "If a student wants to do a quantitative research project in sexual health the following advanced quantitative subjects should be taken:",
            {
                "POPH90144": "Regression Methods in Health Research Credits",
                "POPH90242": "Epidemiology 2 Credits"
            }
        ]
    }
}