{
    "major name": "Sustainable Forests",
    "overview": [
        "Sustainable Forests is offered as a major field of study in the Master of Environment degree.",
        "Forest landscapes and ecosystems have a massive impact on all our lives as evidenced by the 2009 bush fires in Victoria. The Sustainable Forests major looks at issues related to management of carbon, water, fire and biodiversity at landscape scales in relation to forests with a view to making them more sustainable. We study the challenges of fire management, the role of forests in climate change management, environmental policy and timber and non-timber production.",
        "Students in this specialisation will understand: biological, economic, social and environmental factors that impact on forests; the development of forest and natural resource management enterprises both in Australia and internationally; and carbon sequestration and water resource management.",
        "Students can expect to develop skills in forest ecosystem sciences; sustainable forest management; and the design, conduct and analysis of forestry research.",
        "Suitable for professionals and aspiring entrants to the forest and natural resource management sectors, we will prepare you for middle and upper management positions within the forest and natural resource management and provide a pathway to further study."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "Students will be required to complete the two core subjects, plus choose three subjects from the compulsory specialisation subject list. Students must also take at least 25 points of subjects from the compulsory capstone subjects – these subjects enable students to complete an independent project related to sustainable forest management. Students must also undertake electives to make up the balance of the award. The selection of electives is made in consultation with the Sustainable Forests major coordinator. A full list of subjects available within this specialisation can be found athttp://environment.unimelb.edu.au/courses/streams/sustainable_forests"
        ],
        "Subject Options": [],
        "Core Subjects": [
            "Students must complete the following core subjects:",
            {
                "MULT90004": "Environmental Sustainability Credits",
                "MULT90005": "Partnerships for Sustainable Futures Credits"
            }
        ],
        "Compulsory Specialisation Subjects": [
            "Students must complete at least three of the following compulsory specialisation subjects:",
            {
                "FRST90015": "Landscape Ecology Credits",
                "FRST90020": " Credits",
                "FRST90022": "Ecosystem Processes of Water and Soil Credits",
                "FRST90026": " Credits",
                "FRST90032": "Ecosystems in a Changing Climate Credits"
            }
        ],
        "Compulsory Capstone Experience Subject": [
            "Students must complete the following Capstone Subject:",
            {
                "FRST90035": " Credits"
            }
        ],
        "Elective Subjects": [
            "plus undertake electives to make up the balance of the award. The recommended list of electives includes:",
            {
                "FRST90019": " Credits",
                "FRST90034": "Ecological Restoration Credits",
                "ABPL90009": " Credits",
                "ATOC90002": "Climate Science for Decision-Making Credits",
                "BIOL90002": "Applied Statistics for Biologists Credits",
                "BOTA90005": "Flora of Victoria Credits",
                "ECON90016": "Environmental Economics and Strategy Credits",
                "EDUC90006": "Environmental Education Credits",
                "ENST70001": " Credits",
                "ENST90005": "Environmental Policy Credits",
                "ENST90006": "Environmental Research Review (12.5) Credits",
                "ENST90007": "Environmental Research Project (25) Credits",
                "ENST90016": "Environmental Research Project (50) Credits",
                "EVSC90014": "Environmental Risk Assessment Credits",
                "EVSC90020": "Environmental Modelling Credits",
                "FRST90030": "Forests in the Asia Pacific Region Credits",
                "FRST90031": " Credits",
                "GEOM90008": "Spatial Data Management Credits",
                "HPSC90010": "Environment and Knowledge Credits",
                "LAWS70068": "Environmental Law Credits",
                "ENST90024": " Credits",
                "ENST90025": "Environmental Industry Research (25) Credits",
                "ENST90026": " Credits",
                "ENST90020": "Environmental Industry Research (50) Credits",
                "ENST70002": " Credits",
                "ENST90019": "Consumerism and the Growth Economy Credits",
                "GEOL90005": "Hydrogeology/Environmental Geochemistry Credits",
                "CVEN90019": " Credits",
                "FRST90025": "Patterns and Processes of Landscape Fire Credits"
            }
        ],
        "Notes": [
            "Other subjects may be approved at the discretion of the coordinator."
        ]
    }
}