{
    "major name": "Urban Planning",
    "overview": [
        "Urban Planning as an academic discipline is the study of how cities grow and change, and of the application of policy tools that can guide that towards a viable, resilient and healthy future. Students majoring in Urban Planning learn about the historical evolution of cities, indigenous knowledge, critical urban challenges such as climate change and urban sprawl, the responsibilities of the planning profession, and how cities are planned and governed from Australian and international perspectives. They learn to critically consider a plurality of perspectives in envisioning future cities. Urban Planning students also learn essential skills such as plan making, policy analysis, and technical writing in both urban and regional contexts.Learning in the Urban Planning course is broad and interdisciplinary. Students develop the above skills and knowledge through a variety of pedagogical formats, including lectures, tutorials, a Capstone project, fieldworks, and problem-based studios. The city is the laboratory, and students will engage with fellow students from around the world.",
        "Careers and Further Study:Professional urban planners conceive and implement policy in a variety of areas, including land use, urban form, social infrastructure, transport, economic development, and public open space. The undergraduate major in Urban Planning is a pre-professional course designed to provide the basic skills and theoretical knowledge to undertake an accredited professional program like the Master of Urban Planning . For more information on the Masters programs, please visit the Melbourne School of Design web site:msd.unimelb.edu.au"
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "50 credit points",
            "To obtain a major in Urban Planning students need to complete:",
            [
                "50 credit points of Urban Planning core subjects"
            ],
            "Note:",
            "ABPL30060 Urban Precinct Studio has been changed to PLAN30005 Urban Precinct Studio."
        ],
        "Notes": [
            "To view a sample course plan please visithttp://edsc.unimelb.edu.au/undergraduate/course-planning/bdes/urban-planning"
        ],
        "Non-allowed breadth": [
            "Students undertaking the Urban Planning major are not permitted to take as breadth:",
            [
                "None of any Geography subjects (subject codes beginning with GEOG)\n"
            ],
            "Or any of the following subjects:",
            {
                "ABPL30042": "Landscape Studio: Urban Open Space Credits",
                "ABPL30051": "Urban Morphological Mapping Credits",
                "ECON30021": " Credits",
                "EVSC30006": "Ecology of Urban Landscapes Credits",
                "HORT10015": " Credits"
            }
        ],
        "Urban Planning core subjects": [
            {
                "PLAN30005": "Urban Precinct Studio Credits",
                "PLAN30001": "Planning Scenario and Policy Workshop Credits",
                "PLAN30003": "Research Methods for Planners Credits"
            }
        ]
    }
}