{
    "major name": "Veterinary Bioscience",
    "overview": [
        "The Veterinary Bioscience major will provide a springboard for students wishing to progress into the graduate entry professional veterinary program (Doctor of Veterinary Medicine, DVM) at the University of Melbourne. Graduates of this major will develop understandings of the determinants of health in populations of domestic and production animals and in particular the impact of welfare, housing, nutrition and infectious agents on domestic animal health. This major will integrate knowledge from a range of disciplines including veterinary anatomy, physiology, biochemistry, nutrition, microbiology and pathology as they apply to the health of domestic and production animals.",
        "Students will also develop skills in clinical investigation and problem solving, through an integrated systems-based approach to organ structure and function that will be the foundation for their studies in the graduate professional entry DVM program.",
        "Students will also develop and demonstrate competencies in risk assessment and safe restraint / handling of domestic animal species and in foundational clinical and professional skills.",
        "The Veterinary Bioscience Major is only available to students who have received a provisional/conditional course offer to commence the Doctor of Veterinary Medicine following successful completion of the Bachelor of Science. The approval of the Faculty of Veterinary & Agricultural Sciences is required to enrol into all subjects in this Major.",
        "Students must comply with the Doctor of Veterinary Medicine Fitness to Practice Rules, which are accessible fromSchedule 1of theStudent Fitness to Practice Policy (MPF1345).Current vaccinations for tetanus and/or documented immunity to Q Fever are requirements for enrolment.",
        "Science students should not select this Major as part of their study plan during re-enrolment; it will be added to the study plans of approved students as part of their conditional DVM offer."
    ],
    "ILOs": [],
    "structure": {
        "Structure": [
            "50 credit points",
            {
                "VETS30018": "Veterinary Bioscience:Respiratory System Credits",
                "VETS30029": "Veterinary Bioscience: Cells to Systems Credits",
                "VETS30032": "Animal Production Systems 2 Credits",
                "VETS30030": "Introduction to Professional Practice Credits"
            },
            "In addition to the four subjects listed above, the following four Level 3 subjects are also prerequisites for progression to the DVM and so need to be completed by students in this Major:",
            {
                "VETS30031": "Animal Production Systems 1 Credits",
                "VETS30014": "Veterinary Bioscience: Cardiovasc System Credits",
                "VETS30016": "Veterinary Bioscience: Digestive System Credits",
                "VETS30017": "Veterinary Bioscience: Metabolism Credits"
            }
        ]
    }
}