{
    "Overview text": [
        "The Bachelor of Science (BSc) course is designed to provide excellent science education across a broad range of science and technology areas of study and equip students with a range of knowledge and skills to enhance their science studies. The degree will provide flexible pathways to employment, research higher degrees and many professional postgraduate programs."
    ],
    "Overview table": {
        "Award title": "Bachelor of Science",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "002153M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time or 72 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed one of:",
            "1. In order to be considered for entry, applicants must have completed one of:",
            "(a) the Victorian Certificate of Education including",
            "VCE Units 3 and 4 – either a study score of at least 25 in one of English, English Language or Literature or a study score of at least 30 in English as an Additional Language, andVCE Units 3 and 4 – a study score of at least 25 in either one of Mathematical Methods or Specialist Mathematics and one of Biology, Chemistry or Physics; or both of Mathematical Methods and Specialist Mathematics",
            "VCE Units 3 and 4 – either a study score of at least 25 in one of English, English Language or Literature or a study score of at least 30 in English as an Additional Language, and",
            "VCE Units 3 and 4 – a study score of at least 25 in either one of Mathematical Methods or Specialist Mathematics and one of Biology, Chemistry or Physics; or both of Mathematical Methods and Specialist Mathematics",
            "VCE Units 3 and 4 – either a study score of at least 25 in one of English, English Language or Literature or a study score of at least 30 in English as an Additional Language, and",
            "VCE Units 3 and 4 – a study score of at least 25 in either one of Mathematical Methods or Specialist Mathematics and one of Biology, Chemistry or Physics; or both of Mathematical Methods and Specialist Mathematics",
            "(b) the International Baccalaureate Diploma including",
            "a minimum grade of 4 in either Applications and interpretations HL, Analysis and approaches SL, or Analysis and approaches HL;a minimum grade of 4 in either English or English B (Standard Level or Higher Level); anda minimum grade of 4 in one of Biology, Chemistry or Physics.",
            "a minimum grade of 4 in either Applications and interpretations HL, Analysis and approaches SL, or Analysis and approaches HL;",
            "a minimum grade of 4 in either English or English B (Standard Level or Higher Level); and",
            "a minimum grade of 4 in one of Biology, Chemistry or Physics.",
            "a minimum grade of 4 in either Applications and interpretations HL, Analysis and approaches SL, or Analysis and approaches HL;",
            "a minimum grade of 4 in either English or English B (Standard Level or Higher Level); and",
            "a minimum grade of 4 in one of Biology, Chemistry or Physics.",
            "(c) a senior secondary program, foundation studies program or equivalent approved by the Academic Board including appropriate studies in English and Mathematics, and in at least one of Biology, Chemistry or Physics.",
            "Except for applicants eligible for Access Melbourne,minimum ATAR or equivalent overall performance rankings apply.",
            "minimum ATAR or equivalent overall performance rankings apply",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "prior academic performance.",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "rules",
            "Note",
            "Note",
            "For applications through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne.An alternative pathway is available for applicants eligible for advanced standing of a least 100 points towards the science component of the B.Sc. including at least 25 points at second year level in a discipline area available in the BSc as a major study area. To be considered under this pathway, applicants must meet the University’sundergraduate English standardsand have completed VCE Mathematical Methods (CAS) Units 3 and 4 with a study score of at least 25, or equivalent.",
            "For applications through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne.",
            "An alternative pathway is available for applicants eligible for advanced standing of a least 100 points towards the science component of the B.Sc. including at least 25 points at second year level in a discipline area available in the BSc as a major study area. To be considered under this pathway, applicants must meet the University’s undergraduate English standards and have completed VCE Mathematical Methods (CAS) Units 3 and 4 with a study score of at least 25, or equivalent.",
            "For applications through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne.",
            "An alternative pathway is available for applicants eligible for advanced standing of a least 100 points towards the science component of the B.Sc. including at least 25 points at second year level in a discipline area available in the BSc as a major study area. To be considered under this pathway, applicants must meet the University’sundergraduate English standardsand have completed VCE Mathematical Methods (CAS) Units 3 and 4 with a study score of at least 25, or equivalent.",
            "undergraduate English standards"
        ],
        "Inherent requirements (core participation requirements)": [
            "The Bachelor of Science welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree.",
            "The Bachelor of Science requires all students to enrol in subjects where they will require:",
            "the ability to comprehend complex science, technology and/or engineering systems related information;the ability to clearly and independently communicate a knowledge and application of science, technology and engineering systems principles and practices during assessment tasks; and in some areas of studythe ability to actively and safely contribute in clinical, laboratory, and fieldwork/excursion activities.",
            "1. the ability to comprehend complex science, technology and/or engineering systems related information;",
            "2. the ability to clearly and independently communicate a knowledge and application of science, technology and engineering systems principles and practices during assessment tasks; and in some areas of study",
            "3. the ability to actively and safely contribute in clinical, laboratory, and fieldwork/excursion activities.",
            "the ability to comprehend complex science, technology and/or engineering systems related information;",
            "the ability to clearly and independently communicate a knowledge and application of science, technology and engineering systems principles and practices during assessment tasks; and in some areas of study",
            "the ability to actively and safely contribute in clinical, laboratory, and fieldwork/excursion activities.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. There are additional inherent academic requirements for some major studies and subjects, and these requirements are listed within the description of the requirements for each of these majors and subjects. Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the relevant Subject Coordinator and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/",
            "http://www.services.unimelb.edu.au/disability/",
            "Major‐specific core participation requirements",
            "Agricultural Science Major Specific Core Participation requirements: Fieldwork and Practicals The sites essential to this fieldwork are not wheelchair accessible and require students to traverse broken ground. Visual observation and interpretation of the sites is also an essential component, as is specimen and microscope work.",
            "Veterinary Bioscience Major Specific Core Participation requirements: Practical classes This major requires all students to actively, independently and safely participate in all practical classes, utilising a range of observational, communication, motor, intellectual, and behavioural and social skills. Visual acuity, muscle coordination, balance, and sensory tactile perception are essential for participation. Details of the participation requirements can be found athttps://handbook.unimelb.edu.au/view/current/MC-DVETMED",
            "https://handbook.unimelb.edu.au/view/current/MC-DVETMED",
            "Animal Health and Disease Major Specific Core Participation requirements: Practical classes This major requires all students to actively, independently and safely participate in all practical classes, utilising a range of observational, communication, motor, intellectual, and behavioural and social skills. Visual acuity, muscle coordination and balance are essential for participation.",
            "Animal Science and Management Major Specific Core Participation requirements: Fieldwork, practicals and laboratory experiments The sites essential to this fieldwork are not wheel chair accessible and may require students to traverse broken ground. Students are also required to undertake experiments including specimen and microscope work with assessment reliant on careful observation and visual interpretation of results. Practicals may also involve handling and working with animals.",
            "Chemical Systems Specific Core Participation requirements: Laboratory experiments This major requires students to undertake experiments using specialist software with assessment reliant on careful observation and visual interpretation of results.",
            "Ecology and Evolutionary Biology Major Specific Core Participation requirements: Fieldwork The sites essential to this fieldwork are not wheelchair accessible and require students to traverse broken ground. Visual observation and interpretation of the sites is also an essential component.",
            "Food Science Major Specific Core Participation requirements: Laboratory experiments This major requires students to undertake experiments using specialist software with assessment reliant on careful observation and visual interpretation of results.",
            "Geology and Geoscience Majors Specific Core Participation requirements: Fieldwork The sites essential to this fieldwork are not wheelchair accessible and require students to traverse broken ground. Visual observation and interpretation of the sites is also an essential component, as is specimen and microscope work."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Please see the handbook entry for the following majors for details of their level of professional accreditation:",
            "Psychology",
            "Computing and Software Systems"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Science requires the successful completion of 300 credit points.",
                [
                    "12.5 credit points of Level 1 Compulsory subjects",
                    "225 credit points of Science subjects including\nA minimum of 62.5 credit points of Level 1 discipline subjects\nA minimum of 62.5 credit points of Level 2 discipline subjects\nA minimum of 75 credit points of Level 3 discipline subjects\n\n",
                    "A minimum of 62.5 credit points of Level 1 discipline subjects",
                    "A minimum of 62.5 credit points of Level 2 discipline subjects",
                    "A minimum of 75 credit points of Level 3 discipline subjects",
                    "50 credit points of Breadth subjects includingA maximum of 25 credit points of Level 1 Breadth subjects\n\n",
                    "A maximum of 25 credit points of Level 1 Breadth subjects\n",
                    "The remaining 12.5 points may consist of either Science or Breadth subjects. You must still meet all other course rules."
                ],
                [
                    "A minimum of 62.5 credit points of Level 1 discipline subjects",
                    "A minimum of 62.5 credit points of Level 2 discipline subjects",
                    "A minimum of 75 credit points of Level 3 discipline subjects"
                ],
                [
                    "A maximum of 25 credit points of Level 1 Breadth subjects\n"
                ]
            ],
            "Additional rules": {
                "overview": [
                    [
                        "A maximum of 125 credit points of Level 1 subjects",
                        "Completion of one Major",
                        "A minimum of two Distinct level 1 areas of study",
                        "A maximum of 37.5 points from any Distinct level 1 areas of study"
                    ]
                ]
            },
            "Progression rule": {
                "overview": [
                    "Level 1 subject study area",
                    [
                        "Completion of at least 50 points of Level 1 study before proceeding to the next subject year level  is normally required.",
                        "Inclusive of SCIE10005 - Today’s Science, Tomorrow’s World"
                    ],
                    "Level 2 subject study area",
                    [
                        "Completion of at least 50 points of Level 2 study before proceeding to the next subject year level  is normally required."
                    ]
                ]
            },
            "Compulsory subjects": {
                "overview": [],
                "Level 1 Compulsory subject": {
                    "overview": [
                        [
                            "SCIE10005"
                        ],
                        "Note this subject must be completed in the first semester of commencement in the course"
                    ]
                }
            },
            "Science Discipline Subjects": {
                "overview": [
                    "A full list of subjects available for science credit for the new generation Bachelor of Science course (B-SCI):",
                    "https://handbook.unimelb.edu.au/2024/components/b-sci-infspc-1"
                ]
            }
        },
        "Breadth requirements": {
            "overview": [],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Science"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {
        "Majors": [
            "Completion of 50 points of study at Level 3.",
            "A number of these science majors include specialisations. Descriptions of the specialisations are located within the majors.",
            "NameCredit PointsAgricultural Science50Animal Health and Disease50Animal Science and Management50Biochemistry and Molecular Biology50Biomedical Engineering Systems50Biotechnology50Cell and Developmental Biology50Chemical Engineering Systems50Chemistry50Civil Engineering Systems50Climate and Weather50Computational Biology50Computing and Software Systems50Data Science50Digital Infrastructure Engineering Systems50Ecology and Evolutionary Biology50Ecosystem Science50Electrical Engineering Systems50Environmental Engineering Systems50Environmental Science50Food Science50Genetics50Geography50Geology50Geoscience50Human Nutrition50Human Structure and Function50Immunology50Infection and Immunity50Informatics50Marine Biology50Mathematical Physics50Mathematics and Statistics50Mechanical Engineering Systems50Mechatronics Engineering Systems50Microbiology50Neuroscience50Pathology50Pharmacology50Physics50Physiology50Plant Science50Psychology50Spatial Systems50Veterinary Bioscience50Zoology50",
            {
                "Agricultural Science": "50 Credits",
                "Animal Health and Disease": "50 Credits",
                "Animal Science and Management": "50 Credits",
                "Biochemistry and Molecular Biology": "50 Credits",
                "Biomedical Engineering Systems": "50 Credits",
                "Biotechnology": "50 Credits",
                "Cell and Developmental Biology": "50 Credits",
                "Chemical Engineering Systems": "50 Credits",
                "Chemistry": "50 Credits",
                "Civil Engineering Systems": "50 Credits",
                "Climate and Weather": "50 Credits",
                "Computational Biology": "50 Credits",
                "Computing and Software Systems": "50 Credits",
                "Data Science": "50 Credits",
                "Digital Infrastructure Engineering Systems": "50 Credits",
                "Ecology and Evolutionary Biology": "50 Credits",
                "Ecosystem Science": "50 Credits",
                "Electrical Engineering Systems": "50 Credits",
                "Environmental Engineering Systems": "50 Credits",
                "Environmental Science": "50 Credits",
                "Food Science": "50 Credits",
                "Genetics": "50 Credits",
                "Geography": "50 Credits",
                "Geology": "50 Credits",
                "Geoscience": "50 Credits",
                "Human Nutrition": "50 Credits",
                "Human Structure and Function": "50 Credits",
                "Immunology": "50 Credits",
                "Infection and Immunity": "50 Credits",
                "Informatics": "50 Credits",
                "Marine Biology": "50 Credits",
                "Mathematical Physics": "50 Credits",
                "Mathematics and Statistics": "50 Credits",
                "Mechanical Engineering Systems": "50 Credits",
                "Mechatronics Engineering Systems": "50 Credits",
                "Microbiology": "50 Credits",
                "Neuroscience": "50 Credits",
                "Pathology": "50 Credits",
                "Pharmacology": "50 Credits",
                "Physics": "50 Credits",
                "Physiology": "50 Credits",
                "Plant Science": "50 Credits",
                "Psychology": "50 Credits",
                "Spatial Systems": "50 Credits",
                "Veterinary Bioscience": "50 Credits",
                "Zoology": "50 Credits"
            },
            "",
            "Informatics major",
            "Students who commenced this course prior to 2018 and are planning to complete the Informatics majors may continue to do so. Students interested in Informatics are encouraged to explore the Computing and Software Systems or Data Science majors, as well as the concurrent Diploma in Computing.",
            "",
            "Computational Biology major",
            "Please note that this major is no longer being offered to students from 2022 onwards. Students who commenced this major prior to 2022 and are planning to complete the Computational Biology major may continue to do so.",
            "",
            "Spatial System major",
            "Please note that this major is no longer being offered to students from 2023 onwards. Students who commenced this major prior to 2023 and are planning to complete the Spatial Systems major may continue to do so. Students interested in spatial engineering systems can explore the Digital Infrastructure Engineering Systems major.",
            "",
            "Geology major",
            "Please note that this major is no longer being offered to students from 2024 onwards. Students who commenced this major prior to 2024 and are planning to complete the Geology major may continue to do so. Students interested in geology are encouraged to explore the Geoscience major.",
            "Special Arrangements",
            "In the case of the study area of History and Philosophy of Science (HPS), students who seek to undertake further subjects in order to complete the equivalent of a major in HPS will be permitted to take up to 25 points of additional breadth study in HPS, replacing 25 points of the science requirements of the BSc. For a BSc student, the equivalent of a major in HPS is the completion of 100 points of HPS subjects (25 points at Level 1, 37.5 points at Level 2 and 37.5 points at Level 3 including HPSC30035 The Dynamics of Scientific Change. These students will be required to satisfy all other completion requirements of the BSc. This arrangement is only available to students who have not completed any other breadth subjects for credit in the BSc. In order to complete the 112.5 points required at Level 3 within this arrangement (i.e. across science and HPS studies), students should consider undertaking a Level 3 HPS subject in the second year of their course.",
            "Students who entered the BSc prior to 2015 should refer the handbook entry of the year they commenced."
        ]
    }
}