{
    "Course name": "Bachelor of Arts (Extended)",
    "Course code": "B-ARTSEXT",
    "Overview text": [
        "The Bachelor of Arts (Extended) is a four year program. The course facilitates a supported transition to University through the provision of an additional study year specifically designed to develop the academic skills required for success at University. Aboriginal and Torres Strait Islander students will access specialised academic support through foundation studies in key areas such as academic literacy, communication and performance, literature, philosophy and environmental studies. These subjects will be taught by the Trinity College Foundation Studies program in co-operation with staff from the Faculty of Arts. In addition, students will be supported through theMurrup Barak, Melbourne Institute for Indigenous Development, as well as living in one of the colleges affiliated with the University of Melbourne."
    ],
    "Overview table": {
        "Award title": "Bachelor of Arts",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "400 credit points",
        "Duration": "48 months full-time or 96 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have:• Completed VCE with an ATAR of 50 or above, or equivalent• Aboriginal or Torres Strait Islander descent• Academic capacity and potential for leadership in the community, assessed by interview and by referee reportsMeeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:• Prior academic performance• The interview and referee reports3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.Note: Non-school leavers, mature age students and alternative pathway applications will be considered.Successful students will be selected on their likelihood to succeed in the Bachelor of Arts. Qualifications will be assessed on application.Applications can be made through VTAC (Victorian Tertiary Admissions centre) . Applicants must complete and submit a supplementary application form to the University of Melbourne when applying for this course. Applicants can submit a direct application to the University, however, direct applications will only be considered after the VTAC offers have closed.There are two intakes in the Bachelor of Arts (Extended) each year, January and June."
        ],
        "Inherent requirements (core participation requirements)": [
            "The inherent academic requirements for study in the Bachelor of Arts (Extended) are:",
            "The ability to attend classes and actively engage in both independent and group learning",
            "The ability to comprehend complex disciplinary and interdisciplinary information related to the courses taught in the faculty",
            "The ability to explain and evaluate complex concepts, theories and issues at work in a variety of texts",
            "The ability to clearly communicate a knowledge and application of humanities, social sciences and language principles and practices during assessment tasks",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. They must take full responsibility for their own participation and learning and adhere to the expectations outlined in theStudent Charter.",
            "Students also contribute to the learning of other students in collaborative environments and must therefore demonstrate a wide range of interpersonal skills which consider the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. Integrity, concern for others, interpersonal skills, interest, and motivation are all personal qualities that are deemed necessary for students enrolled in the BA.",
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "TheBachelor of Arts (Extended)requires the successful completion of 400 points (32 x 12.5 credit point subjects) comprising of the following:"
            ]
        },
        "First Year requirements": {
            "overview": [
                "Students are required to complete the following subjects (62.50 points) in their foundation year:",
                [
                    "CWRI10002",
                    "ENGL10004",
                    "DEVT10002",
                    "PHIL10004",
                    "ARTS10001"
                ],
                "Students must also complete the following Arts Discovery subject (12.50 points):",
                [
                    "ARTS10002"
                ],
                "Students may seek approval to substitute the following subjects for two of the first year subjects listed above.",
                [
                    "MAST10014",
                    "MAST10015"
                ],
                "Plustwo arts discipline subjects(25 points) at Level 1."
            ]
        },
        "Second, Third and Fourth Year requirements": {
            "overview": [
                "In the second, third and fourth years of the program students are required to complete the following requirements:",
                "225 pointsof Arts discipline subjects, including:",
                [
                    "Six arts discipline subjects (75 points) at level 1",
                    "At least six arts discipline subjects (75 points) at level 2",
                    "At least six arts discipline subjects (75 points) at level 3"
                ],
                "Students may seek approval to substitute up to two arts discipline subjects at level 2 for up to two arts discipline subjects at level 1.",
                "50 pointsof Breadth subjects, including:",
                [
                    "At least one breadth subject at level one (12.50 points) and no more than three breadth subjects (37.50 points) at level one",
                    "At least 12.5 points at level two or three"
                ],
                "25 pointsof Arts disciplineand/orBreadth subjects (at level 1, 2, or 3)."
            ],
            "Major requirements": {
                "overview": [
                    [
                        "Students  complete one major",
                        "must",
                        "Students may complete a maximum of two majors",
                        "Student may take no more than ten subjects (125 points) in any one discipline"
                    ]
                ]
            },
            "Progression": {
                "overview": [
                    "Students must complete a minimum of four subjects (50 points) of study at one year-level before proceeding to the next year-level.",
                    "For information on policies that govern this degree see theMelbourne Policy Library."
                ]
            }
        },
        "Breadth requirements": {
            "overview": [],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Arts"
                ]
            }
        },
        "Subject options": {
            "overview": []
        },
        "General Arts Subjects": {
            "overview": [
                [
                    "MULT20010",
                    "MULT20012",
                    "MULT20013",
                    "MULT20014",
                    "MULT30019",
                    "MULT30020",
                    "MULT30021",
                    "ARTS20002",
                    "ARTS30001"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {
        "Major requirements": [
            "Studentsmustcomplete at least one major. A major usually consists of 100 points of study within a single discipline comprising:",
            [
                "Two subjects (25 points) at level 1 (this may include the Arts Discovery subject in non-language majors/minors)",
                "Three subjects (37.5 points) at level 2",
                "Three subjects (37.5 points) at level 3 (including a capstone subject for non-language majors)"
            ],
            "Variations to Major requirements",
            [
                "Students who undertake a major in from entry point 1 (beginners level) must complete ten Chinese subjects (125 points) taken as Arts discipline subjects.",
                "Chinese Studies ",
                "Students who undertake a major in  must complete ten Psychology subjects (125 points) comprising eight subjects (100 points) taken as Arts discipline subjects and two subjects (25 points) at later years taken as breadth (12.50 at level 2 and 12.50 points at level 3).",
                "Psychology",
                "Students who undertake a major in  will complete nine Economics subjects (112.5 points) comprising three subjects (37.5 points) taken as Arts discipline and six subjects (75 points) taken as breadth.",
                "Economics"
            ],
            "Please note:",
            [
                "Students may complete a maximum of two majors.",
                "Students may take no more than ten subjects (125 points) in any one discipline area.",
                "Subjects cannot be credited to more than one major or minor. Students planning to complete two BA majors must complete two separate majors with no overlap in subjects.",
                "It is not possible to complete a major and a minor in the same area of study."
            ]
        ],
        "Minor requirements": [
            "Studentsmaycomplete one minor. A minor consists of 75 points of study within a single discipline comprising:",
            [
                "Two subjects (25 points) at level 1",
                "Two subjects (25 points) at level 2",
                "Two subjects (25 points) at level 3"
            ],
            "Capstone subjects are not available in the minor."
        ],
        "Available Majors and Minors": [
            "For the list of available Majors and Minors, along with their structures and subject options, please see theHandbook page for the Bachelor of Arts (B-ARTS)."
        ]
    },
    "Further Study": [
        "High-achieving Bachelor of Arts (Extended) graduates may apply for entry to the Bachelor of Arts (Degree with Honours). The Honours program comprises a research project as well as specialist subjects. For more information on entry to Honours, see theArts Honours webpage.Coursework Masters If you wish to continue your professional studies at postgraduate level, the studies you undertake in your major can provide a direct pathway to coursework masters degrees in a wide range of areas. Entry is based on academic merit and in most cases requires completion of a Bachelor degree or equivalent. For more information on entry into a coursework masters degree see theArts Graduate degree websiteResearch Higher Degrees If you wish to undertake advanced research and explore particular study areas in more depth, there will be opportunities to proceed to a range of Research Higher Degrees at masters and doctoral level, usually upon completion of an Honours degree. For more information about research higher degree study in Arts and the entry requirements, see theArts Graduate degree website"
    ]
}