{
    "Course name": "Bachelor of Agriculture",
    "Course code": "B-AGR",
    "Overview text": [
        "The Bachelor of Agriculture provides students with a sound understanding of the structure and operation of agricultural production industries of Australia, as well as an understanding of Australia’s role in global food and fibre production.",
        "Students will develop an understanding of fundamental scientific concepts, and will learn to apply this understanding to a range of agricultural contexts, including precision farming.",
        "Through core studies at each year level, students will develop an integrated and multidisciplinary understanding of agricultural science, and of the social, political, and economic drivers of resource management, agricultural development and sustainability.",
        "At the same time, depth of understanding in a chosen major in Plant and Soil Science, Production Animal Science or Agricultural Economics, will equip students with the knowledge, skills and aptitudes required to assess and improve performance in agricultural industries, to ensure long term sustainability, and to contribute as leaders in agricultural industries and communities.",
        "Students will be involved in study at both the Dookie and Parkville campuses (with the option of a full time program of study at the Dookie campus in Semester 2 of second year). Students will also have an opportunity to undertake industry placements.",
        ""
    ],
    "Overview table": {
        "Award title": "Bachelor of Agriculture",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "037228G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time or 72 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed: one of",
            "(a) the Victorian Certificate of Education including:",
            "VCE Units 3 and 4 – either a study score of at least 25 in one of English, English Language or Literature or a study score of at least 30 in English as an Additional Language, and",
            "VCE Units 3 and 4 – either a study score of at least 25 in one of Mathematical Methods (CAS) or Specialist Mathematics, or a study score of at least 30 in General Mathematics;",
            "(b) the International Baccalaureate Diploma including",
            "at least Grade 4 in English or English B (Standard Level or Higher Level), and",
            "at least Grade 5 in Applications and Interpretations (SL) or at least Grade 4 in either Applications and interpretations (HL), Analysis and approaches (SL), or Analysis and approaches (HL);",
            "(c) a senior secondary program, foundation studies program or equivalent approved by the Academic Board including appropriate English language and Mathematics studies.",
            "Except for applicants eligible for Access Melbourne, minimum ATAR or equivalent overall performance rankings applyhttp://futurestudents.unimelb.edu.au/admissions/access_melbourne_and_equity_programs/access-melbourne).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduate English language requirements (http://futurestudents.unimelb.edu.au/admissions/entry-requirements/language-requirements) must be met.",
            "Note. For applications through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students with reasonable adjustments to assessment and participation under the Disability Standards for Education (2005), and theAssessment and Results Policy (MPF1326). Students are expected to meet the core participation requirements for their course. Undertaking this course requires completion of subjects  where students will be required to actively and safely contribute to field excursions and laboratory activities. Further details on how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home",
            "Q Fever Vaccination",
            "A core participation requirement of this course is that students agree to be vaccinated against Q Fever. Q Fever is a relatively common preventable condition which, while rarely fatal, can cause a severe acute illness and can result in damage to heart valves and chronic fatigue. A number of subjects offered in this course may place students at risk of exposure to Q Fever.",
            "Q Fever screening and vaccination can be arranged through the University Health Service. The cost of the vaccination program is separate to tuition fees.",
            "Further information:https://science.unimelb.edu.au/students/plan-your-study/q-fever-vaccinations"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Agriculture requires the successful completion of 300 credit points.",
                [
                    "150 credit points of Compulsory subjects including\n",
                    [
                        [
                            "100 credit points of Level 1 compulsory subjects",
                            "37.5 credit points of Level 2 compulsory subjects",
                            "12.5 credit points of Level 3 compulsory subjects"
                        ]
                    ],
                    "150 credit points of remaining Discipline subjects, including\n",
                    [
                        [
                            "Completion of one prescribed major (totalling 37.5 credit points of Level 3 discipline subjects)",
                            "A minimum of 112.5 credit points of discipline electives"
                        ]
                    ]
                ]
            ],
            "Additional Rules": {
                "overview": [
                    [
                        "A maximum of 25 credit points of Level 1 discipline electives",
                        "A minimum of 62.5 credit points of Level 3 Discipline subjects (major core subjects and electives)"
                    ]
                ]
            },
            "Progression Rules": {
                "overview": [
                    [
                        "Completion of at least 50 points of Level 1 study before proceeding to the next subject year level.",
                        "Students must also complete the Agriculture Discovery subject at Dookie campus within Year 1 of the degree (first 100 credit points).",
                        "Completion of at least 50 points of Level 2 study before proceeding to the next subject year level."
                    ]
                ]
            },
            "Subject Options": {
                "overview": []
            },
            "Compulsory subjects": {
                "overview": [],
                "Level 1 compulsory subjects": {
                    "overview": [
                        [
                            "AGRI10045",
                            "AGRI10046",
                            "AGRI10047",
                            "AGRI10048",
                            "AGRI10049",
                            "AGRI10050",
                            "AGRI10051",
                            "ENVS10001",
                            "AGRI10053"
                        ]
                    ]
                },
                "Level 2 compulsory subjects": {
                    "overview": [
                        [
                            "AGRI20038",
                            "AGRI20043",
                            "AGRI20042"
                        ]
                    ]
                },
                "Level 3 compulsory subject": {
                    "overview": [
                        [
                            "AGRI30038"
                        ]
                    ]
                }
            },
            "Electives": {
                "overview": [
                    "NB. Some of these subjects have prerequisites."
                ],
                "Level 1 electives": {
                    "overview": [
                        [
                            "AGRI10039",
                            "UNIB10009",
                            "FOOD10001",
                            "ANSC10001"
                        ]
                    ]
                },
                "Level 2 electives": {
                    "overview": [
                        [
                            "AGRI20003",
                            "AGRI20027",
                            "AGRI20037",
                            "AGRI20036",
                            "AGRI20035",
                            "AGRI20026",
                            "AGRI20040",
                            "AGRI20041",
                            "ANSC20001",
                            "ANSC20002",
                            "ANSC20005",
                            "ANSC20003",
                            "ANSC20004",
                            "FOOD20007",
                            "AGRI20044",
                            "AGRI20045",
                            "FOOD20003"
                        ],
                        "Note:",
                        [
                            "A student’s choice of Level 2 electives is informed by prerequisites for selected Level 3 subjects, including the required subjects in the selected major",
                            "In Year 2 students should select Level 2 subjects as per course progression rules."
                        ]
                    ]
                },
                "Level 3 electives": {
                    "overview": [
                        [
                            "AGRI30011",
                            "AGRI30016",
                            "AGRI30030",
                            "AGRI30033",
                            "AGRI30037",
                            "AGRI30040",
                            "AGRI30041",
                            "AGRI30042",
                            "AGRI30043",
                            "AGRI30045",
                            "AGRI30046",
                            "AGRI30047",
                            "AGRI30048",
                            "ANSC30003",
                            "ANSC30004",
                            "ANSC30005",
                            "ANSC30006",
                            "ANSC30008",
                            "AGRI30006"
                        ],
                        "Dookie campus option",
                        "Students who select to undertake studies in semester 2, Year 2 at the Dookie Campus enrol in 50 credit points of prescribed subjects. One of these subjects is a compulsory subject (AGRI20038 Principles of Soil Science). The remaining three (AGRI20035, AGRI20036, AGRI20040) are approved Level 2 electives.",
                        [
                            "AGRI20035",
                            "AGRI20036",
                            "AGRI20038",
                            "AGRI20040"
                        ],
                        "Students undertaking the Dookie Campus option are expected to enrol in all four subjects. Completion of the Dookie Campus option does not preclude a student from undertaking any of the majors in the course.",
                        "Additional costs (transport/accommodation) apply for students undertaking the Dookie Campus option."
                    ]
                }
            }
        }
    },
    "Majors, minors and specialisations": {
        "Majors": [
            "Each major is comprised of 37.5 credit points of Level 3 subjects. The combination of subjects available within each major differentiate it from other majors. Students will need to complete Level 2 prerequisites prior to enrolment in the Level 3 subjects of the major.",
            {
                "Agricultural Economics": "37.5 Credits",
                "Plant and Soil Science": "37.5 Credits",
                "Production Animal Science": "37.5 Credits"
            }
        ]
    },
    "Further Study": [
        "Students may wish to continue their undergraduate studies and undertake theirHonours year.",
        "The Faculty offers excellent opportunities for students to pursue postgraduate studies. Programs available include Graduate Certificates, Graduate Diplomas, Masters (by coursework), Masters (by research) and Doctoral degrees. Refer to the Faculty website for more information:https://study.unimelb.edu.au/study-with-us/graduate-courses/science"
    ]
}