{
    "Course name": "Bachelor of Fine Arts (Animation)",
    "Course code": "B-FAANIM",
    "Overview text": [
        "The Bachelor of Fine Arts (Animation) provides an immersive and experiential education, focusing on the origination and development of animated projects for a wide range of screen contexts and audiences. There is a strong emphasis on developing the student’s individual creative voice and experimentation while underlining the need to reach effectively and freshly to an audience.",
        "The unique studio-based study environment enables individualistic learning as well as engagement and collaboration with students in other screen-based specialisations within Film and Television, as well as from disciplines across the wider Faculty of Fine Arts and Music.",
        "In the first year of the course, students undertake foundation exercises in animation research, techniques, experimentation, writing and storyboarding, sound, and project planning.",
        "In year two, creative and technical skills are applied to character creation, world building, sound production and application of animation to expanded screen contexts.",
        "In the final year students undertake studies in projects for collaborative and community practice, projection arts and animation production enterprise. In each year students create an animated short film that they write, direct, edit and animate, thereby developing a body of work that demonstrates a continued practice across all stages of animation production, culminating in a capstone experience in third year.",
        "Breadth subjects at each year level enable students to explore cross disciplinary studies from the wider University community, exposing them to multi-disciplinary knowledge and skills that will build on existing knowledge or present opportunities to investigate and develop new interests.",
        "Bachelor of Fine Arts (Animation) graduates will complete a deeply personal, artistically transformational, and highly professional course of development. With their creative, collaborative and technical skills they are optimally placed to make significant impact in the national and international creative industries.",
        "Graduates may be eligible to apply progress to an additional year to qualify for a Bachelor of Fine Arts (Degree with Honours), or the Master of Film and Television by coursework ."
    ],
    "Overview table": {
        "Award title": "Bachelor of Fine Arts (Animation)",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "093582C",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed one of:(a) the Victorian Certificate of Education including VCE Units 3 and 4 either a study score of at least 25 in English/English Language/Literature or a study score of at least 30 in English as an Additional Language;(b) the International Baccalaureate Diploma including at least Grade 4 in English or English B (Standard Level or Higher Level);(c) a senior secondary program, foundation studies program or equivalent approved by Academic Board including appropriate English language studies.",
            "Applicants are also required to complete as prescribed by the Academic Board:",
            "a set creative task; and",
            "a portfolio (shortlisted applicants only); and",
            "an interview (shortlisted applicants only).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "the set creative task; and",
            "the portfolio (shortlisted applicants only); and",
            "performance in an interview (shortlisted applicants only); and",
            "prior academic achievement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduate English language requirements must be met.",
            "Notes:",
            "For applicants through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne",
            "Details for the set creative task, portfolio (shortlisted applicants only) and interview (shortlisted applicants only) can be found on the Fine Arts and Music Study website \n",
            "Successful applicants will be required to hold a current Working with Children Check and this must remain valid for the duration of the course. "
        ],
        "Inherent requirements (core participation requirements)": [
            "Communication Skills:Students require effective and efficient communication skills about their knowledge and application of practicing arts disciplines.",
            "Creative, Intellectual and Organisational Abilities:Students require the capacity for high-level creative performance or production, and are expected to have the ability to develop problem-solving skills and to comprehend disciplinary and cross-disciplinary information.",
            "Behavioural and Social Attributes:Students participate in a complex learning environment and must take responsibility for their own participation and learning. Collaborative learning environments require students to demonstrate a wide range of interpersonal skills which contributes to and considers the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who have a disability which may prevent them from participating in tasks involving these inherent academic requirements are encouraged to contact Student Equity and Disability Services:https://students.unimelb.edu.au/student-support/student-equity-and-disability-support"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Fine Arts (Animation) requires the successful completion of 300 credit points."
            ],
            "Compulsory subjects": {
                "overview": [
                    [
                        "250 credit points of Compulsory subjects\n",
                        [
                            [
                                "87.5 credit points of Level 1 Compulsory subjects",
                                "75 credit points of Level 2 Compulsory subjects",
                                "87.5 credit points of Level 3 Compulsory subjects"
                            ]
                        ]
                    ]
                ]
            },
            "Breadth": {
                "overview": [
                    [
                        "50 credit points of Breadth subjects\n",
                        [
                            [
                                "A minimum of 12.5 credit points of \n"
                            ]
                        ]
                    ]
                ]
            },
            "Progression Rules": {
                "overview": [
                    [
                        "Completion of CREA10002 Stories of Place in the first semester of study",
                        "Completion of all Level 1 Compulsory subjects before proceeding to the next year level's Compulsory subjects",
                        "Completion of all Level 2 Compulsory subjects before proceeding to the next year level's Compulsory subjects",
                        "Note: Compulsory subjects in this program have prerequisites. Refer to individual subject entries."
                    ]
                ]
            },
            "For students who commenced prior to 2021": {
                "overview": [
                    "For students who commenced the Bachelor of Fine Arts prior to 2021, please click the following link to view your course structure and subject options:",
                    "Link"
                ]
            },
            "Subject Options": {
                "overview": [],
                "Level 1 Compulsory subjects": {
                    "overview": [
                        [
                            "CREA10002"
                        ],
                        "All students must take Stories of Place in their first semester of commencement in this course",
                        [
                            "FLTV10016",
                            "FLTV10017",
                            "FLTV10019",
                            "FLTV10020",
                            "FLTV10025"
                        ]
                    ]
                },
                "Level 2 Compulsory subjects": {
                    "overview": [
                        [
                            "FLTV20015",
                            "FLTV20019",
                            "FLTV20013",
                            "FLTV20016"
                        ]
                    ]
                },
                "Level 3 Compulsory subjects": {
                    "overview": [
                        [
                            "FLTV30018",
                            "FLTV30021",
                            "FLTV30023",
                            "FLTV30024"
                        ]
                    ]
                }
            }
        },
        "Breadth requirements": {
            "overview": [
                "50 points of breadth subjects including at least 12.5 points at Level 2 or Level 3."
            ],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Fine Arts (Animation)"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may be eligible to apply for the Bachelor of Fine Arts (Degree with Honours), or the Master of Film and Television by coursework."
    ]
}