{
    "Course name": "Bachelor of Science (Degree with Honours)",
    "Course code": "BH-SCI",
    "Overview text": [
        "The Bachelor of Science (Degree with Honours) provides an advanced, specialised year of study that follows students' completion of the requirements of the Bachelor of Science. It extends students' knowledge and skills through a supervised research project together with advanced coursework in related areas of study.",
        "The Bachelor of Science (Degree with Honours) can be undertaken in a range of programs/departments.",
        "Last updated: 6 September 2024"
    ],
    "Overview table": {
        "Award title": "Bachelor of Science (Degree with Honours)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "014791D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "Within the last 10 years a Bachelor of Science with a weighted average mark of at least H3 (65%), or equivalent, with a major relevant to the discipline stream within the Bachelor of Science (Degree with Honours) that they seek to enter; or",
            "Within the last 10 years an undergraduate degree, of which at least the equivalent of two full years comprises science or technology areas of study, with a weighted average mark of at least H3 (65%), or equivalent, and containing at least 50 points of study at third year level in science or technology areas of study relevant to the discipline stream within the Bachelor of Science (Degree with Honours) that they seek to enter; and",
            "Any necessary Year 12, first- or second-year study from other disciplines that form essential background to the discipline stream within the Bachelor of Science (Degree with Honours) that they seek to enter.",
            "Applicants are also required to meet any specific subject prerequisites and prior academic performance requirements associated with the discipline stream that they seek to enter. For stream specific requirements see details below.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "The availability of supervision and resources in suitable project areas.",
            "Quotas may be applied to the degree as a whole or to individual discipline streams and preference may be given to applicants with evidence of appropriate preparation or potential to undertake research.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduateEnglish language requirementsmust be met.",
            "Bachelor of Science (Honours): Schedule of Discipline Streams. This schedule shows available discipline streams and additional conditions applicants must meet to be eligible for (but not automatically guaranteed) selection into Honours within that stream.",
            "Agricultural Science:a major in a discipline relevant to the proposed project",
            "Anatomy and Physiology, and Neuroscience:a major in a discipline relevant to the proposed project",
            "Animal Science and Management:a major in a discipline relevant to the proposed project",
            "Biochemistry and Pharmacology:if specialisation in Pharmacology, a major in Pharmacology or in a discipline relevant to the proposed project.",
            "Biosciences:a major in a discipline relevant to the proposed research project.",
            "Chemistry:a major in Chemistry. Applications from otherwise qualified graduates who have not completed a Chemistry major will be considered on a case-by-case basis by the Selection Committee.",
            "Earth Sciences:a major in Earth Sciences, or in a discipline relevant to the proposed project",
            "Food Science:a major in a discipline relevant to the proposed project",
            "Forest Science:a major in a discipline relevant to the proposed project",
            "General Practice and Primary Care:a major in a discipline relevant to the proposed project",
            "Geography:a major in Geography with an average of at least H2B (70%) in second and third-year subjects in Geography, or equivalent",
            "Medical Biology:a major in a discipline relevant to the proposed project",
            "Medicine (Austin Health):a major in a discipline relevant to the proposed project",
            "Medicine (Royal Melbourne Hospital):a major in a discipline relevant to the proposed project",
            "Medicine (St Vincent's Hospital):a major in a discipline relevant to the proposed project",
            "Microbiology and Immunology:a major in a discipline relevant to the proposed project",
            "Oral Health Science:a major in a discipline relevant to the proposed project",
            "Otolaryngology:a major in a discipline relevant to hearing sciences",
            "Paediatrics:a major in a discipline relevant to the proposed project",
            "Pathology:a major in Pathology, or a major in a discipline relevant to the proposed project together with PATH30001 and PATH30002, or equivalent. Applications from otherwise qualified graduates who have not completed the above but have practical experience in another biomedical science discipline will be considered on a case-by-case basis by the Selection Committee",
            "Physiotherapy Science:a major in a discipline relevant to the proposed project",
            "Population and Global Health:a major in a discipline relevant to the proposed project",
            "Psychology:please refer to Psychology specialisation page for details",
            "Psychopharmacology (Psychiatry (Austin Health)):a major in pharmacology, psychology or chemistry",
            "Veterinary Bioscience:a major in a biological sciences discipline"
        ],
        "Inherent requirements (core participation requirements)": [
            "The Bachelor of Science (Degree with Honours) welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the degree.",
            "The Bachelor of Science (Degree with Honours) requires all students to enrol in subjects where they will require:",
            "1. The ability to comprehend complex science and technology related information",
            "2. The ability to clearly and independently communicate a knowledge and application of science, and technology principles and practices during assessment tasks",
            "3. The ability to actively and safely contribute in clinical, laboratory, and fieldwork/excursion activities.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "There may be additional inherent academic requirements for some subjects, and these requirements are listed within the description of the requirements for each of these subjects.",
            "Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the relevant Subject Coordinator and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Science (Degree with Honours) programs are prescribed 100-point programs (equivalent to eight 12.5-point subjects) comprising Advanced Coursework and Research Project components as outlined below.The balance between the advanced coursework and research project components may vary from program to program, with each comprising at least 25 points and no more than 75 points of the 100-point program. The balance specific to each program will be specified in the handbook entry for each program.",
                "1. Advanced coursework:",
                [
                    "Two to four, 12.5-point honours or postgraduate level advanced coursework subjects."
                ],
                "The coordinator of the honours program in which the student is enrolled must approve each student's advanced coursework program.",
                "Each student's advanced coursework program will comprise advanced coursework subjects offered by one or more departments teaching into the degree's honours program, which may include cognate subjects offered in relevant Masters degrees where students meet the prerequisite requirements of those subjects.",
                "The honours coordinator may approve a student including one 12.5-point Level 3 coursework subject. Inclusion of a Level 3 subject will also require approval of the appropriate subject coordinator. This option is only available if it specified in the details of the individual program which can be found using the links below.",
                "2. Research project:",
                [
                    "A research project subject or subjects with total points value of between 50 and 75 points."
                ],
                "Duration and commencement of honours programsThe duration of the Bachelor of Science (Degree with Honours) programs is approximately 36 weeks within a total duration of 40 weeks for Semester 1 entrants, and approximately 36 weeks within a total duration of 46 weeks for semester 2 entrants. Not all programs are available as mid year entry. Refer to individual program entries for details.",
                "The dates of the honours programs may vary between programs.",
                "For Semester 2 entrants, up to ten weeks of leave may be taken within this 46-week period, in negotiation with the supervisor.",
                "Completion RequirementsTo be awarded honours students must gain:",
                [
                    "A pass in at least 100-points of subjects in their chosen program",
                    "A result of at least 65% in the research project",
                    "A weighted credit-point average of 65% or greater."
                ],
                "Students may be given permission to repeat an advanced coursework honours subject/component, or enrol in additional subject(s), in order to meet the requirement to pass 100 points. However the honours result will be determined over all subjects for which a result is entered. When the weighted credit-point average is less than 65% the honours degree will not be awarded."
            ]
        }
    },
    "Majors, minors and specialisations": {
        "Honours Programs available within the Bachelor of Science (Degree with Honours)": [
            "Honours programs are grouped by the responsible Faculty/organisational unit."
        ],
        "Faculty of Science": [
            {
                "BioSciences": "100 Credits",
                "Chemistry": "100 Credits",
                "Earth Sciences": "100 Credits",
                "Ecosystem Science": "100 Credits",
                "Geography": "100 Credits",
                "Agricultural Science": "100 Credits",
                "Animal Science and Management": "100 Credits",
                "Food Science": "100 Credits",
                "Human Nutrition": "100 Credits",
                "Veterinary Bioscience": " Credits"
            }
        ],
        "Faculty of Medicine, Dentistry and Health Sciences": [
            "Each honours project is offered by one of the following departments / institutes. Some projects are offered within multiple departments / institutes. Please refer to theMDHS Honours websitefor full details on selecting a project.",
            "Students in these specialisations will have the opportunity to apply for an optional internship elective subject to be completed after submission of their thesis. Internship opportunities are dependent upon availability and are competitive. Please refer to the following HLTH40001 MDHS Honours Elective Internship page for more information.",
            {
                "HLTH40001": " Credits",
                "Anatomy and Physiology, and Neuroscience": "100 Credits",
                "Biochemistry and Pharmacology": "100 Credits",
                "Clinical Pathology": "100 Credits",
                "Medical Biology": "100 Credits",
                "Medicine (Austin Health)": "100 Credits",
                "Medicine (Royal Melbourne Hospital)": "100 Credits",
                "Medicine (St Vincent's Hospital)": "100 Credits",
                "Medicine (Western Health)": "100 Credits",
                "Microbiology and Immunology": "100 Credits",
                "Oral Health Science": "100 Credits",
                "Otolaryngology": "100 Credits",
                "Paediatrics": "100 Credits",
                "Pathology": "100 Credits",
                "Physiotherapy Science": "100 Credits",
                "Population and Global Health": "100 Credits",
                "General Practice and Primary Care": "100 Credits",
                "Optometry and Vision Sciences": "100 Credits"
            }
        ],
        "Psychological Sciences": [
            {
                "Psychology": "100 Credits"
            }
        ]
    },
    "Further Study": [
        "The opportunity to specialise during the honours year provides a strong foundation for the future direction of graduates. Graduates may progress to higher degree research in the sciences at the Masters or Doctorate level. They are also eligible to progress to a range of graduate coursework programs."
    ]
}