{
    "Course name": "Bachelor of Music",
    "Course code": "B-MUS",
    "Overview text": [
        "The Bachelor of Music provides advanced training across a variety of musical disciplines. Students major in Composition, Interactive Composition, Jazz & Improvisation, Musicology & Ethnomusicology, Music Studies, Performance, or Performance (ANAM).",
        "The program develops technically advanced and experienced musicians through an immersive and practical curriculum with music core studies, music electives and complementary breadth subjects.",
        "Students will:",
        "For students who commenced prior to 2022",
        "For students who commenced the Bachelor of Music prior to 2022, please go to the2021 Handbookto view your course structure and subject options."
    ],
    "Overview table": {
        "Award title": "Bachelor of Music",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "058837J",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time or 72 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed one of:",
            "(a) the Victorian Certificate of Education, including VCE Units 3 and 4 – either a study score of at least 25 in one of English, English Language or Literature, or a study score of at least 30 in English as an Additional Language;",
            "(b) the International Baccalaureate Diploma, including at least Grade 4 in English or English B (Standard Level or Higher Level); or",
            "(c) a senior secondary program, foundation studies program, or equivalent approved by the Academic Board, including appropriate English language studies.",
            "Applicants are also required to complete an audition, test, interview, workshop, portfolio or folio presentation, as prescribed by the Academic Board for the Major to which entry is sought.",
            "Composition Major",
            "folio audition; and",
            "prior academic performance",
            "Interactive Composition Major",
            "folio audition; and",
            "set creative task; and",
            "performance audition; and",
            "prior academic performance",
            "Jazz and Improvisation Major",
            "performance audition; and",
            "prior academic performance",
            "Musicology & Ethnomusicology Major",
            "performance audition; and",
            "prior academic performance",
            "Music Studies Major",
            "performance audition; and",
            "prior academic performance",
            "Performance Major",
            "performance audition; and",
            "prior academic performance",
            "Performance (ANAM) Major",
            "admission to the Australian National Academy of Music, and",
            "performance audition; and",
            "prior academic performance",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "performance in an audition; and/or",
            "performance in folio audition; and",
            "prior academic performance, and",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduate English language requirements must be met.",
            "Notes",
            "For applications through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne.",
            "Details for the performance audition and folio audition requirements can be found on the Fine Arts and Music Study website https://finearts-music.unimelb.edu.au/study-with-us\n"
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne Conservatorium of Music welcomes applications from Students with disabilities. It is University and Melbourne Conservatorium of Music policy to take reasonable steps to make adjustments so as to enable the student’s participation in the Melbourne Conservatorium of Music’s programs, especially the Bachelor of Music.",
            "The Music degree involves acquisition and refinement of musical knowledge and practice. All Students of Music must possess intellectual, ethical, physical and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the Melbourne Conservatorium of Music.",
            "Students in the Bachelor of Music must have abilities and skills that include the following:",
            "Well-developed proficiency in at least one musical instrument (or voice) or composition",
            "This instrumental or vocal proficiency is initially measured at the application stage by audition into the Bachelor of Music and requires satisfactory demonstration of a well-developed level of physical control of the instrument or voice.",
            "Well-developed music literacy",
            "Students must be capable of reading music notation fluently either in standard musical notation or Braille musical notation.",
            "Aural discrimination skills",
            "Students needs to have well developed-hearing skills to ensure that the aural requirements essential to the study of Music can be met.",
            "The ability to comprehend complex music information and material independently",
            "Students needs to possess an appropriate level of cognition to deal with required material relating to the theory and history of Music; this material may be in written, aural or schematised forms.",
            "The capacity to communicate clearly a knowledge and application of music principles and practice in assessment activities and the ability to function as part of a musical team",
            "Students must possess the emotional health required for full use of their intellectual abilities, the exercise of good judgment, and the prompt completion of all responsibilities required by the course.",
            "Students need to be aware of their personal limitations and when and where to seek professional advice or supervision.",
            "Students must be able to tolerate physically taxing musical practice and to function effectively under stress and isolation in musical preparation.",
            "Students must also be able to function effectively as part of a musical ensemble, to adapt to changing environments, and to display flexibility.",
            "Behavioural and Social Attributes",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment.",
            "Students are required to take responsibility for their own participation and learning.",
            "Students also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of others.",
            "Assessment may include the outcomes of tasks completed in collaboration with other Students.",
            "Students who feel their disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Music requires the successful completion of 300 credit points.",
                [
                    "12.5 credit points of Level 1 Compulsory subjects",
                    "Completion of one prescribed major (consisting of 225 credit points of subjects)",
                    "50 credit points of Breadth subjects includingA minimum of 12.5 credit points of Level 2 or Level 3 breadth subjects\n",
                    "A minimum of 12.5 credit points of Level 2 or Level 3 breadth subjects",
                    "12.5 credit points of free points (either music elective or breadth)"
                ],
                [
                    "A minimum of 12.5 credit points of Level 2 or Level 3 breadth subjects"
                ]
            ],
            "Progression Rules": {
                "overview": [
                    [
                        "Students must have completed the compulsory subject Musical Perspectives before commencing Level 2 core subjects.",
                        "Students must have completed all Level 1 core subjects before taking Level 3 core subjects.",
                        "Note: Compulsory subjects in this program have prerequisites. Refer to individual subject entries."
                    ]
                ]
            },
            "Subject Options": {
                "overview": [],
                "Compulsory Level 1 subject": {
                    "overview": [
                        [
                            "MUSI10230"
                        ],
                        "Note: Students must have completed the compulsory subject Musical Perspectives before taking Level 2 core subjects."
                    ]
                }
            },
            "Music Electives": {
                "overview": [
                    "Please refer to the following page for a full list of available music elective subjects:",
                    "https://handbook.unimelb.edu.au/components/b-mus-infspc-4"
                ]
            },
            "Music Ensemble Electives": {
                "overview": [
                    "Please refer to the following page for information on ensembles available and the rules relating to them:",
                    "https://handbook.unimelb.edu.au/components/b-mus-infspc-6"
                ]
            }
        },
        "Breadth requirements": {
            "overview": [
                "50 points of breadth, including at least 12.5 points at Level 2 or 3"
            ],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Music"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}