{
    "Course name": "Bachelor of Music (Degree with Honours)",
    "Course code": "BH-MUS",
    "Overview text": [
        "The Bachelor of Music (Honours) is a highly specialised, music-only program designed by students according to their strengths, interests, and vocational aspirations. The degree provides students with enhanced knowledge and expertise to further prepare for entry to the music profession, and links with advanced graduate study opportunities.",
        "Distinct from the Tailored program, specialisations are available in Performance, Composition, Musicology/Ethnomusicology, Jazz & Improvisation, and Interactive Composition.",
        "Last updated: 13 September 2024"
    ],
    "Overview table": {
        "Award title": "Bachelor of Music (Degree with Honours)",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "060219F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "within the last 5 years, a Bachelor of Music or equivalent degree with a weighted average mark of at least H3 (65%), or equivalent, with a major relevant to the discipline stream within the Bachelor of Music (Degree with Honours) that they seek to enter.",
            "Applicants are also required to meet any specific subject prerequisites, prior academic performance requirements and audition, folio or academic writing requirements associated with the discipline stream that they seek to enter.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance, and where relevant audition, folio or academic writing requirements associated with the discipline stream that they seek to enter; and",
            "the availability of supervision and resources in suitable areas.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, theundergraduate English language requirementsmust be met.",
            "Note.Quotas may be applied to the degree as a whole or to individual discipline streams and preference may be given in some discipline streams to applicants with evidence of appropriate preparation or potential to undertake research."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne Conservatorium of Music welcomes applications from students with disabilities. It is University and Melbourne Conservatorium of Music policy to take reasonable steps to make reasonable adjustments so as to enable the student’s participation in the Melbourne Conservatorium of Music’s programs. The Bachelor of Music (Honours) is a degree which involves acquisition and refinement of musical knowledge and practice. All students of music must possess intellectual, ethical, physical and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the Melbourne Conservatorium of Music.",
            "A candidate for the BMus(Hons) degree must have abilities and skills which include the following:",
            "a)Well developed existing proficiency in at least one musical instrument.This instrumental or vocal proficiency is initially measured at the application stage by audition into the Bachelor of Music. This proficiency will involve appropriately developed physical skills to achieve a well developed level of physical control of the instrument;",
            "b)Well developed music literacy.A candidate must be capable of reading music notation fluently whether in standard musical notation or Braille musical notation;",
            "c)Aural discrimination skills.A candidate needs to have well developed hearing to ensure that the aural requirements essential to the study of Music can be met;",
            "d)The ability to comprehend complex music information and material independently.A candidate needs to possess an appropriate level of cognition to deal with required material relating to the theory and history of Music. This material may exist in written, and aural and schematised forms;",
            "e)The capacity to communicate clearly a knowledge and application of music principles andpractice in assessment activities and the ability to function as part of a musical team.A candidate must possess the emotional health required for full use of his/her intellectual abilities, the exercise of good judgment and the prompt completion of all responsibilities required by the course. All candidates need to be aware of their personal limitations and be aware of when and where to seek professional advice or supervision. Candidates must be able to tolerate physically taxing musical practice and to function effectively under stress and isolation in musical preparation. They must also be able to function effectively as part of a musical ensemble, to adapt to changing environments and to display flexibility.",
            "f)Behavioural and Social Attributes.A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel their disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "100-point program in one of the following specialisations:",
                [
                    "Tailored Program",
                    "Performance",
                    "Composition",
                    "Musicology/Ethnomusicology",
                    "Interactive Composition",
                    "Jazz & Improvisation"
                ],
                "Completion Requirements",
                "To be awarded honours students must gain: an Honours grade (H1, H2A, H2b or H3) in all core subjects for their stream, a pass mark in all electives, and an overall grade of 65% or greater.",
                "Final Mark Calculation",
                "The honours result will be determined over all subjects for which a result is entered.",
                "Additional/Repeat Subjects",
                "Students may be given permission to repeat an advanced coursework honours core subject/component in order to meet the requirements. Should students have achieved an Honours grade in all core subjects but not an overall grade of H3, they may be allowed to take a further elective to meet the requirements."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The Melbourne Conservatorium of Music offers a wide range of study options including:",
        "Graduate Research programs:",
        "• Master of Music - specialisations available in Performance, Conducting, Composition, Musicology, Ethnomusicology and Music Therapy.• Doctor of Philosophy - a research degree, during which the candidate undertakes a substantial piece of original research that makes a distinct contribution to knowledge in the chosen discipline",
        "Graduate Coursework programs:",
        "• Master of Music (Performance Teaching) - a specialist coursework degree enabling graduates in Western classical and contemporary music to work as performer-teachers in a variety of situations including community, private provider and further education settings and as instrumental/vocal instructors in schools.• Master of Music (Opera Performance) - a specialist coursework degree, offered in conjunction with Victorian Opera, delivering elite-level training for opera performers.• Master of Music Therapy - a coursework program leading to professional registration as Music Therapists (RMT) with the Australian Music Therapy Association (Inc.).",
        "Fine Arts and Music – Study with Us"
    ]
}