{
    "Course name": "Bachelor of Design",
    "Course code": "B-DES",
    "Overview text": [
        "The Bachelor of Design is focused on the life-cycle of the constructed and inhabited world. Its application is wide ranging, from the macro-level of the metropolis to the construction of buildings, bridges and landscapes, to the small-scale of systems and micro-structures.",
        "Design is the unifying force that ties multiple disciplines together - from Architecture to Civil Systems, Computing and Software Systems (prior to 2023 called Computing), Construction, User Experience Design (prior to 2023 called Digital Technologies), Landscape Architecture, Mechanical Systems, Property, Digital Infrastructure Engineering Systems, Urban Planning through to Visual and Performance Design. Via completion of majors and electives taken from other disciplines within the degree, double majors, and specialisations, students will encounter design in a transdisciplinary and complementary manner. Students will be exposed to the spectrum of design – from the creative and imaginative, through to the algorithmic and policy-generated, to iterative and managed problem-solving.",
        "Design is the lens through which students will understand the constructed world and explore options for its future. In achieving this, students will demonstrate understanding of design processes and methods - identifying and analysing problems, synthesising ideas, prototyping and evaluating solutions and communicating outcomes as they apply to aspects of the constructed environments related to particular majors.",
        "Students will learn from internationally recognised scholars and industry professionals, and, as graduates, will have a broad understanding of the role of design in the contemporary world. Graduates will be ready to further their education with a professional Masters degree or be skilled to enter the workforce."
    ],
    "Overview table": {
        "Award title": "Bachelor of Design",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "090744C",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time or 72 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed: one of(a) the Victorian Certificate of Education including",
            "VCE Units 3 and 4 - either a study score of at least 25 in one of English, English Language or Literature or a study score of at least 30 in English as an Additional Language;",
            "(b) the International Baccalaureate Diploma including",
            "at least Grade 4 in English or English B (Standard Level or Higher Level);",
            "(c) a senior secondary program, foundation studies program or equivalent approved by the Academic Board including appropriate English language studies.Except for applicants eligible for Access Melbourne,minimum ATAR or equivalent overall performance rankings apply.Meeting these requirements does not guarantee selection2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board on the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduate English language requirements must be met.Note.",
            "For applications through the Victorian Tertiary Admission Centre, “middle band” selection adjustments are made only on the basis of eligibility for Access Melbourne.",
            "Mathematical knowledge equivalent to VCE Mathematical Methods (CAS) Units 3 and 4 with a study score of 25 or more is required for the following majors: Construction, Civil Systems, Mechanical Systems, Property, Digital Infrastructure Engineering Systems, Computing and Software Systems.",
            "Students intending to pursue one of these majors should take VCE Mathematical Methods (CAS) Units 3 and 4 or an equivalent subject. A bridging subject will be available for students who have done VCE Mathematical Methods Units 1 and 2 but not VCE Mathematical Methods Units 3 and 4 or students who have received a study score below 25 in VCE Mathematical Methods Units 3 and 4."
        ],
        "Inherent requirements (core participation requirements)": [
            "A candidate for the Bachelor of Design degree must have abilities and skills which include the following: observation; communication; motor; conceptual, integrative, and quantitative; and behavioural and social.Adjustments can be provided to minimise the impact of a disability, however students need to be able to participate in the program in an independent manner and with regard to their safety and the safety of others.Observation:A candidate must be able to read text, diagrams, maps, drawings and numerical data. The candidate should be able to observe details at a number of scales and record useful observations of environmental contexts.Communication:A candidate should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. A candidate must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.Motor:Candidates should have sufficient motor function to elicit information from external contexts. Off-campus investigations may include visits to construction sites, urban, rural and/or remote environments. Candidates should have sufficient motor ability to prepare documentation of analytic texts, drawings and models of findings and for the preparation of proposals for environmental interventions via digital or other means. A candidate should have the ability to actively participate in appropriate site and/or design studio‐based activities.Intellectual‐Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, the candidate should be able to comprehend three‐dimensional relationships and to understand the spatial relationships of structures.Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.Major‐specific core participation requirementsCertain Majors employ studio-based learning, which includes the requirement to present work and to receive critique and feedback publically. “Crits” are an integral part of working in the industry and are an inherent requirement of the course.The Bachelor of Design welcomes applications from students with disabilities. It is the University and degree policy to take reasonable steps to make reasonable adjustments so as to enable a student’s participation in the Bachelor of Design.Students who feel their disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support(SEDS)."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Design requires the successful completion of 300 credit points.",
                [
                    "225 credit points of Design subjects including\n",
                    [
                        [
                            "A minimum of 62.5 credit points of Level 1 discipline subjects",
                            "A minimum of 62.5 credit points of Level 2 discipline subjects",
                            "A minimum of 75 credit points of Level 3 discipline subjects"
                        ]
                    ],
                    "50 credit points of Breadth subjects including\n",
                    [
                        [
                            "A maximum of 37.5 credit points of Level 1 breadth subjects"
                        ]
                    ],
                    "25 credit points of free subjects (discipline or breadth)"
                ]
            ],
            "Additional rules": {
                "overview": [
                    [
                        "A maximum of 125 credit points of Level 1 subjects",
                        "Completion of between one and two prescribed majors"
                    ]
                ]
            },
            "Progression rules": {
                "overview": [
                    [
                        "All students must complete the compulsory Discovery modules in their first year of enrolment in the Bachelor of Design. Completion of these modules is required before being allowed to progress to the second year of enrolment.",
                        "Completion of at least 50 points of Level 1 study before proceeding to the next subject year level.",
                        "Completion of at least 50 points of Level 2 study before proceeding to the next subject year level."
                    ]
                ]
            },
            "Electives": {
                "overview": [
                    "Electives are chosen from any subject offered within the Bachelor of Design. Prerequisites for some subjects will apply. Please check subject Handbook entries for prerequisite requirements."
                ],
                "Architecture, Building and Planning": {
                    "overview": [
                        [
                            "ABPL10005",
                            "ARCH10001",
                            "ARCH10002",
                            "ARCH10003",
                            "PLAN10002",
                            "CONS10001",
                            "PROP10001",
                            "LARC10001",
                            "PLAN10001",
                            "ARCH20001",
                            "ARCH20002",
                            "ARCH20003",
                            "ARCH20004",
                            "ABPL20033",
                            "ABPL20035",
                            "ABPL20036",
                            "ABPL20042",
                            "ABPL20053",
                            "CONS20002",
                            "PROP20001",
                            "PROP20002",
                            "PROP20003",
                            "LARC20001",
                            "PLAN20002",
                            "ARCH30005",
                            "PLAN30003",
                            "ARCH30001",
                            "ARCH30002",
                            "ABPL30041",
                            "ABPL30042",
                            "ABPL30061",
                            "ABPL30039",
                            "ABPL30044",
                            "ABPL30046",
                            "ABPL30055",
                            "PLAN30001",
                            "PLAN30005",
                            "ABPL30059",
                            "PROP30001",
                            "PROP30002",
                            "PROP30003",
                            "PLAN30004",
                            "LARC30001",
                            "LARC30002",
                            "ARCH30003",
                            "ARCH30004",
                            "ABPL30053",
                            "ABPL30057",
                            "CONS30001",
                            "CONS30002",
                            "ABPL30063",
                            "ABPL30068",
                            "ABPL30069",
                            "CVEN30011",
                            "ABPL30064",
                            "MULT30022",
                            "ABPL30067",
                            "PERF30001",
                            "GDES30004",
                            "ABPL30051",
                            "ABPL30070",
                            "ARCH10004",
                            "ABPL20055",
                            "ABPL10007",
                            "PROP10002",
                            "ARCH30006",
                            "ABPL30071"
                        ]
                    ]
                },
                "Science": {
                    "overview": [
                        [
                            "MAST10005",
                            "MAST10006",
                            "MAST10007",
                            "MAST20029",
                            "PHYC10001",
                            "PHYC10002",
                            "PHYC10004"
                        ]
                    ]
                },
                "Engineering": {
                    "overview": [
                        [
                            "COMP10002",
                            "COMP10003",
                            "INFO10003",
                            "ENGR10005",
                            "ENGR20004",
                            "ENEN20002",
                            "ENGR20003",
                            "ELEN20005",
                            "GEOM20013",
                            "GEOM20015",
                            "INFO20003",
                            "COMP20007",
                            "COMP20008",
                            "COMP20005",
                            "CVEN30008",
                            "CVEN30009",
                            "CVEN30010",
                            "ENGR30002",
                            "MCEN30017",
                            "MCEN30018",
                            "GEOM30009",
                            "GEOM30013",
                            "GEOM30012",
                            "INFO30005",
                            "COMP30019",
                            "COMP30023",
                            "COMP30022",
                            "MAST20029",
                            "INFO20004",
                            "INFO30008",
                            "ENVS10006",
                            "INFO30009",
                            "CVEN30011",
                            "PLAN30004",
                            "MCEN30021",
                            "INFO20005",
                            "ENGR20005",
                            "SWEN20003",
                            "MCEN30020",
                            "COMP30026",
                            "GEOM30014",
                            "COMP20003",
                            "COMP10001",
                            "SWEN30006",
                            "CVEN20001"
                        ]
                    ]
                },
                "Fine Arts and Music": {
                    "overview": [
                        [
                            "FINA10026",
                            "FINA10032",
                            "FINA20029",
                            "GDES10001",
                            "GDES20001",
                            "GDES20002",
                            "GDES30001",
                            "GDES30002",
                            "GDES30003",
                            "MUSI10223",
                            "FINA20041",
                            "FINA20043",
                            "FINA30022",
                            "FINA30023",
                            "FINA30024",
                            "GDES30004",
                            "PERF30001",
                            "GDES30007",
                            "GDES30008",
                            "GDES30005",
                            "GDES30006"
                        ]
                    ]
                },
                "Business and Economics": {
                    "overview": [
                        [
                            "MKTG10001"
                        ]
                    ]
                },
                "Law": {
                    "overview": [
                        [
                            "BLAW10001"
                        ]
                    ]
                }
            },
            "Breadth": {
                "overview": [
                    "General information on breadth subjects is available at this Stop1 webpage:",
                    "Link",
                    "Breadth subjects specifically available for Bachelor of Design students include:",
                    [
                        "University Breadth subjects",
                        "English as a Second Language subjects",
                        "subjects offered in the Bachelor of Arts, Bachelor of Commerce, Bachelor of Design, Bachelor of Environments, Bachelor of Music and Bachelor of Science that are available as breadth and that contrast with your major (or intended major)",
                        "some subjects from within the majors in the Bachelor of Design may be available as breadth, depending on which major you are intending to take"
                    ]
                ]
            },
            "Non-allowed Breadth": {
                "overview": [
                    "The breadth options for Bachelor of Design students are restricted depending on the major that has been selected. Detailed information and a full listing of Non-allowed Breadth subjects is available under the pages of the individual majors."
                ]
            }
        },
        "Breadth requirements": {
            "overview": [
                "Please refer to the original document"
            ],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Design"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {
        "Major requirement": [
            "A major consists of 50 points of study at third year level within a single discipline. A discipline is an area of knowledge, such as Architecture or Spatial Systems. Please note that access to third year subjects in majors is often controlled through prerequisite chains, with prerequisite sequences for majors often beginning in first year – please refer to each major’s Handbook entry for more details.",
            [
                "Students must complete at least one major.",
                "A maximum of two majors may be recognised. Double majors are only available in selected disciplines. Further information about double majors can be found at this link:"
            ],
            "Link"
        ],
        "Specialisation requirements": [
            "A specialisation consists of 25 points of study at third year level. First and second year-level prerequisite subjects may be required – please refer to each specialisation’s Handbook entry for more details.",
            [
                "Specialisations are a short sequence of subjects that focus particular themes relevant across multiple disciplines. Subjects in specialisations do not form part of any existing major but are distinctive and are complementary to a student’s major. Completions of specialisations may support a research pathway, lead to accreditation with industry bodies or may increase employment opportunities."
            ]
        ],
        "Majors are available in the following areas of study": [
            {
                "Architecture": "50 Credits",
                "Civil Engineering Systems": "50 Credits",
                "Computing and Software Systems": "50 Credits",
                "Construction": "50 Credits",
                "User Experience Design": "50 Credits",
                "Graphic Design": "50 Credits",
                "Landscape Architecture": "50 Credits",
                "Mechanical Engineering Systems": "50 Credits",
                "Performance Design": "50 Credits",
                "Property": "50 Credits",
                "Spatial Systems": "50 Credits",
                "Urban Planning": "50 Credits",
                "Digital Infrastructure Engineering Systems": "50 Credits"
            }
        ],
        "Specialisations are available in the following areas of study": [
            {
                "Building Information Modelling": "25 Credits",
                "Design Histories": "25 Credits",
                "Design Visualisation": "25 Credits",
                "Environmental Design": "25 Credits",
                "Event Design": "25 Credits",
                "Towards Practice": "25 Credits",
                "Transport Design": "25 Credits",
                "Typography": "25 Credits",
                "Working with First Peoples Design Knowledge": "25 Credits"
            }
        ]
    },
    "Further Study": [
        "Graduates of the Bachelor of Design will have the opportunity to continue their study through a number of pathways and dependent on their chosen field may be able to enrol in a professional masters or a research higher degree in an area related to your undergraduate study area. In addition to this, the University offers a range of new graduate-entry only programs, available to graduates of any 3-year Bachelor degree.Professional Masters degrees are available in:",
        "ArchitectureConstruction ManagementLandscape ArchitectureUrban PlanningUrban DesignPropertyDesign for PerformanceProduction Design for ScreenEngineering (Civil Systems)Engineering (Mechanical Systems)Engineering (Spatial)Engineering (Software)Information SystemsInformation TechnologyMaster of Science (Computer Science)",
        ""
    ]
}