{
    "Course name": "Bachelor of Fine Arts (Visual Art)",
    "Course code": "B-FAVISART",
    "Overview text": [
        "The Bachelor of Fine Arts (Visual Art) is a three-year degree that equips graduates with the necessary conceptual and material creative knowledge to engage and thrive in the professional contemporary art industry.",
        "The course offers immersive, integrated and experiential practice-based studio studies and critical and theoretical studies in drawing and printmaking, painting, photography and sculpture. Students will also have a choice of subjects that allow them to explore cross-disciplinary studies, exposing them to multi-disciplinary knowledge and skills.",
        "Embedded in the cultural capital of Australia, students will learn from internationally recognised artists, lecturers and industry professionals. Students will also have opportunities to work with visiting artists from Australia and abroad.",
        "As graduates, they will be equipped with the skills and critical knowledge to contribute to a diverse range of contexts including professional contemporary art practice and exhibition making. They may develop future pathways into museum and curatorial professions, fashion, design, education and art therapy.",
        "In the first year, the students engage in foundational techniques to develop and strengthen their skills base enabling creative self-expression. In the second year, the students will use their knowledge to further engage with and develop their studio practice and artistic voice.",
        "In their the final year of study, students will have the unique opportunity to travel overseas and/or to involve themselves in research-based internal electives. The synthesis of these skills culminates in third year with the capstone experience of the Graduation Exhibition, a professionally curated and installed showcase of student art work from all disciplines, visited by national industry professionals, patrons, collectors and members of the general public."
    ],
    "Overview table": {
        "Award title": "Bachelor of Fine Arts (Visual Art)",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "093589G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed one of:(a) the Victorian Certificate of Education including;VCE Units 3 and 4 either a study score of at least 25 in English/English Language/Literature or a study score of at least 30 in English as an Additional Language;(b) the International Baccalaureate Diploma including at least Grade 4 in English or English B (Standard Level or Higher Level);(c) a senior secondary program, foundation studies program or equivalent approved by Academic Board including appropriate English language studies.Applicants are also required to complete an audition, test, interview, workshop, portfolio or folio presentation, as prescribed by the Academic Board for the stream to which entry is sought.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance, and",
            "performance in an interview, portfolio or folio presentation.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduate English language requirements must be met.",
            "Note. For applicants through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Fine Arts (Visual Art) requires the successful completion of 300 credit points."
            ],
            "Compulsory subjects": {
                "overview": [
                    [
                        "237.5 credit points of Compulsory subjects\n75 credit points of Level 1 Compulsory subjects\n75 credit points of Level 2 Compulsory subjects\n87.5 credit points of Level 3 Compulsory subjects\n\n",
                        "75 credit points of Level 1 Compulsory subjects",
                        "75 credit points of Level 2 Compulsory subjects",
                        "87.5 credit points of Level 3 Compulsory subjects"
                    ],
                    [
                        "75 credit points of Level 1 Compulsory subjects",
                        "75 credit points of Level 2 Compulsory subjects",
                        "87.5 credit points of Level 3 Compulsory subjects"
                    ]
                ]
            },
            "Electives": {
                "overview": [
                    [
                        "12.5 credit points of Level 3 electives"
                    ]
                ]
            },
            "Breadth": {
                "overview": [
                    [
                        "50 credit points of Breadth subjectsa minimum of 12.5 credit points of Level 2 or Level 3 breadth subjects\n\n",
                        "a minimum of 12.5 credit points of Level 2 or Level 3 breadth subjects\n"
                    ],
                    [
                        "a minimum of 12.5 credit points of Level 2 or Level 3 breadth subjects\n"
                    ]
                ]
            },
            "Progression Rules": {
                "overview": [
                    [
                        "Completion of CREA10002 Stories of Place in the first semester of study",
                        "Completion of all Level 1 Compulsory subjects before proceeding to the next year level's Compulsory subjects",
                        "Completion of all Level 2 Compulsory subjects before proceeding to the next year level's Compulsory subjects",
                        "Note: Compulsory subjects in this program have prerequisites. Refer to individual subject entries."
                    ]
                ]
            },
            "For students who commenced prior to 2021": {
                "overview": [
                    "For students who commenced the Bachelor of Fine Arts prior to 2021, please click the below link to view your course structure and subject options:",
                    "Link"
                ]
            },
            "Subject Options": {
                "overview": [],
                "Level 1 Compulsory subjects": {
                    "overview": [
                        [
                            "CREA10002"
                        ],
                        "Note: All students must take Stories of Place in their first semester of commencement in this course",
                        [
                            "FINA10025",
                            "FINA10026",
                            "FINA10032",
                            "FINA10034"
                        ]
                    ]
                },
                "Level 2 Compulsory subjects": {
                    "overview": [
                        [
                            "FINA20027",
                            "FINA20029",
                            "FINA20030",
                            "FINA20032"
                        ]
                    ]
                },
                "Level 3 Compulsory subjects": {
                    "overview": [
                        [
                            "FINA30017",
                            "FINA30028",
                            "FINA30002",
                            "FINA30018"
                        ]
                    ]
                },
                "Level 3 electives": {
                    "overview": [
                        [
                            "FINA30025",
                            "FINA30026",
                            "FINA30027"
                        ]
                    ]
                }
            }
        },
        "Breadth requirements": {
            "overview": [
                "50 points of breadth subjects including at least 12.5 points at Level 2 or Level 3."
            ],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Fine Arts (Visual Art)"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}