{
    "Course name": "Bachelor of Arts",
    "Course code": "B-ARTS",
    "Overview text": [
        "The Bachelor of Arts offers unique flexibility with the opportunity to focus on one or two majors or a major and a minor chosen from a broad range of programs in the humanities, social sciences and languages. Students can:"
    ],
    "Overview table": {
        "Award title": "Bachelor of Arts",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "002167E",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time or 72 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed one of:",
            "(a) The Victorian Certificate of Education including;VCE Units 3 and 4 either a study score of at least 25 in English/English Language/Literature or a study score of at least 30 in English as an Additional Language;",
            "(b) The International Baccalaureate Diploma including at least Grade 4 in English or English B (Standard Level or Higher Level);",
            "(c) A senior secondary program, foundation studies program or equivalent approved by Academic Board including appropriate English language studies.Except for applicants eligible for Access Melbourneminimum ATAR or equivalent overall performance rankings apply.",
            "Meeting requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider prior academic performance.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAcademic Board Ruleson the use of selection instruments.4. For applications who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma,undergraduate English language requirementsmust be met.",
            "Note. For applications through the Victorian Tertiary Admissions Centre “middle band” selection adjustments are made only on the basis of eligibility for Access Melbourne.Applicants intending to major in Economics are advised that mathematic requirements apply for this major: at least 25 in VCE Units 3 and 4 in IB Mathematics (Standard Level or Higher Level) or equivalent; VCE Further Mathematics or IB Mathematical Studies are not sufficient.",
            "For information on admissions please visit:www.futurestudents.unimelb.edu.au"
        ],
        "Inherent requirements (core participation requirements)": [
            "The inherent academic requirements for study in the Bachelor of Arts are:",
            "the ability to attend classes and actively engage in both independent and group learning;",
            "the ability to comprehend complex disciplinary and interdisciplinary information related to the courses taught in the faculty;",
            "the ability to explain and evaluate complex concepts, theories and issues at work in a variety of texts;",
            "the ability to clearly communicate a knowledge and application of humanities, social sciences and language principles and practices during assessment tasks.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. They must take full responsibility for their own participation and learning and adhere to the expectations outlined in theStudent Charter.",
            "Students also contribute to the learning of other students in collaborative environments and must therefore demonstrate a wide range of interpersonal skills which consider the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. Integrity, concern for others, interpersonal skills, interest, and motivation are all personal qualities that are deemed necessary for students enrolled in the BA.",
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Arts requires the successful completion of 300 credit points."
            ],
            "Course Rules": {
                "overview": [
                    [
                        "225 credit points of Arts subjects including\n",
                        [
                            [
                                "A minimum of 75 credit points of Level 1 Discovery and Discipline subjects",
                                "A minimum of 75 credit points of Level 2 discipline subjects",
                                "A minimum of 75 credit points of Level 3 discipline subjects"
                            ]
                        ],
                        "Remaining 25 points may consist of either Arts or Breadth subjects (all other course rules must still be met)."
                    ]
                ]
            },
            "Additional rules": {
                "overview": [
                    [
                        "A maximum of 125 credit points of Level 1 subjects",
                        "Diversity of study: a maximum of 125 points from any single discipline may be completed.",
                        "Completion of between one and two Majors",
                        "Completion of a maximum of one Minor",
                        "Completion of 12.5 credit points of Compulsory Level 1 Discovery subjects"
                    ]
                ]
            },
            "Non-standard Majors": {
                "overview": [
                    "The standard rules above may change if you elect to take any of the following non-standard majors. In these cases, please check the relevant Handbook entries for what their adjusted rules are:",
                    [
                        "Chinese Studies",
                        "Psychology",
                        "Economics",
                        "Double Major in Criminology, Politics and International Studies, and/or Sociology",
                        "Double Major in Ancient World Studies and Classics (Ancient Greek and Latin)"
                    ]
                ]
            },
            "Course Rules with Economics major": {
                "overview": [
                    [
                        "187.5 credit points of Arts subjects including\n",
                        [
                            [
                                "A minimum of 62.5 credit points of Level 1 Discovery and Discipline subjects",
                                "A minimum of 62.5 credit points of Level 2 discipline subjects",
                                "A minimum of 62.5 credit points of Level 3 discipline subjects"
                            ]
                        ],
                        "Zero credit points of Breadth subjects (other than subjects taken as part of the Economics major)"
                    ]
                ]
            },
            "Course Rules with Psychology major": {
                "overview": [
                    [
                        "225 credit points of Arts subjects including\n",
                        [
                            [
                                "A minimum of 75 credit points of Level 1 Discovery and Discipline subjects",
                                "A minimum of 75 credit points of Level 2 discipline subjects",
                                "A minimum of 75 credit points of Level 3 discipline subjects"
                            ]
                        ],
                        "Remaining 25 points may consist of either Arts or Breadth subjects (all other course rules must still be met)."
                    ]
                ]
            },
            "Progression Rules": {
                "overview": [
                    [
                        "Arts Discovery - ARTS10002 (12.5 credit points) must be completed within the first semester of commencement of the course.",
                        "Completion of at least 50 points of Level 1 study before proceeding to the next subject year level.",
                        "Completion of at least 50 points of Level 2 study before proceeding to the next subject year level."
                    ]
                ]
            },
            "Arts Discovery subject": {
                "overview": [
                    "Arts Discovery - ARTS10002 will introduce you to the study of Arts at first-year and beyond. This subject explores different ways of understanding a complex issue of shared importance across the humanities, social science and language disciplines currently offered in the BA and will provide you with the essential skills for continued study in Arts.",
                    "Arts Discovery will provide a common first-year learning community in which students will benefit from on campus and/or online seminars combining exciting discussions, diverse research methodologies, and useful academic skills practice supported by an interactive online learning environment.",
                    "Students will take Arts Discovery within their first semester of study. Arts Discovery will count towards individual non-language majors/minors at level 1 and it is a core subject for the BA. Students who elect to undertake two majors can choose an additional first year Arts subject from the same discipline area.",
                    [
                        "ARTS10002"
                    ]
                ]
            },
            "Arts Discipline subjects": {
                "overview": [
                    "Outside of fulfilling the subject requirements for your chosen majors/minors, discipline points may also be taken from the ‘Arts Discipline electives’ list (click on links below for full listings), and from general Faculty of Arts subject lists below.",
                    "Work Integrated Learning",
                    "Students may only complete one of the listed Work Integrated Learning subjects per semester, and students cannot complete the same Work Integrated Learning subject at different year levels.",
                    [
                        "MULT20010",
                        "MULT20012",
                        "MULT20014",
                        "ARTS30001",
                        "MULT30019",
                        "MULT30020",
                        "MULT30021"
                    ],
                    "Multidisciplinary subjects (general Faculty of Arts)",
                    "‘Australia Now’ is recommended for incoming study abroad (SA-EX), exchange students (EX-UG) and international students with limited experience of Australian culture.",
                    [
                        "MULT10020",
                        "MULT20013",
                        "ARTS20002"
                    ]
                ]
            },
            "Diversity of Study": {
                "overview": [
                    "Students are required to take subjects across multiple discipline areas and can only take a maximum of 125 credit points per discipline. The following lists show the subjects available as Arts discipline subjects and can be taken alongside majors and minors to help meet Arts discipline course requirements.",
                    "Ancient World Studies",
                    "A maximum of 125 credit points ofAncient World Studies - Level 1Ancient World Studies - Level 2Ancient World Studies - Level 3",
                    "Anthropology",
                    "A maximum of 125 credit points ofAnthropology - Level 1Anthropology - Level 2Anthropology - Level 3",
                    "Arabic Studies",
                    "A maximum of 125 credit points ofArabic Studies - Level 1Arabic Studies - Level 2Arabic Studies - Level 3",
                    "Art History",
                    "A maximum of 125 credit points ofArt History - Level 1Art History - Level 2Art History - Level 3",
                    "Asian Studies",
                    "A maximum of 125 credit points ofAsian Studies - Level 1Asian Studies - Level 2Asian Studies - Level 3",
                    "Chinese Studies",
                    "A maximum of 125 credit points ofChinese Studies - Level 1Chinese Studies - Level 2Chinese Studies - Level 3",
                    "Classics (Ancient Greek and Latin)",
                    "A maximum of 125 credit points ofClassics - Level 1Classics - Level 2Classics - Level 3",
                    "Creative Writing",
                    "A maximum of 125 credit points ofCreative Writing - Level 1Creative Writing - Level 2Creative Writing - Level 3",
                    "Criminology",
                    "A maximum of 125 credit points ofCriminology - Level 1Criminology - Level 2Criminology - Level 3",
                    "Development Studies",
                    "A maximum of 125 credit points ofDevelopment Studies - Level 1Development Studies - Level 2",
                    "English and Theatre Studies",
                    "A maximum of 125 credit points ofEnglish and Theatre Studies - Level 1English and Theatre Studies - Level 2English and Theatre Studies - Level 3",
                    "European Studies",
                    "A maximum of 125 credit points ofEuropean Studies - Level 1European Studies - Level 2European Studies - Level 3",
                    "French Studies",
                    "A maximum of 125 credit points ofFrench Studies - Level 1French Studies - Level 2French Studies - Level 3",
                    "Gender Studies",
                    "A maximum of 125 credit points ofGender Studies - Level 1Gender Studies - Level 2Gender Studies - Level 3",
                    "Geography",
                    "A maximum of 125 credit points ofGeography - Level 1Geography - Level 2Geography - Level 3",
                    "German Studies",
                    "A maximum of 125 credit points ofGerman Studies - Level 1German Studies - Level 2German Studies - Level 3",
                    "Hebrew and Jewish Studies",
                    "A maximum of 125 credit points ofHebrew and Jewish Studies - Level 1Hebrew and Jewish Studies - Level 2Hebrew and Jewish Studies - Level 3",
                    "History",
                    "A maximum of 125 credit points ofHistory - Level 1History - Level 2History - Level 3",
                    "History and Philosophy of Science",
                    "A maximum of 125 credit points ofHistory and Philosophy of Science - Level 1History and Philosophy of Science - Level 2History and Philosophy of Science - Level 3",
                    "Indigenous Studies",
                    "A maximum of 125 credit points ofIndigenous Studies - Level 1Indigenous Studies - Level 2Indigenous Studies - Level 3",
                    "Indonesian Studies",
                    "A maximum of 125 credit points ofIndonesian Studies - Level 1Indonesian Studies - Level 2Indonesian Studies - Level 3",
                    "Islamic Studies",
                    "A maximum of 125 credit points ofIslamic Studies - Level 1Islamic Studies - Level 2Islamic Studies - Level 3",
                    "Italian Studies",
                    "A maximum of 125 credit points ofItalian Studies - Level 1Italian Studies - Level 2Italian Studies - Level 3",
                    "Japanese Studies",
                    "A maximum of 125 credit points ofJapanese Studies - Level 1Japanese Studies - Level 2Japanese Studies - Level 3",
                    "Korean Studies",
                    "A maximum of 125 credit points ofKorean Studies - Level 1Korean Studies - Level 2Korean Studies - Level 3",
                    "Language Studies",
                    "A maximum of 125 credit points ofLanguage Studies - Level 1Language Studies - Level 2Language Studies - Level 3",
                    "Linguistics and Applied Linguistics",
                    "A maximum of 125 credit points ofLinguistics and Applied Linguistics - Level 1Linguistics and Applied Linguistics - Level 2Linguistics and Applied Linguistics - Level 3",
                    "Media and Communications",
                    "A maximum of 125 credit points ofMedia and Communications - Level 1Media and Communications - Level 2Media and Communications - Level 3",
                    "Philosophy Level 1",
                    [
                        "ARTS10004",
                        "PHIL10002",
                        "PHIL10003"
                    ],
                    "Philosophy Level 2 and 3",
                    "A maximum of 87.5 credit points ofPhilosophy - Level 2Philosophy - Level 3",
                    "Politics and International Studies",
                    "A maximum of 125 credit points ofPolitics and International Studies - Level 1Politics and International Studies - Level 2Politics and International Studies - Level 3",
                    "Psychology",
                    "A maximum of 125 credit points ofPsychology - Level 1Psychology - Level 2Psychology - Level 3",
                    "Russian Studies",
                    "A maximum of 125 credit points ofRussian Studies - Level 1Russian Studies - Level 2Russian Studies - Level 3",
                    "Screen and Cultural Studies",
                    "A maximum of 125 credit points ofScreen and Cultural Studies - Level 1Screen and Cultural Studies - Level 2Screen and Cultural Studies - Level 3",
                    "Social Theory",
                    "A maximum of 125 credit points ofSocial Theory - Level 2Social Theory - Level 3",
                    "Sociology",
                    "A maximum of 125 credit points ofSociology - Level 1Sociology - Level 2Sociology - Level 3",
                    "Spanish and Latin American Studies",
                    "A maximum of 125 credit points ofSpanish and Latin American Studies - Level 1Spanish and Latin American Studies - Level 2Spanish and Latin American Studies - Level 3"
                ]
            }
        },
        "Breadth requirements": {
            "overview": [],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Arts"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {
        "Major rules:": [
            [
                "Each major must include at least 25 credit points at Level 1 in each discipline",
                "Non-language majors, except for Economics and Psychology, can include the Arts Discovery subject as a Level 1 subject",
                "Subjects, including Arts Discovery, cannot be credited to more than one major or minor",
                "Some majors include prerequisites and compulsory subjects",
                "All majors include a compulsory Capstone Subject at level 3; only students completing a major in that discipline can enrol in the Capstone",
                "Students considering two majors must ensure subject selection follows the progression rules in each discipline – complete all required level 1 subjects before enrolling in level 2 subjects, and complete four level 2 subjects before enrolling in level 3 subjects."
            ]
        ],
        "Majors are available in the following areas of study:": [
            {
                "Ancient World Studies": "100 Credits",
                "Anthropology": "100 Credits",
                "Arabic Studies": "100 Credits",
                "Art History": "100 Credits",
                "Asian Studies": "100 Credits",
                "Chinese Studies": "100 Credits",
                "Classics (Ancient Greek and Latin)": "100 Credits",
                "Creative Writing": "100 Credits",
                "Criminology": "100 Credits",
                "Economics": "112.5 Credits",
                "English and Theatre Studies": "100 Credits",
                "French Studies": "100 Credits",
                "Gender Studies": "100 Credits",
                "Geography": "100 Credits",
                "German Studies": "100 Credits",
                "Hebrew and Jewish Studies": "100 Credits",
                "History": "100 Credits",
                "History and Philosophy of Science": "100 Credits",
                "Indigenous Studies": "100 Credits",
                "Indonesian Studies": "100 Credits",
                "Islamic Studies": "100 Credits",
                "Italian Studies": "100 Credits",
                "Japanese Studies": "100 Credits",
                "Korean Studies": "100 Credits",
                "Linguistics and Applied Linguistics": "100 Credits",
                "Media and Communications": "100 Credits",
                "Philosophy": "100 Credits",
                "Politics and International Studies": "100 Credits",
                "Psychology": "125 Credits",
                "Russian Studies": "100 Credits",
                "Screen and Cultural Studies": "100 Credits",
                "Sociology": "100 Credits",
                "Spanish and Latin American Studies": "100 Credits"
            }
        ],
        "Minors are available in the following areas of study:": [
            {
                "Ancient World Studies minor": "75 Credits",
                "Anthropology minor": "75 Credits",
                "Arabic Studies minor": "75 Credits",
                "Art History minor": "75 Credits",
                "Asian Studies minor": "75 Credits",
                "Chinese Societies minor": "75 Credits",
                "Chinese Studies minor": "75 Credits",
                "Classics (Ancient Greek and Latin) minor": "75 Credits",
                "Creative Writing minor": "75 Credits",
                "Criminology minor": "75 Credits",
                "Development Studies minor": "75 Credits",
                "Digital Studies minor": "75 Credits",
                "Economics minor": "75 Credits",
                "English and Theatre Studies minor": "75 Credits",
                "English Language Studies minor": "75 Credits",
                "Environmental Studies minor": "75 Credits",
                "European Studies minor": "75 Credits",
                "French Studies minor": "75 Credits",
                "Gender Studies minor": "75 Credits",
                "Geography minor": "75 Credits",
                "German Studies minor": "75 Credits",
                "Hebrew and Jewish Studies minor": "75 Credits",
                "History minor": "75 Credits",
                "History and Philosophy of Science minor": "75 Credits",
                "Indigenous Studies minor": "75 Credits",
                "Indonesian Studies minor": "75 Credits",
                "Islamic Studies minor": "75 Credits",
                "Italian Studies minor": "75 Credits",
                "Japanese Societies minor": "75 Credits",
                "Japanese Studies minor": "75 Credits",
                "Knowledge and Learning minor": "75 Credits",
                "Korean Studies minor": "75 Credits",
                "Law and Justice minor": "75 Credits",
                "Linguistics and Applied Linguistics minor": "75 Credits",
                "Media and Communications minor": "75 Credits",
                "Medieval and Early Modern Studies minor": "75 Credits",
                "Philosophy minor": "75 Credits",
                "Politics and International Studies minor": "75 Credits",
                "Psychology minor": "75 Credits",
                "Russian Studies minor": "75 Credits",
                "Screen and Cultural Studies minor": "75 Credits",
                "Sociology minor": "75 Credits",
                "South Asian Studies minor": "75 Credits",
                "Spanish and Latin American Studies minor": "75 Credits"
            }
        ]
    },
    "Further Study": [
        "HonoursHigh-achieving BA graduates may apply for entry to the Bachelor of Arts (Degree with Honours) The Honours program comprises a research project as well as specialist subjects. For more information on entry to Honours, see theArts Honours webpage.Coursework MastersIf you wish to continue your professional studies at a Graduate level, the studies you undertake in your major can provide a direct pathway to coursework masters degrees in a wide range of areas. Entry is based on academic merit and in most cases requires completion of a Bachelor degree or equivalent. For more information on entry into a coursework masters degree see theArts Graduate degree website.Research Higher DegreesIf you wish to undertake advanced research and explore particular study areas in more depth, there will be opportunities to proceed to a range of Research Higher Degrees at masters and doctoral level, usually upon completion of an Honours degree. For more information about research higher degree study in Arts and the entry requirements, see theArts Graduate degree website."
    ]
}