{
    "Course name": "Bachelor of Design (Degree with Honours)",
    "Course code": "BH-DES",
    "Overview text": [
        "The Bachelor of Design (Degree with Honours) is an advanced program of study intended for high achieving students with an interest in research.",
        "Students in the Bachelor of Design (Degree with Honours) will have the opportunity to identify an area of interest from a relevant specialisation, and to complete an independent research thesis, with the guidance of an academic supervisor.",
        "The degree offers three specialisations:",
        "Students to complete the honours degree will be eligible to apply for a research higher degree, or to continue on to a coursework masters program.",
        "Last updated: 6 September 2024"
    ],
    "Overview table": {
        "Award title": "Bachelor of Design (Degree with Honours)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "107132K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry to the Bachelor of Design (Degree with Honours), students must have completed:",
            "• An undergraduate degree with a major in Architecture or Urban Planning, or equivalent, with a weighted average mark of 70%. within the last 5 years.",
            "Applicants must also meet any specific requirements for entry to the discipline stream they seek to enter.",
            "Meeting the requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "• Prior academic performance; and",
            "• The availability of supervision and resources in the project areas. Admission to the degree is subject to suitable supervision being available.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education, or the International Baccalaureate Diploma, the undergraduate English language requirements must be met."
        ],
        "Inherent requirements (core participation requirements)": [
            "A candidate for the Bachelor of Design degree must have abilities and skills which include the following: observation; communication; motor; conceptual, integrative, and quantitative; and behavioural and social.",
            "Adjustments can be provided to minimise the impact of a disability. However students need to be able to participate in the program in an independent manner and with regard to their safety and the safety of others.",
            "Observation:A candidate must be able to read text, diagrams, maps, drawings and numerical data. The candidate should be able to observe details at a number of scales and record useful observations of environmental contexts.",
            "Communication:A candidate should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. A candidate must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.",
            "Motor:Candidates should have sufficient motor function to elicit information from external contexts. Off-campus investigations may include visits to construction sites, urban, rural and/or remote environments. Candidates should have sufficient motor ability to prepare documentation of analytic texts, drawings and models of findings and for the preparation of proposals for environmental interventions via digital or other means. A candidate should have the ability to actively participate in appropriate site and/or design studio‐based activities.",
            "Intellectual‐Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, the candidate should be able to comprehend three‐dimensional relationships and to understand the spatial relationships of structures.",
            "Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students",
            "The Bachelor of Design welcomes applications from students with disabilities. It is the University and degree policy to take reasonable steps to make reasonable adjustments so as to enable a student’s participation in the Bachelor of Design.Students who feel their disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support(SEDS)."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Design (Honours) degree requires the completion of 100 points:",
                [
                    "62.5 points core subjects including a  50 point thesis, and  Research Methods in Design  (12.50 points).",
                    "37.50 points  elective subjects (three coursework subjects )."
                ],
                "Honours students are required to achieve an honours grade (ie. H1, H2A, H2B, H3) for each subject and thesis component of their course in order to complete the degree.",
                "For information on policies that govern this degree students should refer to the information on the Melbourne Policy Library."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students to complete the honours degree will be eligible to apply for a research higher degree, or to continue on to a coursework masters program."
    ]
}