{
    "Course name": "Bachelor of Fine Arts (Acting)",
    "Course code": "B-FAACTING",
    "Overview text": [
        "The Bachelor of Fine Arts (Acting) is a three-year full-time degree that provides an intensive studio-based learning environment where students develop holistically as actors. The program focuses on the rigorous preparation of actors working across all areas of the profession for stage, screen and digital media, exposing students to current cultural and methodological practices in the profession. It offers students the opportunity to participate in National and International engagement projects, enhancing their readiness for the industry.",
        "The Bachelor of Fine Arts (Acting) enables graduates to enter the profession with effective clarity, preparedness and skills. The structure of the course allows intensive skills training and practice to take place alongside rehearsal processes and a wide variety of performance situations.",
        "Collaborative practice is regarded as an important element of contemporary theatre and is therefore integral to our training. Our graduates work at all levels of the theatre, film and television industries, and are renowned for their capacity to work creatively and collaboratively in both traditional and ground-breaking performance contexts. Students establish careers in professional theatre, community arts and education, film, television, radio, new media and education."
    ],
    "Overview table": {
        "Award title": "Bachelor of Fine Arts (Acting)",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "094861K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed one of:(a) the Victorian Certificate of Education including;VCE Units 3 and 4 either a study score of at least 25 in English/English Language/Literature or a study score of at least 30 in English as an Additional Language;(b) the International Baccalaureate Diploma including at least Grade 4 in English or English B (Standard Level or Higher Level);(c) a senior secondary program, foundation studies program or equivalent approved by Academic Board including appropriate English language studies.Applicants are also required to complete an audition, test, interview, workshop, portfolio or folio presentation, as prescribed by the Academic Board for the stream to which entry is sought.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance, and",
            "performance in an audition.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduate English language requirements must be met.",
            "Note. For applicants through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry. The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Student Equity and Disability Support website.http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Fine Arts (Acting) requires the successful completion of 300 credit points."
            ],
            "Compulsory subjects": {
                "overview": [
                    [
                        "250 credit points of Compulsory subjects\n75 credit points of Level 1 Compulsory subjects\n75 credit points of Level 2 Compulsory subjects\n100 credit points of Level 3 Compulsory subjects\n\n",
                        "75 credit points of Level 1 Compulsory subjects",
                        "75 credit points of Level 2 Compulsory subjects",
                        "100 credit points of Level 3 Compulsory subjects"
                    ],
                    [
                        "75 credit points of Level 1 Compulsory subjects",
                        "75 credit points of Level 2 Compulsory subjects",
                        "100 credit points of Level 3 Compulsory subjects"
                    ]
                ]
            },
            "Breadth": {
                "overview": [
                    [
                        "50 credit points of Breadth subjectsa minimum of 12.5 credit points of Level 2 or Level 3 breadth subjects\n\n",
                        "a minimum of 12.5 credit points of Level 2 or Level 3 breadth subjects\n"
                    ],
                    [
                        "a minimum of 12.5 credit points of Level 2 or Level 3 breadth subjects\n"
                    ]
                ]
            },
            "Progression Rules": {
                "overview": [
                    [
                        "Completion of CREA10002 Stories of Place in the first semester of study",
                        "Completion of all Level 1 Compulsory subjects before proceeding to the next year level's Compulsory subjects",
                        "Completion of all Level 2 Compulsory subjects before proceeding to the next year level's Compulsory subjects",
                        "Note: Compulsory subjects in this program have prerequisites. Refer to individual subject entries."
                    ]
                ]
            },
            "For students who commenced prior to 2021": {
                "overview": [
                    "For students who commenced the Bachelor of Fine Arts prior to 2021, please click the link below to view your course structure and subject options:",
                    "Link"
                ]
            },
            "Subject Options": {
                "overview": [],
                "Level 1 Compulsory subjects": {
                    "overview": [
                        [
                            "CREA10002"
                        ],
                        "Note: All students must take Stories of Place in their first semester of commencement in this course",
                        [
                            "DRAM10032",
                            "DRAM10033",
                            "DRAM10034",
                            "DRAM10035"
                        ],
                        "These subjects are co-delivered with the Bachelor of Fine Arts (Theatre)."
                    ]
                },
                "Level 2 Compulsory subjects": {
                    "overview": [
                        [
                            "DRAM20028",
                            "DRAM20029",
                            "DRAM20030",
                            "DRAM20031"
                        ]
                    ]
                },
                "Level 3 Compulsory subjects": {
                    "overview": [
                        [
                            "DRAM30027",
                            "DRAM30028",
                            "DRAM30029",
                            "DRAM30030",
                            "DRAM30031",
                            "DRAM30032"
                        ]
                    ]
                }
            }
        },
        "Breadth requirements": {
            "overview": [
                "50 points of breadth subjects including at least 12.5 points at Level 2 or Level 3."
            ],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Fine Arts (Acting)"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}