{
    "Course name": "Bachelor of Commerce",
    "Course code": "B-COM",
    "Overview text": [
        "The Bachelor of Commerce (BCom) at Melbourne equips graduates with the knowledge and technical skills necessary to understand and participate in the modern business world. The course also prepares students for subsequentgraduate studiesand allows them to achieve the highest level of success in their professionalcareers.",
        "The Bachelor of Commerce provides a solid foundation in economics, accounting, finance, quantitative methods and organisational behaviour. The structure of the course requires students to study compulsory and elective subjects from the core program. These determine a student's major field of study.",
        "A feature of all the new generation undergraduate degrees is the compulsory breadth component. Students choose a number of subjects from disciplines outside of commerce, exposing them to multi-disciplinary knowledge and skills.",
        "The course allows students to meetaccreditationrequirements specified by accounting and actuarial professional bodies. Graduate options upon completion of the degree, other than proceeding directly to employment, include anHonoursyear, or further professional or research-related graduate studies."
    ],
    "Overview table": {
        "Award title": "Bachelor of Commerce",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "002143B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time or 72 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.In order to be considered for entry, applicants must have completed:",
            "one of",
            "(a) the Victorian Certificate of Education including:",
            "VCE Units 3 and 4 – either a study score of at least 25 in one of English, English Language or Literature or a study score of at least 30 in English as an Additional Language, and\n",
            "VCE Units 3 and 4 – a study score of at least 25 in Mathematics Methods or Specialist Mathematics;",
            "Note: For applicants interested in the Bachelor of Commerce to Master of Engineering Graduate Degree Package, it's strongly encouraged that you complete Specialist Mathematics Units 3 and 4, or equivalent. If VCE Specialist Mathematics is not completed, applicants will be required to undertake an additional Mathematics subject through the University's Community Access Program (CAP). Melbourne School of Engineering will provide a fee waiver for one CAP subject.",
            "(b) the International Baccalaureate Diploma including",
            "English, and a minimum grade of 4 in either Applications and interpretations HL, Analysis and approaches SL, or Analysis and approaches HL. For students with English as their second language a pass in English B at the required level will be accepted as satisfying the English prerequisite. Except where specified, IB subjects must be passed to at least Grade 4 Standard or Higher Level. Mathematical Studies is not deemed equivalent to VCE Mathematical Methods;",
            "(c) a senior secondary program, foundation studies program or equivalent approved by the Academic Board including appropriate English language and Mathematics studies.",
            "Except for applicants eligible forAccess Melbourne, minimum ATAR or equivalent overall performance rankings apply.",
            "Meeting these requirements does not guarantee selection.2.In ranking applications, the Selection Committee will consider, prior academic performance.",
            "3.The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4.For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduateEnglish language requirementsmust be met.",
            "Note. For applications through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne."
        ],
        "Inherent requirements (core participation requirements)": [
            "The BCom and Masters degrees of the Faculty of Business and Economics equip graduates with the knowledge and technical skills necessary to understand and participate in the modern business world. The degrees include the following academic requirements for study:",
            "the ability to explain and evaluate concepts, theories, institutional arrangements and operations of modern mixed economies;",
            "the ability to critically evaluate the economy, commerce and business in the broader social and political context;",
            "the ability to explain and apply concepts across a range of commerce and business disciplines in solving business and policy problems;",
            "the ability to contribute positively to the development of organisations and society in relation to business, government and the commercial professions.",
            "All students of the Faculty’s courses must possess intellectual, ethical, and emotional capabilities required to participate in the curriculum and to achieve the levels of competence required by the Faculty. Candidates for the BCom degree and for FBE Masters degrees must have abilities and skills in communication; in conceptual, integrative, and quantitative dimensions; and in behavioural and social dimensions.",
            "\nCommunication: The student must be able to communicate effectively and efficiently in oral and/or written form. A student must have the ability to clearly and independently communicate knowledge and application of a discipline, principles or practices during assessment tasks, and in some discipline streams.",
            "\nIntellectual‐Conceptual, Integrative and Quantitative Abilities: The student is expected to have the ability to develop problem‐solving skills and demonstrate the ability to establish study plans and priorities. These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving requires all of these intellectual abilities. Students should also have the ability to comprehend complex disciplinary and cross disciplinary information related to the BCom and Masters degrees.",
            "\nBehavioural and Social Attributes: Students must possess behavioural and social attributes that enable them to participate in a complex learning environment and the emotional health required for full utilisation of their intellectual abilities. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. Integrity, concern for others, interpersonal skills, interest, and motivation are all personal qualities that are deemed necessary for students enrolled in FBE courses.",
            "The Faculty of Business and Economics welcomes applications from students with disabilities. It is University and Faculty policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.",
            "Students who feel their disability will prevent them from participating in tasks involving the inherent academic requirements of the BCom and FBE Master's courses are encouraged to contact the Student Equity and Disability Support. Adjustments can be provided to minimise the impact of a disability, but students should participate in the course in an independent manner."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Accreditationinformation is available on the Faculty's website."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Commerce requires the successful completion of 300 credit points.",
                [
                    "237.5 credit points of Commerce discipline subjects including\nA minimum of 62.5 credit points of Level 1 commerce discipline subjects\n\nA minimum of 62.5 credit points of Level 2 commerce discipline subjects\n\nA minimum of 50 credit points of Level 3 commerce discipline subjects\n\n\n",
                    "A minimum of 62.5 credit points of Level 1 commerce discipline subjects\n",
                    "A minimum of 62.5 credit points of Level 2 commerce discipline subjects\n",
                    "A minimum of 50 credit points of Level 3 commerce discipline subjects\n",
                    "50 credit points of Breadth subjects includingA maximum of 37.5 credit points of Level 1 breadth subjects\n\n",
                    "A maximum of 37.5 credit points of Level 1 breadth subjects\n",
                    "12.5 credit points of free subjects (Commerce discipline or breadth)"
                ],
                [
                    "A minimum of 62.5 credit points of Level 1 commerce discipline subjects\n",
                    "A minimum of 62.5 credit points of Level 2 commerce discipline subjects\n",
                    "A minimum of 50 credit points of Level 3 commerce discipline subjects\n"
                ],
                [
                    "A maximum of 37.5 credit points of Level 1 breadth subjects\n"
                ]
            ],
            "Additional rules": {
                "overview": [
                    [
                        "Between 87.5 and 125 credit points of Level 1 subjects",
                        "A minimum of 75 credit points of Level 3 subjects",
                        "62.5 credit points of Compulsory Level 1 Commerce discipline subjects",
                        "12.5 credit points of Compulsory Level 2 commerce discipline subjects",
                        "completion of one Compulsory quantitative requirement",
                        "Completion of between one and two prescribed majors",
                        "at least 50 points of Level 3 commerce discipline subjects must be completed at the University of Melbourne."
                    ]
                ]
            },
            "Non-standard rules": {
                "overview": [
                    [
                        "Students who intend to apply for the Master of Engineering suite of degrees will be exempt from the Level 1 breadth maximum, as four Level 1 Science subjects will need to be taken to meet the pathway requirements: usually MAST10006 Calculus 2, MAST10007 Linear Algebra, and two first year Science subjects. (Note: Different first year science subjects are prerequisites for different engineering disciplines. Calculus 2 and Linear Algebra may not be required for certain engineering disciplines).",
                        "Students who want to complete the major in Accounting (with accreditation) and complete the required pathway to undertake one of the Master of Engineering suite of degrees are exempt from the Level 1 breadth maximum (see above) and must take one additional subject as CAP to complete this pathway (giving a total of 312.5 credit points)."
                    ]
                ]
            },
            "Progression rules": {
                "overview": [
                    [
                        "Completion of CMCE10001 Sustainable Commerce in the first semester of commencement in the course.",
                        "Completion of at least 50 points of Level 1 study before proceeding to the next subject year level.",
                        "Completion of at least 50 points of Level 2 study before proceeding to the next subject year level."
                    ]
                ]
            },
            "Compulsory subjects": {
                "overview": []
            },
            "Compulsory Level 1 commerce discipline subjects": {
                "overview": [
                    [
                        "CMCE10001"
                    ],
                    "Note: this subject is required to be completed in the first semester of commencement in the course",
                    [
                        "ACCT10001",
                        "ECON10004",
                        "ECON10003",
                        "FNCE10002"
                    ]
                ]
            },
            "Compulsory Level 2 commerce discipline subjects": {
                "overview": [
                    [
                        "MGMT20001"
                    ]
                ]
            },
            "Quantitative requirement": {
                "overview": [
                    "Option 1 - Standard quantitative path",
                    [
                        "ECON10005"
                    ],
                    "AND",
                    [
                        "ECON20003",
                        "ECOM20001",
                        "MGMT20005",
                        "MKTG20004"
                    ],
                    "Option 2 - Mathematics quantitative path",
                    [
                        "MAST20005"
                    ],
                    "AND",
                    [
                        "MAST20006",
                        "MAST20004"
                    ],
                    [
                        "Students pursuing actuarial studies must complete MAST20004 Probability.",
                        "Students opting to complete the mathematics path, do not complete Quantitative Methods 1 and 2. They may, if they wish, complete any of: ECOM20001 Econometrics 1, MGMT20005 Business Decision Analysis, MKTG20004 Market and Business Research.",
                        "Students who complete the mathematics path are still required to complete 62.5 points of level-2 commerce subjects; the mathematics subjects are counted as breadth."
                    ],
                    "Level 1 prerequisites for the mathematics path subjects:",
                    [
                        "Students with a study score of 25 or above in units 3/4 VCE Mathematical Methods (or equivalent): MAST10005 Calculus 1, MAST10006 Calculus 2, MAST10007 Linear Algebra.",
                        "Students with a study score of 29 or above in units 3/4 VCE Specialist Mathematics (or equivalent): MAST10006 Calculus 2, MAST10007 Linear Algebra.",
                        "Students with a study score of 36 or above in units 3/4 VCE Specialist Mathematics (or equivalent): MAST10021 Calculus 2: Advanced, MAST10022 Linear Algebra Advanced.",
                        "Students with a study score of 38 or above in units 3/4 VCE Specialist Mathematics (or equivalent): MAST10008 Accelerated Mathematics 1, MAST10009 Accelerated Mathematics 2."
                    ],
                    "Which quantitative subjects?",
                    [
                        "The choice of quantitative subjects will depend on your chosen field/s of study, your level of ability and interest in mathematics and the subjects in which you wish to enrol later in your degree.",
                        "Through the mathematics path, it is possible to satisfy the quantitative requirement of the course by taking mathematics subjects as breadth. This option is suitable for students who enjoy mathematics and have strong mathematical skills.",
                        "In deciding which quantitative subjects to take, you should check the prerequisites of the level-2 and level-3 subjects you wish to take to ensure you make the most appropriate choice."
                    ]
                ]
            },
            "Breadth": {
                "overview": [
                    "Breadth studies are those subjects chosen from outside the Faculty of Business and Economics. Students may take all of their 50 - 62.5 breadth points in one or more breadth disciplines. You can select subjects of your choice, or follow a breadth track: a set of complementary breadth subjects in various disciplines.",
                    "Certain breadth subjects in Law or Mathematics must be taken to gain accounting or actuarial accreditation. Students pursuing an approved engineering breadth sequence or accreditation in actuarial studies should see SPECIAL ARRANGEMENTS below.",
                    "Breadth subjects not available for Bachelor of Commerce students: any subjects offered by the Departments of Accounting, Economics, Finance, Management and Marketing and the Centre for Actuarial Studies cannot be taken as breadth subjects (even if expressly available as a breadth subject for students based in another degree).",
                    "Special arrangements:",
                    [
                        "Students commencing in 2010 - 2016 who are pursuing an approved engineering breadth sequence in the civil, electrical, mechanical or software streams will undertake 112.5 points of breadth and 187.5 commerce points.",
                        "Students pursuing accreditation in actuarial studies will take 62.5 points of breadth, including one breadth subject that is neither mathematics nor statistics, depending on prior mathematics study requirements.",
                        "Students enrolled in the Graduate Degree Package to the Master of Engineering, and Chancellors Scholars who intend to apply for the Master of Engineering, will be permitted to take up to four specific Level 1 breadth subjects to meet the pathway requirements."
                    ],
                    "Concurrent diplomas:",
                    "Certain breadth subjects may be cross-credited toward a concurrent diploma (see more information on the diplomas via the link below). These diplomas offer specialised study in a range of areas:",
                    [
                        "Diploma in Computing",
                        "Diploma in Languages",
                        "Diploma in Mathematical Sciences",
                        "Diploma in Music"
                    ],
                    "Commencing students interested in pursuing a diploma should seek advice from both Stop 1 and the owning faculty of the diploma.",
                    "Link"
                ]
            }
        },
        "Breadth requirements": {
            "overview": [],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Commerce"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduate degrees offer the opportunity for graduates to obtain a professional qualification or develop their expertise in an individual field. Graduate studies in commerce are also available for non-commerce graduates.",
        "Graduate Professional Degreesare professional qualifications in disciplines including law, engineering and teaching. Fifty percent of designated places will be Commonwealth supported.",
        "Graduate Programs in Commerceare business qualifications open to graduates from any discipline. They also allow commerce graduates to broaden their knowledge of business and management or extend their expertise in a particular field.",
        "TheHonoursyear provides advanced studies in individual commerce disciplines and is a gateway to research degrees such as the PhD."
    ]
}