{
    "Course name": "Bachelor of Fine Arts (Degree with Honours)",
    "Course code": "BH-FA",
    "Overview text": [
        "The Bachelor of Fine Arts (Degree with Honours) aims to produce innovative, ethical, critically engaged creative practitioners.",
        "This degree with honours offers students an opportunity to combine rigorous creative investigation with practice led research skills – interlocking critical curiosity and creative enquiry to encourage a deeper understanding and capacity in their chosen field of artistic practice.",
        "The degree seeks to introduce honours candidates of proven ability and aptitude to research training – developing students' critical thinking, creative drive, and capacity to devise, define and manage a major creative research project.",
        "Students specialise in Dance, Design and Production, Film and Television, Music Theatre, Theatre, or Visual Art, and each undertake a year-long project under the guidance of their individual supervisor to be completed by the end of the academic year.",
        "The Bachelor of Fine Arts (Degree with Honours) provides students with a pathway to a masters or PhD research degree.",
        "Last updated: 6 September 2024"
    ],
    "Overview table": {
        "Award title": "Bachelor of Fine Arts (Degree with Honours)",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "029294J",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "within the last 5 years, a Bachelor of Fine Arts or equivalent degree, with a weighted average mark of at least H2B (70%) or equivalent, with a major relevant to the discipline specialisation within the Bachelor of Fine Arts (Degree with Honours) that they seek to enter.",
            "Applicants are also required to complete a written proposal, portfolio, and interview, as prescribed by the Academic Board for the specialisation to which entry is sought.",
            "Dance Specialisation",
            "a written proposal; and ",
            "a portfolio; and ",
            "interview (shortlisted applicants only). ",
            "Design and Production Specialisation",
            "a written proposal; and ",
            "a portfolio; and ",
            "interview (shortlisted applicants only).",
            "Film and Television Specialisation",
            "a written proposal; and ",
            "a portfolio; and ",
            "interview (shortlisted applicants only).",
            "Music Theatre Specialisation",
            "a written proposal; and ",
            "a portfolio; and ",
            "interview (shortlisted applicants only).",
            "Theatre Specialisation",
            "a written proposal; and ",
            "a portfolio; and ",
            "interview (shortlisted applicants only).",
            "Visual Art Specialisation",
            "a written proposal; and ",
            "a portfolio; and ",
            "interview (shortlisted applicants only).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "written proposal; and",
            "portfolio; and",
            "interview (shortlisted applicants only)",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduate English language requirements must be met.",
            "Notes:",
            "Quotas may be applied to the degree as a whole or to discipline specialisations.",
            "Details for the written proposal, portfolio, and interview can be found on the Fine Arts and Music Study website https://finearts-music.unimelb.edu.au/study-with-us\n",
            "Film and Television Specialisation",
            "Successful applicants in the Film and Television Specialisation will be required to hold a current:",
            "First Aid Certificate (HLTAID003); and",
            "Working with Children Check.",
            "These must remain valid for the duration of the course."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/specialisation coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes.",
            "Students who have a disability which may prevent them from participating in tasks involving these inherent academic requirements are encouraged to contact Student Equity and Disability Serviceshttps://students.unimelb.edu.au/student-support/student-equity-and-disability-support"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "100-point program of compulsory subjects in the course or in a chosen specialisation."
            ],
            "Course Progression Rules": {
                "overview": [
                    "Students must have completedCREA40001 Research Methodsbefore progressing toCREA40002 Research Paper."
                ]
            },
            "Specialisations": {
                "overview": [
                    "Students apply for and enrol in one of six specialisations:",
                    [
                        "Dance",
                        "Design and Production",
                        "Film and Television",
                        "Music Theatre",
                        "Theatre",
                        "Visual Art"
                    ],
                    "25 points of compulsory subjects",
                    [
                        "CREA40001",
                        "CREA40002"
                    ],
                    "75 point core subject according to their specialisation"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a wide range of graduate coursework programs as well as research higher degree programs."
    ]
}