{
    "Course name": "Bachelor of Fine Arts (Theatre)",
    "Course code": "B-FATH",
    "Overview text": [
        "The Bachelor of Fine Arts (Theatre) is an interdisciplinary, full-time intensive-degree focused on fostering outstanding new generations of theatre makers who create original contemporary performances. The course is designed to bring together students with a diverse range of interests in performance creation and prepare them to become critical, curious and inventive theatre makers and highly skilled devisors of original performance work. The course places an emphasis on preparing students for diverse careers and professional practice and on artistic and cultural leadership.",
        "This hands-on, practical degree provides students with a broad creative skill set, including cutting-edge approaches to performance aesthetics and composition, critical thinking and contextual theory, embodied, somatic training, and dramaturgy for contemporary performance.",
        "Throughout their studies, students will encounter a range of concepts designed to place them at the forefront of industry practice, including immersive and participatory theatre, inclusive theatre practice, documentary and audio performance, physical theatre and movement, strategies of facilitation and directing, methods for writing for performance and ethical frameworks for theatre-making and performance with and for community and in applied theatre contexts.",
        "As part of developing an independent artistic practice, students experience a range of theatre-making provocations - solo and ensemble practice, site-specific work, applied theatre, theatre for young audiences and contemporary and experimental performance. Recent projects include collaborations with Polyglot Theatre, The Unconformity, Ilbijerri Theatre and Science Gallery Melbourne.",
        "Students will develop their own unique practice as theatre makers informed by an understanding of their own interests and identity, historical paradigms and an application of current methodologies and thinking. Students have opportunities to engage in regional and national projects, undertake company residencies and be part of multiple public performance seasons.",
        "The program culminates in the creation and performance of fully produced devised works in which students collaborate in pre-professional companies to conceive, develop, rehearse and present original works. These works are showcased to invited industry guests and a general public audience.",
        "Students will learn from highly experienced staff and mentors and collaborate on a range of live and digital theatre making contexts with invited industry professionals. Previous projects have included students making original performance in the Royal Botanic Gardens, abandoned shops and emporiums in the CBD and in gallery spaces, as well as more traditional theatre spaces and studios. Theatre students also collaborate throughout the course with students from other disciplines and schools at the Victorian College of the Arts (VCA) including students from Interactive Composition, Dance, Film and Television and Production.",
        "The Bachelor of Fine Arts (Theatre) enables graduates to enter the profession with the capacity to contribute to and transform Australia’s theatre ecology and instigate change and leadership with clarity and skill. Graduates work at all levels of the profession and are renowned for their capacity to work creatively and collaboratively, in both independent and mainstage professional theatre as well as in youth arts, festivals, community cultural development, film, television, radio, new media, arts and health and education contexts.",
        "Students are able to study 50 credit points of Breadth from other disciplines on offer at the University of Melbourne allowing VCA Theatre students to graduate with a range of skills and knowledge and multidisciplinary approaches to bring to their arts practice and careers."
    ],
    "Overview table": {
        "Award title": "Bachelor of Fine Arts (Theatre)",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "094860M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed one of:(a) the Victorian Certificate of Education including;VCE Units 3 and 4 either a study score of at least 25 in English/English Language/Literature or a study score of at least 30 in English as an Additional Language;(b) the International Baccalaureate Diploma including at least Grade 4 in English or English B (Standard Level or Higher Level);(c) a senior secondary program, foundation studies program or equivalent approved by Academic Board including appropriate English language studies.Applicants are also required to complete an audition, test, interview, workshop, portfolio or folio presentation, as prescribed by the Academic Board for the stream to which entry is sought.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance, and",
            "performance in an audition.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduate English language requirements must be met.",
            "Note. For applicants through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Fine Arts (Theatre) requires the successful completion of 300 credit points."
            ],
            "Compulsory subjects": {
                "overview": [
                    [
                        "250 credit points of Compulsory subjects\n",
                        [
                            [
                                "75 credit points of Level 1 Compulsory subjects",
                                "75 credit points of Level 2 Compulsory subjects",
                                "100 credit points of Level 3 Compulsory subjects"
                            ]
                        ]
                    ]
                ]
            },
            "Breadth": {
                "overview": [
                    [
                        "50 credit points of Breadth subjects\n",
                        [
                            [
                                "a minimum of 12.5 credit points of \n"
                            ]
                        ]
                    ]
                ]
            },
            "Progression Rules": {
                "overview": [
                    [
                        "Completion of CREA10002 Stories of Place in the first semester of study",
                        "Completion of all Level 1 Compulsory subjects before proceeding to the next year level's Compulsory subjects",
                        "Completion of all Level 2 Compulsory subjects before proceeding to the next year level's Compulsory subjects",
                        "Note: Compulsory subjects in this program have prerequisites. Refer to individual subject entries."
                    ]
                ]
            },
            "For students who commenced prior to 2021": {
                "overview": [
                    "For students who commenced the Bachelor of Fine Arts prior to 2021, please click the link below to view your course structure and subject options:",
                    "Link"
                ]
            },
            "Subject Options": {
                "overview": [],
                "Level 1 Compulsory subjects": {
                    "overview": [
                        [
                            "CREA10002"
                        ],
                        "Note: All students must take Stories of Place in their first semester of commencement in this course",
                        [
                            "DRAM10032",
                            "DRAM10033",
                            "DRAM10034",
                            "DRAM10035"
                        ],
                        "These subjects are co-delivered with the Bachelor of Fine Arts (Acting)."
                    ]
                },
                "Level 2 Compulsory subjects": {
                    "overview": [
                        [
                            "DRAM20032",
                            "DRAM20033",
                            "DRAM20034",
                            "DRAM20035"
                        ]
                    ]
                },
                "Level 3 Compulsory subjects": {
                    "overview": [
                        [
                            "DRAM30033",
                            "DRAM30034",
                            "DRAM30035",
                            "DRAM30036",
                            "DRAM30037",
                            "DRAM30038"
                        ]
                    ]
                }
            }
        },
        "Breadth requirements": {
            "overview": [
                "50 points of breadth subjects including at least 12.5 points at Level 2 or Level 3."
            ],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Fine Arts (Theatre)"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}