{
    "Course name": "Bachelor of Fine Arts (Music Theatre)",
    "Course code": "B-FAMUSTH",
    "Overview text": [
        "The Bachelor of Fine Arts (Music Theatre) is a three-year degree that equips graduates with the knowledge and artistic technical skills necessary to engage and thrive in the professional music theatre industry.",
        "The course offers immersive, integrated and experiential practice-based studio and performance studies in acting, voice, dance and music. Students will also have a choice of subjects that allow them to explore cross disciplinary studies, exposing them to multi-disciplinary knowledge and skills.",
        "Embedded in the cultural capital of Australia, students will learn from internationally recognised performers, teachers and industry professionals. Students will also have opportunities to work with visiting artists from Australia and abroad. As graduates, they will be equipped with the singing, dancing and acting skills to perform in a diverse range of contexts including professional music theatre, theatre, television, film and cabaret.",
        "In the first year, the students engage in foundational techniques to develop and strengthen their instrument (body and voice) enabling creative self-expression. In the second year, the students will use their instrument to engage in adjustments applied to style and character. Before entering the final year of study, students will have the unique opportunity to travel overseas or to involve themselves in a professional internship. The synthesis of these skills culminates in third year with multiple capstone experiences. These capstone experiences provide the opportunity to work with industry professionals to mount two full scale musicals and an industry showcase."
    ],
    "Overview table": {
        "Award title": "Bachelor of Fine Arts (Music Theatre)",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "075490A",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed one of:(a) the Victorian Certificate of Education including;VCE Units 3 and 4 either a study score of at least 25 in English/English Language/Literature or a study score of at least 30 in English as an Additional Language;(b) the International Baccalaureate Diploma including at least Grade 4 in English or English B (Standard Level or Higher Level);(c) a senior secondary program, foundation studies program or equivalent approved by Academic Board including appropriate English language studies.Applicants are also required to complete an audition, test, interview, workshop, portfolio or folio presentation, as prescribed by the Academic Board for the stream to which entry is sought.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance, and",
            "performance in an audition.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduate English language requirements must be met.",
            "Note. For applicants through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne."
        ],
        "Inherent requirements (core participation requirements)": [
            "TheBachelor of Fine Arts (Music Theatre)is designed to train highly skilled arts practitioners who can work independently or in ensemble across a wide range of careers and performance or production opportunities. The core participation requirements of this course are consistent with this objective.",
            "TheBachelor of Fine Arts (Music Theatre)is a physically and emotionally demanding program requiring candidates to actively participate in all scheduled classes. The majority of subjects in the course have continuous and progressive assessment throughout the study period.  A candidate for this course must possess abilities and skills in the following categories across all aspects of the course:",
            "Physical abilities\n\n",
            [
                [
                    "Observation",
                    "Hearing",
                    "Motor skills",
                    "Physical strength, agility and endurance",
                    "Vocal capability"
                ]
            ],
            "Ability to monitor and manage own health",
            "Communication skills",
            "Intellectual abilities",
            "Behavioural and social skills",
            "Observation",
            "Hearing",
            "Motor skills",
            "Physical strength, agility and endurance",
            "Vocal capability",
            "Physical abilities",
            "Observation",
            "Students must be able to observe and participate in classes, rehearsals and performance. They must be able to observe and follow technical instructions as delivered by teachers and others. Students must be aware of their surroundings and their position within spaces.",
            "Hearing",
            "Students must be able to hear and follow verbal instructions and auditory cues.  ",
            "Students must be able to accurately perceive time and tempo in music.",
            "Motor skills",
            "Students must possess gross and fine motor functions to be able to participate fully and independently in all classes.",
            "Physical strength, agility and endurance",
            "The physical demands of the course on students are high.  It is a requirement that students actively participate in all classes and all scheduled rehearsals. Classes include intensive physical training and performance. Active participation in classes requires sustained and repeat effort. Students must be able to safely participate in sustained cardiac and strength-based activity over a period of hours without risk to their health and wellbeing.",
            "Voice",
            "Students must have the capacity to produce clear tone throughout at least a 1.5 octave range.",
            "Communication Skills",
            "Students must be able to communicate effectively and respectfully, both verbally and in written form.",
            "Monitor and manage own health",
            "Students must be capable of identifying the potential risk of injury and take responsibility for their own safety and the safety of others whilst undertaking these activities.",
            "Intellectual Skills",
            "Students must possess a range of intellectual capacities, including",
            "\n\n",
            [
                [
                    "Critical self-reflection",
                    "Analysis",
                    "Complex problem-solving",
                    "The ability to draw linkages across diverse areas of learning and practice"
                ]
            ],
            "Critical self-reflection",
            "Analysis",
            "Complex problem-solving",
            "The ability to draw linkages across diverse areas of learning and practice",
            "Behavioural and Social Skills",
            "Students must possess the behavioural and social attributes that enable them to participate in a complex, group-based learning environment.",
            "Students are required to take responsibility for their own participation and learning.",
            "Students must be capable of working effectively both as individuals and team members.",
            "Since they also contribute to other students’ learning in a collaborative environment, they must possess interpersonal skills and an understanding of the needs of others. Assessment components may include collaborative tasks.",
            "Students must be capable of and committed to effectively working under direction and undertaking regular independent preparation and practice.",
            "Students must be reliable and dependable in meeting commitments for classes, rehearsals and performances.",
            "Students must behave in a respectful and collegial fashion with other students, academic, administrative and technical staff of the Faculty, members of industry and external bodies, and the community.",
            "Students must be mature, self-aware and have the emotional health necessary to utilise their intellectual and creative abilities fully, including skills in critical self-reflection.",
            "Students must be able to perform publicly and receive criticism and feedback publicly.",
            "Students must possess emotional resilience, as expected of performers within the profession.",
            "Students must be aware of their personal limitations, and be cognisant of when and where to seek assistance or professional advice and support.",
            "Attendance Requirements",
            "A minimum of 80% attendance at all classes and rehearsals is compulsory in the course. Teaching staff will take a roll to record attendance.",
            "Reasonable adjustments",
            "The University is dedicated to provide support to those with special requirements.",
            "https://services.unimelb.edu.au/student-equity/home",
            "The University of Melbourne is required by the Disability Discrimination Act 1992 (Cth), the Disability Standards for Education 2005 (Cth) and Equal Opportunity Act 2010 (Vic) to ensure that reasonable adjustments are made for students with disabilities.",
            "‘Reasonable adjustments’ are modifications or accommodations made by the University that assist a student with a disability to participate in their course or access University facilities on the same basis as someone without a disability. A reasonable adjustment might be an aid to vision or hearing, or allowing extra time for written examinations. The role of Student Equity and Disability Support (SEDS) is to support students with disabilities, including assisting in the negotiation of reasonable adjustments for students who have disabilities.",
            "Any such adjustments must be reasonable and cannot compromise the academic integrity of a course. Reasonable adjustments are provided to assist students to fulfil the core participation requirements, not as a substitute for those requirements",
            "With appropriate support and reasonable adjustments where possible, students must be able to meet the Core Participation Requirements in order to graduate from the Bachelor of Fine Arts course.",
            "In determining whether an adjustment is reasonable, the University will consider:",
            "The nature of the disability;",
            "The effect of the adjustment on the student’s ability to demonstrate the required learning outcomes and participate in the course;",
            "The effect of the adjustment on any other person, including other students and staff; and",
            "The cost and logistical impact of the adjustment.",
            "Students should note that a reasonable adjustment may include modification to assessment and providing additional support services, but the University cannot make an adjustment that would affect the academic integrity of the course or the safety of students or staff."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Fine Arts (Music Theatre) requires the successful completion of 300 credit points."
            ],
            "Compulsory subjects": {
                "overview": [
                    [
                        "237.5 credit points of Compulsory subjects\n",
                        [
                            [
                                "75 credit points of Level 1 Compulsory subjects",
                                "75 credit points of Level 2 Compulsory subjects",
                                "87.5 credit points of Level 3 Compulsory subjects"
                            ]
                        ]
                    ]
                ]
            },
            "Electives": {
                "overview": [
                    [
                        "12.5 credit points of Level 3 electives"
                    ]
                ]
            },
            "Breadth": {
                "overview": [
                    [
                        "50 credit points of Breadth subjects\n",
                        [
                            [
                                "a minimum of 12.5 credit points of \n"
                            ]
                        ]
                    ]
                ]
            },
            "Progression Rules": {
                "overview": [
                    [
                        "Completion of CREA10002 Stories of Place in the first semester of study",
                        "Completion of all Level 1 Compulsory subjects before proceeding to the next year level's Compulsory subjects",
                        "Completion of all Level 2 Compulsory subjects before proceeding to the next year level's Compulsory subjects",
                        "Note: Compulsory subjects in this program have prerequisites. Refer to individual subject entries."
                    ]
                ]
            },
            "For students who commenced prior to 2021": {
                "overview": [
                    "For students who commenced the Bachelor of Fine Arts prior to 2021, please click the link below to view your course structure and subject options:",
                    "Link"
                ]
            },
            "Subject Options": {
                "overview": [],
                "Level 1 Compulsory subjects": {
                    "overview": [
                        [
                            "CREA10002"
                        ],
                        "Note: All students must take Stories of Place in their first semester of commencement in this course",
                        [
                            "MUST10013",
                            "MUST10014",
                            "MUST10015",
                            "MUST10016"
                        ]
                    ]
                },
                "Level 2 Compulsory subjects": {
                    "overview": [
                        [
                            "MUST20012",
                            "MUST20013",
                            "MUST20014",
                            "MUST20015"
                        ]
                    ]
                },
                "Level 3 Compulsory subjects": {
                    "overview": [
                        [
                            "MUST30014",
                            "MUST30015",
                            "MUST30016",
                            "MUST30017",
                            "MUST30018"
                        ]
                    ]
                },
                "Level 3 electives": {
                    "overview": [
                        [
                            "MUST30011",
                            "MUST30013",
                            "MUST30019"
                        ]
                    ]
                }
            }
        },
        "Breadth requirements": {
            "overview": [
                "50 points of breadth subjects including at least 12.5 points at Level 2 or Level 3."
            ],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Fine Arts (Music Theatre)"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}