{
    "Course name": "Bachelor of Environments",
    "Course code": "B-ENVS",
    "Overview text": [
        "THERE IS NO  FURTHER ENTRY INTO THIS COURSE.",
        "THE COURSE STRUCTURE BELOW ONLY APPLIES TO RE-ENROLLING STUDENTS WHO COMMENCED THEIR STUDIES PRIOR TO 2016",
        "The Bachelor of Environments is an innovative initiative from the University of Melbourne. It provides students with the skills needed to be creative thinkers and to solve twenty-first century problems. The degree brings together expertise from a range of discipline areas across the University to provide leadership in the study of the built, natural, social and virtual environments, and is unique within Australia. This three year degree will give students a broad understanding across diverse environments, whilst providing them with the opportunity to focus on an area of specialisation of their choosing.",
        "The foundation of the degree is the inter-disciplinary nature of real-world projects, where professionals work together to bring projects to fruition. Only through innovative and integrated thinking that is an integral part of the Bachelor of Environments, will current challenges like sustainable urban growth and protection of threatened natural resources become attainable. Graduates of the Bachelor of Environments will be able to think about the environment beyond the short term, and play an active role in maintaining, imagining, designing and constructing sustainable areas in which to live, work and visit."
    ],
    "Overview table": {
        "Award title": "Bachelor of Environments",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "058839G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time or 72 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "THERE IS NO FURTHER ENTRY INTO THIS COURSE.",
            "1. In order to be considered for entry, applicants must have completed: one of",
            "the Victorian Certificate of Education including VCE Units 3 and 4 – either a study score of at least 25 in one of English, English Language or Literature or a study score of at least 30 in English as an Additional Language;",
            "the International Baccalaureate Diploma including at least Grade 4 in English or English B (Standard Level or Higher Level);",
            "a senior secondary program, foundation studies program or equivalent approved by the Academic Board including appropriate English language studies.",
            "Except for applicants eligible for Access Melbourne,minimum ATAR or equivalent overall performance rankings apply.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduateEnglish language requirementsmust be met.",
            "Notes.",
            "For applications through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne.",
            "Mathematical knowledge equivalent to VCE Mathematical Methods (CAS) Units 3 and 4 with a study score of 25 or more is required for the following majors: Construction, Engineering Systems, Property, Spatial Systems, and Environmental Science. Students intending to pursue one of these majors should take VCE Mathematical Methods (CAS) Units 3 and 4 or an equivalent subject. A bridging subject will be available for students who have done VCE Mathematical Methods Units 1 and 2 but not VCE Mathematical Methods Units 3 and 4 or students who have received a study score below 25 in VCE Mathematical Methods Units 3 and 4."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Bachelor of Environments welcomes applications from students with disabilities. It is the University and Custodial Faculty (Architecture, Building and Planning) policy to take reasonable steps to make reasonable adjustments so as to enable the student’s participation in the Bachelor of Environments (BEnv).",
            "The Bachelor of Environments provides students with a broad understanding of the issues and challenges that shape diverse environments, whilst also providing the opportunity to focus on an area of specialisation of your choosing. Graduates will have the ability to consider the environment beyond the short term, and play an active role in understanding the existing environments and maintaining, designing and constructing sustainable areas in which to live, work and visit.",
            "A candidate for the Bachelor of Environments degree must have abilities and skills which include the following: observation; communication; motor; conceptual, integrative, and quantitative; and behavioural and social. Adjustments can be provided to minimise the impact of a disability, however students need to be able to participate in the program in an independent manner and with regard to their safety and the safety of others.",
            "1. \nObservation: A candidate must be able to read text, diagrams, maps, drawings and numerical data. The candidate should be able to observe details at a number of scales and record useful observations of environmental contexts.",
            "2. \nCommunication: A candidate should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. A candidate must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.",
            "3. \nMotor: Candidates should have sufficient motor function to elicit information from environmental contexts. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments. Candidates should have sufficient motor ability to prepare documentation of analytic texts, drawings and models of findings and for the preparation of proposals for environmental interventions via digital or other means. A candidate should have the ability to actively participate in appropriate site and/or design studio‐based activities.",
            "4. \nIntellectual‐Conceptual, Integrative and Quantitative Abilities: These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, the candidate should be able to comprehend three‐dimensional relationships and to understand the spatial relationships of structures.",
            "5. \nBehavioural and Social Attributes: A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel their disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Architecture major",
            "The Bachelor of Environments Architecture major provides a pathway into the Master of Architecture. The Master of Architecture program is recognised and accredited by the Australian Institute of Architects (AIA), the Architects Accreditation Council of Australia (AACA) and the Architects Registration Board of Victoria (ARBV).",
            "Construction major",
            "The Australian Institute of Building (AIB) has accredited the Bachelor of Environments Construction major as a qualification for AIB Associate membership.",
            "The Bachelor of Environments Construction major provides a pathway into the Master of Construction Management. It is expected that graduates of the Master of Construction Management will have completed the academic requirements for corporate membership of:",
            "Australian Institute of Building (AIB) Australian Institute of Quantity Surveyors (AIQS) Royal Institution of Chartered Surveyors (RICS)",
            "Landscape Architecture major",
            "The Bachelor of Environments Landscape Architecture major provides a pathway into the Master of Landscape Architecture. The Master of Landscape Architecture program is recognised and accredited by the Australian Institute of Landscape Architects (AILA).",
            "Property major",
            "The Bachelor of Environments Property major provides a pathway into the Master of Property. It is expected that graduates of the Master of Property will have completed the academic requirements for membership of: Australian Property Institute (API) Royal Institution of Chartered Surveyors (RICS)",
            "Urban Design and Planing major",
            "The Bachelor of Environments Urban Design and Planning major provides a pathway into either the Master of Urban Design or the Master of Urban Planning. It is expected that graduates of either the Master of Urban Design or the Master of Urban Planning will have completed the academic requirements for membership of the Planning Institute of Australia (PIA)."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Course Rules:",
                "The Bachelor of Environments requires the successful completion of 300 points comprising:",
                [
                    "225 points of Environments discipline subjects including:"
                ],
                [
                    "\n\n\n\n",
                    [
                        [
                            "At least 75 points at Level 1"
                        ],
                        [
                            "At least 62.5 points at Level 2"
                        ],
                        [
                            "At least 62.5 points at Level 3"
                        ]
                    ]
                ],
                [
                    "50 points of breadth including:"
                ],
                [
                    "\n\n",
                    [
                        [
                            "At least 12.5 points at Level 2 or 3 (and no more than 37.5 points at Level 1)"
                        ]
                    ]
                ],
                [
                    "25 points of free subjects at Levels 1 to 3"
                ],
                "Note: No more than 125 points may be taken at Level 1 within the B-ENVS.",
                "Breadth requirementsBachelor of Environments students must complete between 50 and 75 credit points of subjects selected from those available as breadth for Bachelor of Environments students; with no more than 37.5 points at Level 1. For a complete listing of available subjects please click the'Find breadth subjects'link on the Handbook homepage and perform a search. The breadth requirements for the Bachelor of Environments include the restriction of some subjects as breadth options, depending on an individual student’s choice of major. Subjects in the Handbook that are marked as available as breadth in the Bachelor of Environments may be subject to further restrictions, depending upon which major a student is completing in that course. Detailed information on these Restrictions for Breadth Options please check the 2016 handbook, also can be found under course structure for each major.Major RequirementsStudents must complete between 100 and 112.5 points to satisfy the requirements of a Bachelor of Environments major sequence.Additional RequirementsStudents must complete a minimum of 37.5 points and a maximum of 75 points selected from Bachelor of Environments elective subjects.ProgressionStudents must normally complete 50 points of study at one year‐level before proceeding to the next year‐level."
            ]
        },
        "Subject options": {
            "overview": [
                "First Year Course Structure :",
                "The first year of the Bachelor of Environments will provide a foundation for these strands of the learning experience.",
                "Core subjects: These subjects are compulsory. These subjects will introduce them to natural environmental processes and systems and the socio-cultural context in which these occur.",
                "Environments Electives: Students can choose from this list. These subjects will introduce them to other aspects of environments, including their design, planning, production and management, from a range of disciplinary perspectives. Some of these subjects are compulsory for specific majors.",
                "Enabling Electives: Students can choose from this list. These subjects will allow students to meet the requirements in order to achieve accreditation or to meet prerequisites for subjects within their chosen major. Some of these subjects are compulsory for specific majors.",
                "Breadth Subjects: Students can choose from this list. Find out more about breadth subjects below.",
                "The first year subjects, and some second year subjects can be taken by students interested in different discipline areas which can assist them in determining their major. Students will be able to interact and share their ideas to solve real-world problems; learn to work effectively in groups and appreciate the value of collaboration and different perspectives. Thus building a strong foundation for graduates to interact with a wide range of professionals from multiple disciplines.",
                "IMPORTANT: Please refer to your major of choice to ensure you complete the necessary first year prerequisite subjects."
            ]
        },
        "Level 1 Core subjects (12.5 points)": {
            "overview": [
                "Enrol into the subject below",
                [
                    "ENVS10012"
                ]
            ]
        },
        "Level 1 Environments & Enabling Electives ( 62.5 points)": {
            "overview": [
                "Enabling Electives",
                "Choose 25 points from the list below.",
                "IMPORTANT: Please consider the major you intend to take when choosing these subjects as they may be compulsory for specific majors.",
                [
                    "ENVS10001",
                    "ENVS10002",
                    "ENVS10003",
                    "ENVS10004",
                    "ENVS10005",
                    "ENVS10006",
                    "ENVS10007",
                    "ECON10003",
                    "ECON10004",
                    "ACCT10001",
                    "MAST10005",
                    "MAST10006",
                    "MAST10007",
                    "MAST10010",
                    "BLAW10001",
                    "CHEM10007",
                    "CHEM10003",
                    "CHEM10004",
                    "ERTH10001",
                    "ABPL10003",
                    "ABPL10004",
                    "ABPL10005",
                    "ABPL10006",
                    "ERTH10002",
                    "GEOG10001",
                    "ENVS10010",
                    "ENVS10011"
                ],
                "Environments Electives",
                "Choose 37.5 points from the list below.",
                "IMPORTANT: Please consider the major you intend to take when choosing these subjects as they may be compulsory for specific majors.",
                [
                    "ENVS10001",
                    "ENVS10002",
                    "ENVS10003",
                    "ENVS10004",
                    "ENVS10005",
                    "ENVS10006",
                    "ENVS10007",
                    "ABPL10003",
                    "ABPL10006",
                    "ABPL10004",
                    "ABPL10005",
                    "ENVS10010",
                    "ENVS10011",
                    "ENGR10005",
                    "ARCH10001",
                    "LARC10001",
                    "PROP10001"
                ],
                "Note:Students who have not completed ENVS10004, where it is required for their major,may take ARCH10003"
            ]
        },
        "Breadth Subjects (25 points)": {
            "overview": [
                "For information on breadth subjects and for a complete listing, please see:http://breadth.unimelb.edu.au/breadth/info/index.html",
                "Note: Please refer to your major of choice to ensure you complete the necessary breadth subjects which may be required for professional accreditation."
            ]
        },
        "Breadth requirements": {
            "overview": [],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Environments"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates of the Bachelor of Environments will have the opportunity to continue their study through a number of pathways and dependent on their chosen field may be able to enrol in an honours year, a professional masters or a research higher degree in an area related to your undergraduate study area. In addition to this, the University offers a range of new graduate-entry only programs, available to graduates of any 3-year Bachelor degree.",
        "Professional Masters degrees are available in:",
        [],
        "Graduate study will provide students with the opportunity to investigate a research project of your interest, further develop your project management and problem solving skills, and in some cases gain national and international professional recognition in your field. For admission requirements to these Professional Masters programs please refer to the handbook entry for each or contact the relevant faculty or school for further information."
    ]
}