{
    "Course name": "Bachelor of Fine Arts (Production)",
    "Course code": "B-FAPRO",
    "Overview text": [
        "The Bachelor of Fine Arts (Production) is a three-year full-time degree that offers studies in the creation and production of live performance. Students are able to specialise in the areas of Design, Stage Management, Set and Props, Costume, Lighting, Digital Media and Projection, and Sound. Theoretical knowledge and practical skills are developed through an immersive and practical curriculum in studio and production environments.",
        "The course incorporates broad foundation training in live production processes. Students cultivate their skills in their chosen specialisations as they progress through the course, integrating conceptual and technical skills within studio-based environments.",
        "Students are involved in sustained exploration and experimentation through collaborations on Victorian College of the Arts (VCA) Theatre, Dance and Music Theatre productions. Students undertake design, technical and management roles, increasing in responsibility and endeavour as they advance through the course. This environment provides students with a unique opportunity to develop interdisciplinary collaboration skills with peer and professional theatre makers.",
        "The course is delivered and supported by Academic staff and mentors with contemporary industry practice. As a way of furthering their understanding of the industry and developing their own professional network, all students are required to complete an industry internship in their final year with a professional company or individual practitioner. The course promotes sustainable independent practice to optimally position students to forge strong career pathways in national and international performing arts industries."
    ],
    "Overview table": {
        "Award title": "Bachelor of Fine Arts (Production)",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "093586K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed one of:",
            "1. the Victorian Certificate of Education including; VCE Units 3 and 4 either a study score of at least 25 in English/English Language/Literature or a study score of at least 30 in English as an Additional Language;",
            "2. the International Baccalaureate Diploma including at least Grade 4 in English or English B (Standard Level or Higher Level);",
            "3. a senior secondary program, foundation studies program or equivalent approved by Academic Board including appropriate English language studies.",
            "Applicants are also required to complete an audition, test, interview, workshop, portfolio or folio presentation, as prescribed by the Academic Board for the stream to which entry is sought.Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance, and",
            "performance in an interview, workshop, portfolio or folio presentation.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduate English language requirements must be met.",
            "Note. For applicants through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Fine Arts (Production) requires the successful completion of 300 credit points."
            ],
            "Compulsory subjects": {
                "overview": [
                    [
                        "237.5 credit points of Compulsory subjects including\n75 credit points of Level 1 Compulsory subjects\n75 credit points of Level 2 Compulsory subjects\n87.5 credit points of Level 3 Compulsory subjects\n\n",
                        "75 credit points of Level 1 Compulsory subjects",
                        "75 credit points of Level 2 Compulsory subjects",
                        "87.5 credit points of Level 3 Compulsory subjects"
                    ],
                    [
                        "75 credit points of Level 1 Compulsory subjects",
                        "75 credit points of Level 2 Compulsory subjects",
                        "87.5 credit points of Level 3 Compulsory subjects"
                    ]
                ]
            },
            "Electives": {
                "overview": [
                    [
                        "12.5 credit points of Production Electives"
                    ]
                ]
            },
            "Breadth": {
                "overview": [
                    [
                        "50 credit points of Breadth subjectsA minimum of 12.5 credit points of Level 2 or Level 3 breadth subjects\n\n",
                        "A minimum of 12.5 credit points of Level 2 or Level 3 breadth subjects\n"
                    ],
                    [
                        "A minimum of 12.5 credit points of Level 2 or Level 3 breadth subjects\n"
                    ]
                ]
            },
            "Progression Rules": {
                "overview": [
                    [
                        "Completion of CREA10002 Stories of Place in the first semester of study",
                        "Completion of all Level 1 Compulsory subjects before proceeding to the next year level's Compulsory subjects",
                        "Completion of all Level 2 Compulsory subjects before proceeding to the next year level's Compulsory subjects",
                        "Note: Compulsory subjects in this program have prerequisites. Refer to individual subject entries."
                    ]
                ]
            },
            "For students who commenced prior to 2021": {
                "overview": [
                    "**This information only applies to students who commenced the Bachelor of Fine Arts (Design and Production) in 2019 and 2020**",
                    "In 2021, the University introduced an updated Bachelor of Fine Arts (BFA) curriculum, in which - in addition to practical studio-based classes with a structured program of high-level skills training and theoretical subjects in your chosen discipline - commencing students will be required to undertake Breadth studies in subjects from outside their core discipline.",
                    "Students who commenced the Bachelor of Fine Arts prior to 2021 will transition into the new core curriculum in 2021.",
                    "Students who commenced the Bachelor of Fine Arts prior to 2021 can view Sample Study Plans with subject options at the link below:",
                    "https://finearts-music.unimelb.edu.au/current-students/course-planning/bfa-curriculum-update"
                ]
            },
            "Subject Options": {
                "overview": [],
                "Level 1 Compulsory subjects": {
                    "overview": [
                        [
                            "CREA10002"
                        ],
                        "Note: All students must take Stories of Place in their first semester of commencement in this course",
                        [
                            "DPSS10008",
                            "DPSS10009",
                            "DPSS10010",
                            "DPSS10005"
                        ]
                    ]
                },
                "Level 2 Compulsory subjects": {
                    "overview": [
                        [
                            "DPSS20010",
                            "DPSS20011",
                            "DPSS20012",
                            "DPSS20013"
                        ]
                    ]
                },
                "Level 3 Compulsory subjects": {
                    "overview": [
                        [
                            "DPSS30010",
                            "DPSS30008",
                            "DPSS30009"
                        ],
                        "Note:",
                        "Production Practice 3 requires two consecutive study periods of enrolment. Students commence Production Practice 3 - Part A and must continue Production Practice 3 - Part B in the following study period. Upon successful completion of the Production Practice 3 - Part A and Part B, students will receive 75 credit points."
                    ]
                },
                "Production Electives": {
                    "overview": [
                        [
                            "DPSS10007",
                            "DPSS20009",
                            "THTR20043",
                            "DPSS30007",
                            "DPSS30011",
                            "THTR30042"
                        ],
                        "Note:",
                        "Level 3 subjects are recommended"
                    ]
                }
            }
        },
        "Breadth requirements": {
            "overview": [
                "50 points of breadth subjects including at least 12.5 points at Level 2 or Level 3."
            ],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Fine Arts (Production)"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}