{
    "Course name": "Bachelor of Commerce (Degree with Honours)",
    "Course code": "BH-COM",
    "Overview text": [
        "The Honours year is an additional (fourth) year of specialised study in one of the following disciplines: accounting, actuarial studies, economics or finance. It is an integrated program with small classes and an emphasis on research and specialised subject areas.",
        "The Honours year is open to Commerce students. Prospective applicants should note that students must commence the Honours year within two years of completing the requirements of the commerce course. Graduates of other institutions are also welcome to apply. Honours is normally taken on a full-time basis immediately after finishing the requirements for the three-year commerce degree. Provision exists for deferred entry in exceptional circumstances.",
        "Chancellor's Scholars who are admitted into the University of Melbourne's Bachelor of Commerce under a guaranteed entry pathway to a professional entry graduate course, such as the Juris Doctor, can undertake an Honours year and not jeopardise their guaranteed entry into their chosen graduate course.",
        "The Honours degree is an entry qualification for a Masters degree and a PhD within Australia or overseas. A good Honours degree also assists students in obtaining scholarships or other forms of financial support to undertake higher degrees. Career advancement has also tended to be more rapid for Honours graduates.",
        "Last updated: 3 July 2024"
    ],
    "Overview table": {
        "Award title": "Bachelor of Commerce (Degree with Honours)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "014798G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "Within the last two years a Bachelor of Commerce or equivalent with a weighted average mark (WAM) of at least H2B (70%), or equivalent, with a major relevant to the discipline stream within the Bachelor of Commerce (Degree with Honours) that they seek to enter (see below).",
            "Any application requirements, specific subject prerequisites and prior academic performance requirements associated with the discipline stream that they seek to enter. These are outlined in the schedule below.",
            "Meeting these requirements does not guarantee selection.",
            "1. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the availability of supervision and resources in suitable project areas; and where applicable",
            "the application requirements associated with the discipline stream.",
            "1. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "2. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduate English language requirements must be met.",
            "The schedule below shows available discipline streams and additional conditions applicants must meet to be eligible for (but not automatically guaranteed) selection into Honours within that stream.",
            "Accounting:a grade of at least H2B (70%) in each of the third-year subjects within the major, and successful completion of one of BUSA20001 Visualisation and Data Wrangling; or ECOM30002 Econometrics 2; or equivalent studies in data analytics.",
            "Actuarial Studies:a grade of at least H2B (70%) in any four third-year actuarial subjects.",
            "Economics:a grade of at least H2B (70%) in each of the following third-year subjects or their equivalent: Macroeconomics, Microeconomics and Econometrics 2. A one-page description of a potential research area must also be submitted as part of the application process.",
            "Finance:a grade of at least H2B (70%) in each of the third-year subjects within the major, and successful completion of Econometrics 2.",
            "Students who have reached the required standard should lodge a formal online application.",
            "Graduates of other institutions are also welcome to apply but will need to provide an original or certified copy of their transcript/s and syllabi of subjects needed to meet eligibility requirements with their application. More information about how to apply can be viewed at the Honours website.",
            "Additional discipline specific information:",
            "Accounting",
            "The Bachelor of Commerce (Degree with Honours) is usually offered for full-time, Semester 1 entry only. Part-time honours may be offered to suitable candidates who meet the criteria for appointment to Senior Tutor within the Department of Accounting. These are subject to the approval of the Head of Department.",
            "Selection into Honours is at the discretion of the Head of the Department of Accounting.",
            "Actuarial Studies",
            "Selection into Honours is at the discretion of the Director of the Centre for Actuarial Studies.",
            "Economics",
            "Students are strongly advised to give early consideration to a topic for their fourth year research essay. They will need to obtain approval for it from an advisor during Semester 1 of their fourth year.",
            "Selection into Honours is at the discretion of the Head of the Department of Economics. Students should note that a quota will be applied to the number of places available for Honours in economics.",
            "Finance",
            "Selection into Honours is at the discretion of the Head of the Department of Finance. Students should note that a quota will be applied to the number of places available for Honours in finance."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Course Description, Course Objectives and Generic Skills for this entry.",
            "The University is dedicated to provide support to those with special requirements. Further details on the disability support scheme can be found atStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The BCom (Honours) course consists of the equivalent of eight subjects (100 points). Grades are awarded for each individual subject and an overall grade result is returned for the course. The Honours degree is only awarded to students who pass (i.e. obtain a grade of at least P) all subjects of the course and who complete the course with an average grade of H3 (65%) or higher.",
                "Students are required to complete the equivalent of eight subjects. In determining the final grade, individual subjects are weighted according to their points value.",
                "A student will not be awarded honours if the student either:",
                [
                    "fails a single 12.5-point subject with a mark below 40%, or",
                    "fails two or more 12.5-point subjects (a 25-point subject is treated as two subjects)."
                ],
                "Any student who fails two subjects in their first semester of study will not be allowed to continue in the Honours course.",
                "Any student who fails a single 12.5-point subject with a mark of 40% or above will be entitled to a Final Subject Assessment (FSA) at the end of the final teaching period for that student. The maximum mark to be awarded for this subject on satisfactory completion of this assessment is 50%. The final grade for such a student will be based on the weighted average of the passing grades only.",
                "Students who do not meet the requirements to be awarded the Honours degree will still be able to take out the Bachelor of Commerce pass degree if previous commerce studies were undertaken at the University of Melbourne."
            ]
        },
        "Accounting": {
            "overview": [
                "Students are required to complete the equivalent of eight subjects (100 points) in fourth year Honours.",
                "Students must take two compulsory subjects (Research Methods subject and a Research Essay subject):",
                [
                    "ACCT40004"
                ],
                "and either",
                [
                    "ACCT40006"
                ],
                "or both of",
                [
                    "ACCT40008",
                    "ACCT40009"
                ],
                "Students must also take two elective subjects from the below list:",
                [
                    "ACCT40001",
                    "ACCT40002",
                    "ACCT40003",
                    "ACCT40007",
                    "ACCT40010"
                ],
                "(If students would like to take more than two subjects from this list, the additional subjects can be taken under the remaining elective component discussed below).",
                "The remaining elective subjects must be approved by the Head of Department of Accounting to meet the overall load of 100 points."
            ]
        },
        "Actuarial Studies": {
            "overview": [
                "Students are required to successfully complete the equivalent of eight subjects (100 points) in fourth year Honours.",
                "Students must complete the following subjects:",
                [
                    "ACTL40001"
                ],
                "or both of",
                [
                    "ACTL40010",
                    "ACTL40011"
                ],
                "and",
                [
                    "50 points of Level-4 actuarial studies subjects",
                    "25 points of approved Level-3 or Level-4 subjects taught within or outside the Faculty of Business and Economics"
                ]
            ]
        },
        "Economics": {
            "overview": [
                "Students are required to successfully complete the equivalent of eight subjects (100 points) in fourth year Honours.",
                "Students must complete the following subjects:",
                [
                    "ECON40001",
                    "ECON40002",
                    "ECOM40006",
                    "ECON40018",
                    "ECON40019"
                ],
                "and three other subjects, normally Level-4 economics subjects.",
                "Under special circumstances and with the Honours convenor's approval, students may include at most two Level-3 subjects in their study plan, only one of these subjects can be selected from those taught within the Faculty.",
                "Students who take ECON40015 cannot include ECON30024 in their final Honours year program."
            ]
        },
        "Finance": {
            "overview": [
                "Students are required to successfully complete the equivalent of eight subjects (100 points).",
                "Students must complete the following subjects:",
                [
                    "FNCE40001",
                    "FNCE40002",
                    "FNCE40004",
                    "FNCE40006"
                ],
                "and",
                [
                    "12.5 points of other subjects taught by the Department of Finance",
                    "25 points of subjects taught within or outside the Faculty of Business and Economics as approved by the Head of the Department of Finance"
                ],
                "Level-3 subjects may not be taken."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}