{
    "Course name": "Bachelor of Environments (Degree with Honours)",
    "Course code": "BH-ENVS",
    "Overview text": [
        "The Bachelor of Environments (Honours) provides an advanced, specialised year of study that follows completion of the requirements of the Bachelor of Environments. It extends a student’s knowledge and skills through a supervised research project together with advanced coursework in related areas of study. The Bachelor of Environments (Honours) can be taken in two different programs: Landscape Management or Environmental Geography.",
        "The Bachelor of Environments (Honours) provides students with the opportunity to integrate their previous studies and focus their knowledge, skills and intellect on an exciting piece of original research.",
        "Last updated: 13 September 2024"
    ],
    "Overview table": {
        "Award title": "Bachelor of Environments (Degree with Honours)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "073112K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "either within the last 10 years a University of Melbourne Bachelor of Environments with a weighted average mark of at least H3 (70%), with a major relevant to the discipline stream within the Bachelor of Environments (Degree with Honours) that they seek to enter,",
            "or",
            "within the last 10 years an undergraduate degree with a weighted average mark of at least H3 (70%), including studies in Landscape Management or Environmental Geography and with a major relevant to the discipline stream within the Bachelor of Environments (Degree with Honours) that they seek to enter.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance, and",
            "the availability of supervision and resources in suitable project areas.",
            "Quotas may be applied to the degree as a whole or to individual discipline streams and preference may be given to applicants with evidence of appropriate preparation or potential to undertake research.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduate English language requirements [link] must be met."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Bachelor of Environments (Honours) welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree.The Bachelor of Environments (Honours) requires all students to enrol in subjects where they will require:",
            "1. the ability to comprehend complex concepts;2. the ability to clearly and independently communicate knowledge and the application of relevant principles and practices during assessment tasks;",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "There may be additional inherent academic requirements for some subjects, and these requirements are listed within the description of the requirements for each of these subjects.",
            "It is the University policy to take all steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the university’s programs. Students who feel their disability will impact on meeting the requirements in this course are encouraged to discuss this matter with the Subject Coordinator and Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "There are two specialisations in the Bachelor of Environments (Honours):",
                [
                    "Landscape Management; and",
                    "Environmental Geography."
                ],
                "Additional information about these specialisations are detailed below."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The opportunity to specialise during the honours year provides a strong foundation for the future direction of graduates. Graduates may progress to higher degree research in the sciences at the master’s or doctorate level. They are also eligible to progress to a range of graduate coursework programs."
    ]
}