{
    "Course name": "Bachelor of Science Advanced (Honours)",
    "Course code": "BH-SCIADV",
    "Overview text": [
        "The Bachelor of Science Advanced (Hons) is a four-year program that integrates the four major disciplines of science (mathematics, physics, chemistry and biology) into a common unified curriculum for two years, followed by a diverse choice of majors from science, technology, engineering and health sciences and an advanced specialised year of study which includes a minor research thesis.",
        "Students will be equipped with a range of knowledge and skills to enhance and extend their science studies. The degree will provide flexible pathways to employment, research higher degrees and many professional postgraduate programs."
    ],
    "Overview table": {
        "Award title": "Bachelor of Science Advanced (Honours)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "112780B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "8",
        "Credit points": "400 credit points",
        "Duration": "48 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "In order to be considered for entry, applicants must have completed:",
            "Mathematics, Chemistry and Physics at Year 12 (standard level India) and be selected for entry into the BSc (Blended)",
            "In order to progress to UoM, applicants must have completed:",
            "First 200 points of BSc (Blended) with an equivalent WAM of at least 70.",
            "The undergraduate English language requirements."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Bachelor of Science Advanced (Honours) welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree.",
            "The Bachelor of Science Advanced (Honours) requires all students to enrol in subjects where they will require:",
            "1. the ability to comprehend complex science, technology and/or engineering systems related information;",
            "2. the ability to clearly and independently communicate a knowledge and application of science, technology and engineering systems principles and practices during assessment tasks; and in some areas of study",
            "3. the ability to actively and safely contribute in clinical, laboratory, and fieldwork/excursion activities.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. There are additional inherent academic requirements for some major studies and subjects, and these requirements are listed within the description of the requirements for each of these majors and subjects.",
            "Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the relevant Subject Coordinator and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/",
            "Major‐specific core participation requirements",
            "Agricultural Science Major Specific Core Participation requirements:Fieldwork and Practicals. The sites essential to this fieldwork are not wheelchair accessible and require students to traverse broken ground. Visual observation and interpretation of the sites is also an essential component, as is specimen and microscope work.",
            "Veterinary Bioscience Major Specific Core Participation requirements:Practical classes. This major requires all students to actively, independently and safely participate in all practical classes, utilising a range of observational, communication, motor, intellectual, and behavioural and social skills. Visual acuity, muscle coordination, balance, and sensory tactile perception are essential for participation. Details of the participation requirements can be found athttps://handbook.unimelb.edu.au/view/current/MC-DVETMED",
            "Animal Health and Disease Major Specific Core Participation requirements:Practical classes. This major requires all students to actively, independently and safely participate in all practical classes, utilising a range of observational, communication, motor, intellectual, and behavioural and social skills. Visual acuity, muscle coordination and balance are essential for participation.",
            "Animal Science and Management Major Specific Core Participation requirements:Fieldwork, practicals and laboratory experiments. The sites essential to this fieldwork are not wheel chair accessible and may require students to traverse broken ground. Students are also required to undertake experiments including specimen and microscope work with assessment reliant on careful observation and visual interpretation of results. Practicals may also involve handling and working with animals.",
            "Chemical Systems Specific Core Participation requirements:Laboratory experiments. This major requires students to undertake experiments using specialist software with assessment reliant on careful observation and visual interpretation of results.",
            "Ecology and Evolutionary Biology Major Specific Core Participation requirements:Fieldwork. The sites essential to this fieldwork are not wheelchair accessible and require students to traverse broken ground. Visual observation and interpretation of the sites is also an essential component.",
            "Food Science Major Specific Core Participation requirements:Laboratory experiments. This major requires students to undertake experiments using specialist software with assessment reliant on careful observation and visual interpretation of results.",
            "Geology Major Specific Core Participation requirements:Fieldwork. The sites essential to this fieldwork are not wheelchair accessible and require students to traverse broken ground. Visual observation and interpretation of the sites is also an essential component, as is specimen and microscope work."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Science Advanced (Honours) requires the successful completion of 400 credit points.",
                "Year 1 requirements:",
                [
                    "100 credit points of Year 1 compulsory  subjects"
                ],
                "Year 2 requirements:",
                [
                    "75 credit points of Year 2 compulsory subjects",
                    "25 credit points of \n"
                ],
                "Year 3 requirements:",
                [
                    "50 credit points of subjects in the chosen major",
                    "25 credit points of Year 3 elective subjects",
                    "25 credit points of  \n"
                ],
                "Year 4 requirements:",
                [
                    "25 credit points of research project capstone subject",
                    "75 credit points of Year 4 elective subjects including\n",
                    [
                        [
                            "A minimum of 50 credit points of Year 4 Level 9 elective subjects",
                            "A maximum of 25 credit points of Year 4 (Level 3) science elective subjects at course coordinator approval"
                        ]
                    ]
                ]
            ],
            "Additional rules": {
                "overview": [
                    [
                        "Students entering this course via the Bachelor of Science (Blended) pathway from a partner institute in India may receive up to 200 points of advanced standing towards Year 1 and Year 2 subjects.",
                        "Completion of one major in Year 3 is required."
                    ]
                ]
            },
            "Subject Options": {
                "overview": []
            },
            "Year 1": {
                "overview": [
                    "Year 1 compulsory  subjects"
                ],
                "": {
                    "overview": [
                        [
                            "MAST10007",
                            "MAST10006",
                            "PHYC10003",
                            "PHYC10004",
                            "CHEM10003",
                            "CHEM10004",
                            "BIOL10009",
                            "BIOL10011"
                        ],
                        "Year 2",
                        "Year 2 compulsory subjects",
                        [
                            "MAST20009",
                            "MAST20006",
                            "PHYC20012",
                            "PHYC20015",
                            "CHEM20018",
                            "CHEM20020"
                        ],
                        "Students must also complete 25 credit points of Level 1 Breadth subjects.",
                        "Year 3",
                        "Student must complete one major offered in the course.",
                        "Year 3 elective subjects",
                        [
                            "ATOC30003",
                            "ATOC30004",
                            "ATOC30006",
                            "ATOC30008",
                            "CHEM30012",
                            "CHEM30015",
                            "CHEM30016",
                            "CHEM30017",
                            "EVSC30003",
                            "GEOG30019",
                            "GEOG30021",
                            "CHEM30014"
                        ],
                        "Students must also complete 25 credit points of Level 2 and/or 3 Breadth subjects.",
                        "Year 4",
                        "Compulsory science research capstone subject",
                        [
                            "SCIE40002"
                        ],
                        "Students must complete between 50 and 75 credit points of the following Level 9 elective subjects:",
                        [
                            "ATOC90002",
                            "ATOC90011",
                            "ATOC90015",
                            "ATOC90016",
                            "ATOC90017",
                            "ENST90004",
                            "ENST90033",
                            "ENST90034",
                            "ERTH90026",
                            "EVSC90017"
                        ],
                        "Students can also complete a maximum of 25 credit points of the Level 3 science elective subjects at course coordinator approval.",
                        "Find breadth subjects",
                        "Use the Handbook Search function to find breadth subjects that can be used as breadth studies in the Bachelor of Science Advanced (Honours) program:",
                        "Science breadth subjects"
                    ]
                }
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The Bachelor of Science Advanced (Honours) degree provides pathways to honours, graduate professional entry degrees or, upon completion of appropriate research training preparation following the BScAdv(Hons), research higher degrees.",
        "Graduate Professional Entry Degrees For students who wish to continue professional studies at graduate level, the degree provides a pathway into a range of graduate professional entry programs, some of which also provide research training.",
        "http://futurestudents.unimelb.edu.au/grad/grad-programs/professional-entry",
        "Research Higher Degrees For students who wish to explore science research questions in greater depth, there will be opportunities to proceed to Research Higher Degrees at masters and doctoral level. Research training preparation within the Honours year, Postgraduate Diploma or a Masters degree will be required as preparation for a research higher degree."
    ]
}