{
    "Course name": "Bachelor of Fine Arts (Film and Television)",
    "Course code": "B-FAFILMTV",
    "Overview text": [
        "The Bachelor of Fine Arts (Film and Television) course aims to develop writer/directors with distinctive individual creative voices, and detailed practical knowledge of all stages of sustainable film and television production.",
        "This course is a three-year full-time degree that offers study in production based, practical film making and screen-based storytelling. Theoretical knowledge and practical skills are developed through an immersive and practical curriculum in studio and production environments.",
        "Students are provided with ongoing opportunities to initiate, develop, and realise short film projects and exercises with access to state-of-the-art equipment and facilities, under the guidance of professional and academic staff with significant industry experience.",
        "Students will also perform key crewing roles on other student productions and may be involved in creative interdisciplinary collaborations with students from the Victorian College of the Arts (VCA) Theatre, Music, and Production areas.",
        "Studies in screen culture and sustainability practices allow students to deepen their knowledge of cinema and screen-based storytelling, focusing on elements essential to the practice of contemporary film making. A capstone project in third year offers key practical film making opportunities.",
        "Breadth subjects at each year level will also allow students to explore a diverse range of study opportunities within the wider University community, exposing them to multi-disciplinary knowledge and skills.",
        "The capstone subject Screen Practice 3B provides students with the opportunity to focus on the development and realisation of a substantial short film work at a professional level.",
        "Successful completion of a Bachelor of Fine Arts (Film and Television) opens the opportunity to apply for further study in a Bachelor of Fine Arts (Degree with Honours), or a coursework Masters in various disciplines."
    ],
    "Overview table": {
        "Award title": "Bachelor of Fine Arts (Film and Television)",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "093584A",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed one of:",
            "(a) the Victorian Certificate of Education including VCE Units 3 and 4 either a study score of at least 25 in English/English Language/Literature or a study score of at least 30 in English as an Additional Language;",
            "(b) the International Baccalaureate Diploma including at least Grade 4 in English or English B (Standard Level or Higher Level);",
            "(c) a senior secondary program, foundation studies program or equivalent approved by Academic Board including appropriate English language studies.",
            "Applicants are also required to complete as prescribed by the Academic Board:",
            "a portfolio; and",
            "an interview (shortlisted applicants only).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "the portfolio; and",
            "performance in an interview (shortlisted applicants only); and",
            "prior academic achievement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduate English language requirements must be met.",
            "Notes:",
            "For applicants through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne",
            "Details for the portfolio and interview (shortlisted applicants only) can be found on the Fine Arts and Music Study website \n",
            "Successful applicants will be required to hold a current First Aid Certificate and a Working with Children Check and these must remain valid for the duration of the course"
        ],
        "Inherent requirements (core participation requirements)": [
            "Communication Skills:Students require effective and efficient communication skills about their knowledge and application of practicing arts disciplines.",
            "Creative, Intellectual and Organisational Abilities:Students require the capacity for high-level creative performance or production, and are expected to have the ability to develop problem-solving skills and to comprehend disciplinary and cross-disciplinary information.",
            "Behavioural and Social Attributes:Students participate in a complex learning environment and must take responsibility for their own participation and learning. Collaborative learning environments require students to demonstrate a wide range of interpersonal skills which contributes to and considers the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who have a disability which may prevent them from participating in tasks involving these inherent academic requirements are encouraged to contact Student Equity and Disability Services:https://students.unimelb.edu.au/student-support/student-equity-and-disability-support"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Fine Arts (Film and Television) requires the successful completion of 300 credit points."
            ],
            "Compulsory subjects": {
                "overview": [
                    [
                        "237.5 credit points of Compulsory subjects\n",
                        [
                            [
                                "75 credit points of Level 1 Compulsory subjects",
                                "75 credit points of Level 2 Compulsory subjects",
                                "87.5 credit points of Level 3 Compulsory subjects"
                            ]
                        ]
                    ]
                ]
            },
            "Electives": {
                "overview": [
                    [
                        "12.5 credit points of Level 2 electives"
                    ]
                ]
            },
            "Breadth": {
                "overview": [
                    [
                        "50 credit points of Breadth subjects\n",
                        [
                            [
                                "A minimum of 12.5 credit points of \n"
                            ]
                        ]
                    ]
                ]
            },
            "Progression Rules": {
                "overview": [
                    [
                        "Completion of CREA10002 Stories of Place in the first semester of study",
                        "Completion of all Level 1 Compulsory subjects before proceeding to the next year level's Compulsory subjects",
                        "Completion of all Level 2 Compulsory subjects before proceeding to the next year level's Compulsory subjects",
                        "Note: Compulsory subjects in this program have prerequisites. Refer to individual subject entries."
                    ]
                ]
            },
            "For students who commenced prior to 2021": {
                "overview": [
                    "For students who commenced the Bachelor of Fine Arts prior to 2021, please click the following link to view your course structure and subject options:",
                    "Link"
                ]
            },
            "Subject Options": {
                "overview": [],
                "Level 1 Compulsory subjects": {
                    "overview": [
                        [
                            "CREA10002"
                        ],
                        "Note: All students must take Stories of Place in their first semester of commencement in this course",
                        [
                            "FLTV10006",
                            "FLTV10008",
                            "FLTV10009",
                            "FLTV10025"
                        ]
                    ]
                },
                "Level 2 Compulsory subjects": {
                    "overview": [
                        [
                            "FLTV20006",
                            "FLTV20008",
                            "FLTV20009",
                            "FLTV20023"
                        ]
                    ]
                },
                "Level 3 Compulsory subjects": {
                    "overview": [
                        [
                            "FLTV30009",
                            "FLTV30032",
                            "FLTV30026",
                            "FLTV30027"
                        ]
                    ]
                },
                "Level 2 electives": {
                    "overview": [
                        [
                            "FLTV20020",
                            "FLTV20021",
                            "FLTV20022"
                        ]
                    ]
                }
            }
        },
        "Breadth requirements": {
            "overview": [
                "50 points of breadth subjects including at least 12.5 points at Level 2 or Level 3."
            ],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Fine Arts (Film and Television)"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}