{
    "Course name": "Bachelor of Biomedicine",
    "Course code": "B-BMED",
    "Overview text": [
        "The Bachelor of Biomedicine at Melbourne is designed to provide excellent education in a broad range of biomedical science and health-related areas of study. The course also equips graduates with the knowledge and skills necessary to understand and participate in subsequent pathways to employment,research higher degreesand many professionalpostgraduate studyprograms.",
        "The integrated core of the degree builds understanding of the structure and function of the body and consideration of the determinants of health and disease, including genetic, societal and environmental influences.",
        "The course culminates in the final year with subjects that deal with contemporary issues in biomedical science and health, exploring aspects of medical conditions from the molecular level to cellular and population levels.",
        "Students are required to complete a total of 300 points of study, including 125 points of core subjects across the degree. Depth within a particular biomedical science or health-related discipline is achieved by completing 50 points (4 subjects) in a major at Level 3.",
        "Students also take between 50-75 points from other discipline, or ‘breadth’, study areas, including subjects in the arts, humanities, commerce and other breadth discipline areas . These subjects are designed to build knowledge and skills that bridge disciplines, including sharpening skills of logic, analysis and problem solving. These subjects offer students opportunity to further differentiate their degree."
    ],
    "Overview table": {
        "Award title": "Bachelor of Biomedicine",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "058838G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time or 72 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.In order to be considered for entry, applicants must have completed one of:(a) The Victorian Certificate of Education including:• VCE Units 3 and 4 – either a study score of at least 25 in one of English, English Language or Literature or a study score of at least 30 in English as an Additional Language, and• VCE Units 3 and 4 – a study score of at least 25 in Chemistry and in Mathematical Methods (CAS) or Specialist Mathematics; OR(b) The International Baccalaureate Diploma including:• English, Chemistry and a minimum grade of 4 in either Applications and interpretations HL, Analysis and Approaches SL, or Analysis and Approaches HL.For students with English as their second language a pass in English B at the required level will be accepted as satisfying the English prerequisite. Except where specified, IB subjects must be passed to at least Grade 4 Standard or Higher Level. Mathematical Studies is not deemed equivalent to VCE Mathematical Methods; OR(c) A senior secondary program, foundation studies program or equivalent approved by the Academic Board including appropriate English language, Chemistry and Mathematics studies.Except for applicants eligible for Access Melbourne, minimum ATAR or equivalent overall performance rankings apply.Meeting these requirements does not guarantee selection.2.In ranking applications, the Selection Committee will consider:• Prior academic performance.3.The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduate English language requirements must be met.Note: For applications through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Bachelor of Biomedicine welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree.",
            "The Bachelor of Biomedicine necessitates all students to enrol in subjects where they will require:",
            "1. the ability to comprehend complex science, technology and/or engineering systems related information; ",
            "2. the ability to clearly and independently communicate knowledge and application of science, technology and/or engineering systems principles and practices during assessment tasks;  ",
            "3. the ability to attend classes and actively engage in both independent and group learning, as well as independent and group-related assessments.",
            "4. the ability to actively and safely contribute in laboratory, and/or fieldwork/excursion activities. ",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning and adhere to the expectations outlined in theStudent Charter.",
            "Students also contribute to the learning of other students in collaborative learning environments and must therefore demonstrate a wide range of interpersonal skills which consider the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. Integrity, concern for others, interpersonal skills, interest, reflection, perseverance, and motivation are all personal qualities that are deemed necessary for students enrolled in the  Bachelor of Biomedicine.",
            "There are additional inherent academic requirements for some major studies and subjects, and these requirements are listed within the description of the requirements for each of these majors and subjects. Students who feel their disability will impact on meeting these requirements are encouraged to discuss this matter with the relevant Major and Subject Coordinator(s) andStudent Equity and Disability Support.",
            "It is University and Faculty policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability will impact on meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Student Support and Engagement Policy, academic requirements for this course are articulated in the Course Overview, Learning Outcomes, Assessment and Generic Skills sections of this entry."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Biomedicine requires the successful completion of 300 credit points."
            ],
            "Course Rules": {
                "overview": [
                    [
                        "225 credit points of Discipline subjects includingA minimum of 75 credit points of Level 1 Discipline subjects\n50 credit points of Compulsory Level 1 Discipline subjects\nA minimum of 25 credit points of Foundation electives\n\n\nA minimum of 62.5 credit points of Level 2 Discipline subjects\n50 credit points of Compulsory Level 2 Discipline subjects\nA minimum of 12.5 credit points of Level 2 Discipline electives\n\n\nA minimum of 75 credit points of Level 3 Discipline subjects\n25 credit points of Compulsory Level 3 Discipline subjects\n50 credit points consisting of subjects from your chosen Major\n\n\n",
                        "A minimum of 75 credit points of Level 1 Discipline subjects\n50 credit points of Compulsory Level 1 Discipline subjects\nA minimum of 25 credit points of Foundation electives\n\n",
                        "50 credit points of Compulsory Level 1 Discipline subjects",
                        "A minimum of 25 credit points of Foundation electives",
                        "A minimum of 62.5 credit points of Level 2 Discipline subjects\n50 credit points of Compulsory Level 2 Discipline subjects\nA minimum of 12.5 credit points of Level 2 Discipline electives\n\n",
                        "50 credit points of Compulsory Level 2 Discipline subjects",
                        "A minimum of 12.5 credit points of Level 2 Discipline electives",
                        "A minimum of 75 credit points of Level 3 Discipline subjects\n25 credit points of Compulsory Level 3 Discipline subjects\n50 credit points consisting of subjects from your chosen Major\n\n",
                        "25 credit points of Compulsory Level 3 Discipline subjects",
                        "50 credit points consisting of subjects from your chosen Major",
                        "50 credit points of Breadth subjects includingA maximum of 37.5 credit points of Level 1 Breadth subjects\n\n",
                        "A maximum of 37.5 credit points of Level 1 Breadth subjects\n",
                        "The remaining 25 credit points may consist of Discipline electives or Breadth or Foundation electives. You must still meet all other course rules."
                    ],
                    [
                        "A minimum of 75 credit points of Level 1 Discipline subjects\n50 credit points of Compulsory Level 1 Discipline subjects\nA minimum of 25 credit points of Foundation electives\n\n",
                        "50 credit points of Compulsory Level 1 Discipline subjects",
                        "A minimum of 25 credit points of Foundation electives"
                    ],
                    [
                        "50 credit points of Compulsory Level 1 Discipline subjects",
                        "A minimum of 25 credit points of Foundation electives"
                    ],
                    [
                        "A minimum of 62.5 credit points of Level 2 Discipline subjects\n50 credit points of Compulsory Level 2 Discipline subjects\nA minimum of 12.5 credit points of Level 2 Discipline electives\n\n",
                        "50 credit points of Compulsory Level 2 Discipline subjects",
                        "A minimum of 12.5 credit points of Level 2 Discipline electives"
                    ],
                    [
                        "50 credit points of Compulsory Level 2 Discipline subjects",
                        "A minimum of 12.5 credit points of Level 2 Discipline electives"
                    ],
                    [
                        "A minimum of 75 credit points of Level 3 Discipline subjects\n25 credit points of Compulsory Level 3 Discipline subjects\n50 credit points consisting of subjects from your chosen Major\n\n",
                        "25 credit points of Compulsory Level 3 Discipline subjects",
                        "50 credit points consisting of subjects from your chosen Major"
                    ],
                    [
                        "25 credit points of Compulsory Level 3 Discipline subjects",
                        "50 credit points consisting of subjects from your chosen Major"
                    ],
                    [
                        "A maximum of 37.5 credit points of Level 1 Breadth subjects\n"
                    ]
                ]
            },
            "Additional Rules": {
                "overview": [
                    [
                        "Completion of one prescribed major",
                        "A maximum of 125 credit points of Level 1 subjects",
                        "a maximum of 125 credit points in a single discipline"
                    ]
                ]
            },
            "Progression Rules": {
                "overview": [
                    [
                        "Completion of at least 50 points of Level 1 study before proceeding to the next subject year level  is normally required.",
                        "The above Level 1 to Level 2 Progression Rule is inclusive of completing BIOM10001 Discovering Biomedicine.",
                        "Completion of at least 50 points of Level 2 study before proceeding to the next subject year level  is normally required.",
                        "In particular, BIOL10002 Biomolecules & Cells, BIOM10001 Discovering Biomedicine, BIOM10002 Exploring Biomedicine and CHEM10006 Chemistry for Biomedicine must be completed before students may proceed to Level 2 core subjects."
                    ]
                ]
            },
            "Subject options": {
                "overview": []
            },
            "Compulsory Level 1 Discipline subjects": {
                "overview": [
                    [
                        "BIOM10001"
                    ],
                    "All students must take Discovering Biomedicine in the first semester of commencement in this course",
                    [
                        "BIOL10002",
                        "CHEM10006",
                        "BIOM10002"
                    ]
                ]
            },
            "Compulsory Level 2 Discipline subjects": {
                "overview": [
                    [
                        "BIOM20001",
                        "BIOM20002"
                    ],
                    "(Alternative subjects at second year level equivalent to BIOM20002 Human Structure and Function are available for students undertaking study abroad or exchange in semester 2 of their second year)"
                ]
            },
            "Compulsory Level 3 Discipline subjects": {
                "overview": [
                    [
                        "BIOM30002",
                        "BIOM30001"
                    ]
                ]
            },
            "Elective subjects": {
                "overview": []
            },
            "Foundation electives": {
                "overview": [
                    [
                        "COMP10001",
                        "MAST10005",
                        "MAST10006",
                        "MAST10007",
                        "MAST10008",
                        "MAST10009",
                        "MAST10010",
                        "MAST10021",
                        "MAST10022",
                        "MAST10024",
                        "PHYC10003",
                        "PHYC10006",
                        "PHYC10007",
                        "PHYC10009",
                        "PHYC10001",
                        "PSYC10003",
                        "PSYC10004",
                        "PSYC10006",
                        "PSYC10007",
                        "ENGR10004"
                    ],
                    "Students who want to keep the Bioengineering Systems major as an option need to select one of MAST10007 Linear Algebra/MAST10022 Linear Algebra: Advanced/MAST10008 Accelerated Mathematics and one of MAST10006 Calculus 2/MAST10021 Calculus 2: Advanced/MAST10009 Accelerated Mathematics 2. You are also recommended to use one of your Breadth/Elective choices to complete ENGR10004 Engineering Technology and Society (Semester 1 or 2 in your first year).",
                    "Students who want to keep the accredited Psychology major as an option need to select PSYC10003 and PSYC10004."
                ]
            },
            "Discipline electives": {
                "overview": [
                    "A full list of subjects available as credit (electives) for the Bachelor of Biomedicine (B-BMED) can be found via the link below.",
                    "https://handbook.unimelb.edu.au/2024/components/b-bmed-stdopt-1"
                ]
            }
        },
        "Breadth requirements": {
            "overview": [],
            "Find breadth subjects": {
                "overview": [
                    "Use theHandbook Searchfunction to find subjects that can be used asbreadth studies in the Bachelor of Biomedicine"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {
        "Bachelor of Biomedicine - Majors": [
            "Completion of 50 credit points of study at Level 3",
            "The subjects taken in the major would normally follow on from relevant compulsory and elective subjects chosen at the second year level. Some Level 3 subjects require discipline electives as prerequisites.",
            {
                "Biochemistry and Molecular Biology": "50 Credits",
                "Biomedical Engineering Systems": "50 Credits",
                "Biotechnology": "50 Credits",
                "Cell and Developmental Biology": "50 Credits",
                "Genetics": "50 Credits",
                "Human Nutrition": "50 Credits",
                "Human Structure and Function": "50 Credits",
                "Immunology": "50 Credits",
                "Infection and Immunity": "50 Credits",
                "Microbiology": "50 Credits",
                "Neuroscience": "50 Credits",
                "Pathology": "50 Credits",
                "Pharmacology": "50 Credits",
                "Physiology": "50 Credits",
                "Psychology": "50 Credits",
                "Public Health and Epidemiology": "50 Credits"
            }
        ]
    },
    "Further Study": [
        "The Bachelor of Biomedicine degree provides pathways to honours, graduate professional entry degrees or, upon completion of appropriate research training preparation following the BBiomed, research higher degrees.",
        "HonoursDepending on the major undertaken, students may apply for an Honours program upon completion of the Bachelor of Biomedicine. Further details are available on:http://mdhs-study.unimelb.edu.au/degrees/honours/overviewGraduate Professional Entry DegreesFor students who wish to continue professional studies at graduate level, the degree provides a pathway into a range of graduate professional entry programs, some of which also provide research training.https://futurestudents.unimelb.edu.au/courses/pathwaysResearch Higher DegreesFor students who wish to explore biomedicine research questions in greater depth, there will be opportunities to proceed to Research Higher Degrees at masters and doctoral level. Research training preparation within the Honours year, Postgraduate Diploma or a Masters degree will be required as preparation for a research higher degree."
    ]
}