{
    "Course name": "Bachelor of Science (Extended)",
    "Course code": "B-SCIEXT",
    "Overview text": [
        "The Bachelor of Science (Extended) is a four-year program that provides a transition into tertiary science and technology study and is available to Aboriginal and Torres Strait Islander students. A year of study in addition to the three-year BSc program provides students with foundation knowledge and skills in science, mathematics and communication, while supporting the development of students’ academic skills for tertiary study. Upon completion, graduates will have completed all of the requirements of the Bachelor of Science.",
        "Students are supported by a range of the University’s student support services, including Murrup Barak, the Melbourne Institute for Indigenous Development, as well as having the opportunity to live in one of the colleges affiliated with the University of Melbourne.",
        "Last updated: 12 February 2024"
    ],
    "Overview table": {
        "Award title": "Bachelor of Science",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "7",
        "Credit points": "400 credit points",
        "Duration": "48 months full-time or 96 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:one of",
            "(a) the Victorian Certificate of Education including",
            "VCE Units 1 and 2 – satisfactory completion of one of Biology, Chemistry, General Mathematics, Mathematical Methods (CAS), Physics, or equivalent",
            "VCE Units 3 and 4 – a study score of at least 25 in one of English, English Language or Literature or at least 30 in English as an Additional Language (EAL)",
            "(b) a senior secondary program, foundation studies program or equivalent approved by the Academic Board including appropriate English language studies and studies in one of Mathematics, Biology, Chemistry or Physics.",
            "To be considered, applicants must also be recognized as Indigenous Australians or Torres Strait Islanders.",
            "Minimum ATAR or equivalent overall performance rankingsapply.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance",
            "academic capacity relevant to science study, assessed by interview and/or referee reports",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, the undergraduateEnglish language requirementsmust be met.",
            "NoteThis specialised degree is for talented Indigenous Australians who may not meet the regular Bachelor of Science entry requirements. It includes integrated support and academic skills subjects."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Bachelor of Science (Extended) welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree.",
            "The Bachelor of Science (Extended) requires all students to enrol in subjects where they will require:",
            "1. the ability to comprehend complex science, technology and/or engineering systems related information;",
            "2. the ability to clearly and independently communicate a knowledge and application of science, technology and engineering systems principles and practices during assessment tasks; and in some areas of study;",
            "3. the ability to actively and safely contribute in clinical, laboratory, and fieldwork/excursion activities.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "There are additional inherent academic requirements for some major studies and subjects, and these requirements are listed within the description of the requirements for each of these majors and subjects.",
            "Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the relevant Subject Coordinator and Disability Liaison:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Please see the Bachelor of Science handbook entry for the following majors for details of their level of professional accreditation:",
            "Psychology",
            "Computing and Software Systems"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Bachelor of Science (Extended) requires the successful completion of 400 credit points.",
                "This includes successful completion of 100 points of foundation studies followed by 300 points of study as required to complete the Bachelor of Science (B-SCI)",
                "First Year (normally completed full time)",
                [
                    "SCIE10001",
                    "SCIE10002",
                    "MAST10014",
                    "MAST10015",
                    "SCIE10005",
                    "INDG10002"
                ],
                "AND",
                [
                    "GENE10001",
                    "GEOG10001",
                    "MULT10011",
                    "EVSC10001"
                ],
                "AND",
                "12.5 points of Level-1 Bachelor of Science credited subjects.",
                "*Note - students who have successfully completed VCE Unit 3/4 Mathematical Methods may seek approval to replace MAST10014 and MAST10015 with additional level-1 BSc electives",
                "Second Year",
                [
                    "SCIE10003"
                ],
                "AND",
                "87.5 points toward the completion of the requirements of the Bachelor of Science",
                "In the second year of the course students transition to the Bachelor of Science (B-SCI) completion requirements. Students refer to the BSc Handbook entry for these course completion requirements.",
                "Progression: Students must normally complete 50 points of study at one subject year level inclusive of SCIE10005 - Today’s Science, Tomorrow’s World (Discovery Subject) before proceeding to the next subject year level. In the case of progression to level-2 subjects, normally 50 points of level-1 subjects must be completed in addition to any BSc(Ext) foundation subjects before proceeding to level-2 subjects.",
                "For a sample study plan of the entire Bachelor of Science (Extended) please see the following link -https://students.unimelb.edu.au/__data/assets/pdf_file/0005/4476938/CM-B-SCI-Extended_v4_Fillable.pdf",
                "Breadth requirements: Use the Handbook Search function to find subjects that can be used as breadth studies in the Bachelor of Science (Extended). Students in the B-SCIEXT can also undertake breadth studies available in the Bachelor of Science (B-SCI)."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The Bachelor of Science (Extended) degree provides pathways to honours, graduate professional entry degrees or, upon completion of appropriate research training preparation following the BSc, research higher degrees.",
        "Honours Depending on the major undertaken, students may apply for an Honours program upon completion of the Bachelor of Science (Extended). Refer to the course entry for further details:",
        "https://handbook.unimelb.edu.au/view/current/BH-SCI",
        "Graduate Professional Entry Degrees For students who wish to continue professional studies at graduate level, the degree provides a pathway into a range of graduate professional entry programs, some of which also provide research training.",
        "http://futurestudents.unimelb.edu.au/grad/grad-programs/professional-entryResearch Higher Degrees For students who wish to explore science research questions in greater depth, there will be opportunities to proceed to Research Higher Degrees at masters and doctoral level. Research training preparation within the Honours year, Postgraduate Diploma or a Masters degree will be required as preparation for a research higher degree."
    ]
}