{
    "Course name": "Diploma in Mathematical Sciences",
    "Course code": "D-MATHSC",
    "Overview text": [
        "The Diploma in Mathematical Sciences is a 100-point diploma, normally taken concurrently with an undergraduate degree.",
        "The Diploma in Mathematical Sciences is a great way to use and develop your mathematical skills and complement your undergraduate studies. The high-level numerical and modelling skills you will gain can be applied across almost every area of employment and are always in demand.",
        "This diploma is studied concurrently on a part-time basis with a bachelor degree. Within the Diploma, students will complete the requirements of the Mathematics and Statistics major from the Bachelor of Science. The Diploma consists of 1 year EFTSL of study completed concurrently with an undergraduate degree usually over 3-4 years.",
        "A concurrent diploma must be undertaken at the same time as your substantive degree (e.g. Bachelor of Arts)and is considered to be a combined course for the purposes of theStudent Assistance (Education Institutions and Courses) Determination 2019. More information on concurrent diplomas is foundhere.",
        "Please note: The Diploma in Mathematical Sciences is not available to students enrolled in the Bachelor of Science who are taking theData Science, Mathematics and StatisticsorMathematical Physics majors.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Diploma in Mathematical Sciences",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "5",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "In order to be considered for entry, applicants must have completed:",
            "concurrent enrolment in a University of Melbourne undergraduate degree; and",
            "a study score of 30 in VCE Specialist Mathematics Units 3 and 4 or equivalent, or successful completion of university-level studies equivalent to VCE Specialist Mathematics Units 3 and 4.",
            "Meeting this requirement does not guarantee selection.",
            "In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "The Academic Board may determine levels of prior academic performance which guarantee selection.",
            "The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "Applicants will satisfy the University’s English language requirements for the Diploma by meeting theEnglish language requirementsfor the Bachelor degree in which they are enrolled concurrently.",
            "Notes:",
            "• Students are permitted to enter the diploma at the start of any semester before the completion of the companion undergraduate degree.",
            "• Up to 50 points of advanced standing into the Diploma in Mathematical Sciences may be granted on request to students who complete appropriate first year and second year mathematics or statistics subjects within the degree. At the commencement of each individual mathematics or statistics subject, the subject is assigned to one of the degree or the diploma, according to the student’s approved enrolment for the semester in which the subject is taken.",
            "• The Diploma in Mathematical Sciences cannot be awarded until all requirements of both the diploma and the undergraduate degree have been met.",
            "• A concurrent diploma must be undertaken at the same time as your substantive degree (e.g. Bachelor of Arts)and is considered to be a combined course for the purposes of theStudent Assistance (Education Institutions and Courses) Determination 2019. More information on concurrent diplomas is foundhere."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry. The University is dedicated to provide support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Diploma in Mathematical Sciences requires the successful completion of 100 credit points.",
                "Students undertake the Diploma in Mathematical Sciences together with an undergraduate degree, to make a total program of between 350 and 400 points.",
                "Up to fifty points of appropriate Mathematics and Statistics subjects in the undergraduate degree program may also be attributed to the Diploma.",
                "Note that in some cases students will be required to complete a total of 125 points of mathematics and statistics study to complete a maths sequence as required by the Diploma. Note that only 100 points of this 125 points of study can be completed in the Diploma and therefore any additional points required must be completed within the bachelors degree or via the Community Access Program.",
                "To be awarded the Diploma students must have completed 100 points of Mathematics and Statistics subjects at post-VCE level, including 50 points at third year level. Students enrolled in the Bachelor of Science majoring in Mathematics and Statistics, Data Science or Mathematical Physics are not permitted to complete a Diploma in Mathematical Sciences.",
                "Students are required to select subjects in the undergraduate degree and the Diploma, so that all requirements of the undergraduate degree are met and, in addition through the Diploma, the student meets the specific requirements for the award of any one specialisation of the major in Mathematics and Statistics, as defined for the Bachelor of Science.",
                [
                    "Pure Mathematics",
                    "Applied Mathematics",
                    "Discrete Mathematics and Operations Research",
                    "Statistics / Stochastic Processes"
                ],
                "Pathways",
                "Depending on a student’s individual circumstances and their study preferences, the Diploma may be taken in a variety of ‘Fast Track’ modes or by adding the full 100 points (i.e. one full year) to their degree.",
                "The mode of undertaking the diploma, either Fast Track or by addition of a full year to their degree, will depend on each student’s particular circumstances and study preferences, including whether they meet the criteria for permission to overload. The overload policy requires a particular level of performance/achievement be attained for permission to overload.",
                "Fast Track modes will involve cross crediting of up to 50 points with the bachelor degree and/or overloading in one, two or all three years of the course.",
                "Students are required to complete one of the following areas of study:",
                "Pure Mathematics",
                "100 credit points of Mathematics and Statistics subjects including",
                [
                    "37.5 credit points of Pure Mathematics core subjects",
                    "12.5 credit points of Pure Mathematics electives"
                ],
                "Applied Mathematics",
                "100 credit points of Mathematics and Statistics subjects including",
                [
                    "25 credit points of Applied Mathematics core subjects",
                    "25 credit points of Applied Mathematics electives"
                ],
                "Discrete Mathematics and Operations Research",
                "100 credit points of Mathematics and Statistics subjects including",
                [
                    "37.5 credit points of Discrete Mathematics and Operations Research core subjects",
                    "12.5 credit points of Discrete Mathematics and Operations Research electives"
                ],
                "Statistics / Stochastic Processes",
                "100 credit points of Mathematics and Statistics subjects including",
                [
                    "25 credit points of Statistics / Stochastic Processes core subjectsAnd one of the following options:\n\nOption 1\n25 credit points of Statistics / Stochastics electives\n\nOption 2\n25 credit points of Mathematics and Statistics subjects - Level 3 including\n\nA minimum of 12.5 credit points of Statistics / Stochastics electives\n",
                    "A minimum of 12.5 credit points of Statistics / Stochastics electives"
                ],
                "And one of the following options:",
                "Option 1",
                "25 credit points of Statistics / Stochastics electives",
                "Option 2",
                "25 credit points of Mathematics and Statistics subjects - Level 3 including",
                [
                    "A minimum of 12.5 credit points of Statistics / Stochastics electives"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Any postgraduate program accessible to BSc students with a major in Mathematics and Statistics is open to students who successfully complete the Diploma and the accompanying undergraduate degree, since Diploma completion ensures that all academic requirements of a major in Mathematics and Statistics have been met."
    ]
}