{
    "Course name": "Diploma in General Studies",
    "Course code": "D-GENST",
    "Overview text": [
        "The Diploma in General Studies: Your stepping-stone",
        "The Diploma in General Studies is a sampler of the Melbourne Bachelor Degrees, providing you with the opportunity to study Science, Commerce, Agriculture or Environments. It gives you the breathing space of a year to decide what you want to do next and provides a stepping stone to a meaningful outcome – whether that is employment, or further study in a University of Melbourne degree or TAFE program.",
        "The Diploma is aimed at both school leavers and mature-age students. It is designed to provide a pathway to reduce educational entry and financial barriers to higher education by offering flexible education in regional Victoria. The course facilitates the transition to higher education through the provision of a supportive learning environment specifically designed to develop the academic skills required for success at University.",
        "The course framework provides students with broad study options and the opportunity to experience a range of discipline areas. Depending on subject choice and academic results, graduates may satisfy the entry requirements for a range of bachelor degrees, in Science, Commerce, Design, Arts, Biomedicine and Agriculture.",
        ""
    ],
    "Overview table": {
        "Award title": "Diploma in General Studies",
        "Year & campus": "2024— Dookie",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "5",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed: one of",
            "(a) the Victorian Certificate of Education including",
            "VCE Units 3 and 4 – either a study score of at least 20 in one of English, English Language or Literature or a study score of at least 25 in English as an Additional Language;",
            "(b) the International Baccalaureate Diploma including",
            "at least Grade 4 in English or English B (Standard Level or Higher Level);",
            "(c) a senior secondary program, foundation studies program or equivalent approved by the Academic Board including appropriate English language studies.",
            "(d) A Certificate IV qualification in one of the following:",
            "Certificate IV in Frontline Management",
            "Certificate IV in Conservation and Land Management",
            "Certificate IV in Accounting",
            "Certificate IV in Tertiary Preparation",
            "Certificate IV in Agriculture",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic BoardRuleson the use of selection instruments.",
            "4. For applicants who have not completed the Victorian Certificate of Education or the International Baccalaureate Diploma, theundergraduate English language requirementsmust be met.",
            "Note. For applications through the Victorian Tertiary Admission Centre, “middle-band” selection adjustments are made only on the basis of eligibility for Access Melbourne.",
            "Entry into undergraduate degrees is usually via applications through the Victorian Tertiary Admissions Centre (VTAC). Full details regarding the VTAC application process may be found on the VTAC website or by purchasing the VTAC Guide from newsagencies.",
            "Alternatively, applications for the Diploma in General Studies may be submitted directly."
        ],
        "Inherent requirements (core participation requirements)": [
            "Candidates for the Diploma in General Studies must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning; and contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the University’s programs. This course requires all students to enrol in subjects where they must actively and safely contribute to field excursions and laboratory activities. Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the Coordinator and Student Equity and Disability Support:http://services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "100 points (typically eight subjects including one core subject Academic Writing and Communication)."
            ]
        },
        "Subject options": {
            "overview": [
                "All students complete the core subject",
                [
                    "MECM10005"
                ],
                "Plus choose any 7 of the below elective subjects",
                [
                    "MAST10017",
                    "ECON10006",
                    "NRMT10007",
                    "AGRI10044",
                    "BIOL10006",
                    "ANSC10002",
                    "ENST10004",
                    "CHEM10008",
                    "ACCT10004",
                    "GEOG10002",
                    "MGMT10003",
                    "AGRI10052"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates of the Diploma in General Studies may wish to continue their studies at University or TAFE.",
        "On completion of the one-year course, you could receive guaranteed entry into one of six of the following University of Melbourne bachelor degrees:",
        [
            "Bachelor of Agriculture",
            "Bachelor of Arts",
            "Bachelor of Biomedicine",
            "Bachelor of Commerce",
            "Bachelor of Design",
            "Bachelor of Science"
        ],
        "Guaranteed entry applies only to those eligible for Access Melbourne and upon meeting the required guaranteed scores on completion of the DiGS.",
        "Refer tohttps://study.unimelb.edu.au/find/courses/undergraduate/diploma-in-general-studies/where-will-this-take-me/for more information."
    ]
}