{
    "Course name": "Diploma in Music",
    "Course code": "D-MUSIC",
    "Overview text": [
        "The Diploma in Music provides students with the opportunity to undertake a tailored sequence of music study and gain a music qualification while completing an undergraduate degree in another field at The University of Melbourne. It is available to students enrolled in an undergraduate degree other than the Bachelor of Music and the Bachelor of Fine Arts. It is studied concurrently with the bachelor degree.",
        "Diploma in Music students study for a music qualification alongside Bachelor of Music students, giving the opportunity to build valuable friendships and networks in a challenging musical environment. A range of study options is available across all areas of specialisation within the Melbourne Conservatorium of Music, including practical music, ensemble music performance, aural studies, composition, improvisation, music history and theory. Students are encouraged to follow their own areas of interest, constructing a bespoke program of study from the range of elective choices available.",
        "The Diploma may only be awarded on the completion of the concurrent degree course. This means that graduation from the Diploma will only occur at the same time as graduation from the concurrent course.",
        "A concurrent diploma must be undertaken at the same time as your substantive degree (e.g. Bachelor of Arts) and is considered to be a combined course for the purposes of theStudent Assistance (Education Institutions and Courses) Determination 2019. More information on concurrent diplomas is foundhere.",
        "Last updated: 28 August 2024"
    ],
    "Overview table": {
        "Award title": "Diploma in Music",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "5",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must:",
            "be concurrently enrolled in a University of Melbourne undergraduate degree other than the Bachelor of Music or the Bachelor of Fine Arts. Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance and/or prior musical experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants will satisfy the University’s English language requirements for the Diploma by meeting the English language requirements for the Bachelor degree in which they are enrolled concurrently.",
            "Note:",
            "Students are permitted to enter the diploma at the start of any semester before the completion of the companion undergraduate program.",
            "Up to 50 points of advanced standing into the Diploma in Music may be granted on request to students who complete appropriate first year and second year music subjects within their companion degree. At the commencement of each individual music subject, the subject is assigned to one of the degree or the diploma, according to the student’s approved enrolment for the semester in which the subject is taken. Once the subject has been successfully completed, credit points for the subject cannot be moved between the degree and the diploma to allow additional subjects to be taken in the degree.",
            "The Diploma in Music cannot be awarded until all requirements of both the diploma and the undergraduate degree have been met.",
            "A concurrent diploma must be undertaken at the same time as your substantive degree (e.g. Bachelor of Arts) and is considered to be a combined course for the purposes of the . More information on concurrent diplomas is found ."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Diploma in Music requires the successful completion of 100 credit points.",
                "The Diploma consists of 100 points of elective subject choices, usually taken across three years, which may be chosen from all areas of study within the Melbourne Conservatorium of Music.",
                "100 credit points of electives including",
                [
                    "A maximum of 50 credit points of Level 1 electives",
                    "A minimum of 25 credit points of Level 3 electives",
                    "Up to 50 points may be cross-credited as Breadth to the main Bachelor degree."
                ]
            ],
            "Subject Options": {
                "overview": [],
                "Level 1 Electives": {
                    "overview": [
                        [
                            "MUSI10004",
                            "MUSI10017",
                            "MUSI10021",
                            "MUSI10022",
                            "MUSI10023",
                            "MUSI10037",
                            "MUSI10041",
                            "MUSI10042",
                            "MUSI10047",
                            "MUSI10052",
                            "MUSI10053",
                            "MUSI10056",
                            "MUSI10057",
                            "MUSI10058",
                            "MUSI10059",
                            "MUSI10060",
                            "MUSI10061",
                            "MUSI10066",
                            "MUSI10067",
                            "MUSI10068",
                            "MUSI10069",
                            "MUSI10076",
                            "MUSI10092",
                            "MUSI10093",
                            "MUSI10179",
                            "MUSI10184",
                            "MUSI10202",
                            "MUSI10204",
                            "MUSI10206",
                            "MUSI10207",
                            "MUSI10219",
                            "MUSI10220",
                            "MUSI10221",
                            "MUSI10222",
                            "MUSI10225",
                            "MUSI10226",
                            "MUSI10227",
                            "MUSI10237"
                        ]
                    ]
                },
                "Level 2 Electives": {
                    "overview": [
                        [
                            "MUSI20008",
                            "MUSI20013",
                            "MUSI20014",
                            "MUSI20061",
                            "MUSI20069",
                            "MUSI20070",
                            "MUSI20071",
                            "MUSI20072",
                            "MUSI20073",
                            "MUSI20074",
                            "MUSI20080",
                            "MUSI20081",
                            "MUSI20082",
                            "MUSI20083",
                            "MUSI20087",
                            "MUSI20088",
                            "MUSI20089",
                            "MUSI20090",
                            "MUSI20091",
                            "MUSI20092",
                            "MUSI20093",
                            "MUSI20094",
                            "MUSI20099",
                            "MUSI20104",
                            "MUSI20105",
                            "MUSI20108",
                            "MUSI20112",
                            "MUSI20113",
                            "MUSI20120",
                            "MUSI20122",
                            "MUSI20149",
                            "MUSI20150",
                            "MUSI20156",
                            "MUSI20160",
                            "MUSI20167",
                            "MUSI20173",
                            "MUSI20174",
                            "MUSI20190",
                            "MUSI20196",
                            "MUSI20198",
                            "MUSI20199",
                            "MUSI20200",
                            "MUSI20203",
                            "MUSI20204",
                            "MUSI20206",
                            "MUSI20207",
                            "MUSI20208",
                            "MUSI20209",
                            "MUSI20210",
                            "MUSI20211",
                            "MUSI20212",
                            "MUSI20213",
                            "MUSI20214",
                            "MUSI20215",
                            "MUSI20216",
                            "MUSI20222",
                            "MUSI20223",
                            "MUSI20224",
                            "MUSI20227",
                            "MUSI20231",
                            "MUSI20232",
                            "MUSI20234",
                            "MUSI20235",
                            "MUSI20236"
                        ]
                    ]
                },
                "Level 3 Electives": {
                    "overview": [
                        [
                            "MUSI30004",
                            "MUSI30011",
                            "MUSI30015",
                            "MUSI30019",
                            "MUSI30020",
                            "MUSI30025",
                            "MUSI30030",
                            "MUSI30031",
                            "MUSI30032",
                            "MUSI30045",
                            "MUSI30046",
                            "MUSI30047",
                            "MUSI30053",
                            "MUSI30116",
                            "MUSI30159",
                            "MUSI30160",
                            "MUSI30163",
                            "MUSI30164",
                            "MUSI30165",
                            "MUSI30166",
                            "MUSI30167",
                            "MUSI30168",
                            "MUSI30172",
                            "MUSI30173",
                            "MUSI30174",
                            "MUSI30175",
                            "MUSI30181",
                            "MUSI30182",
                            "MUSI30183",
                            "MUSI30184",
                            "MUSI30185",
                            "MUSI30186",
                            "MUSI30193",
                            "MUSI30206",
                            "MUSI30207",
                            "MUSI30236",
                            "MUSI30244",
                            "MUSI30246",
                            "MUSI30249",
                            "MUSI30250",
                            "MUSI30251",
                            "MUSI30255",
                            "MUSI30256",
                            "MUSI30257",
                            "MUSI30258",
                            "MUSI30260",
                            "MUSI30261",
                            "MUSI30262",
                            "MUSI30265",
                            "MUSI30266",
                            "MUSI30269",
                            "MUSI30270",
                            "MUSI30271",
                            "MUSI30283"
                        ]
                    ]
                }
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}