{
    "Course name": "Diploma in General Studies (Extended)",
    "Course code": "D-GENSTEXT",
    "Overview text": [
        "The Diploma in General Studies (Extended) is an 18-month long program that provides a transition into higher education and is available to Aboriginal and Torres Strait Islander students. A semester of study in addition to the one year D-GENST program provides students with foundation knowledge and skills in science, mathematics, communication and cultural knowledge, while supporting the development of students’ academic skills for further tertiary study. Upon completion, graduates will have completed all the requirements of the Diploma of General Studies."
    ],
    "Overview table": {
        "Award title": "Diploma in General Studies",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Undergraduate Coursework",
        "AQFlevel": "5",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have:",
            "Completed VCE or equivalent; or completed an Appropriate VET qualification at Certificate IV or above; and",
            "Be of Aboriginal or Torres Strait Islander descent; and",
            "The academic capacity and potential for leadership in the community, assessed by interview and by referee reports.",
            "Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance;",
            "the interview and referee reports.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.Note: Non-school leavers, mature age students and alternative pathway applications will be considered.Successful students will be selected on their likelihood to succeed in the Diploma in General Studies. Qualifications will be assessed on application.Applications can be made through VTAC (Victorian Tertiary Admissions centre). Applicants can submit a direct application to the University, however, direct applications will only be considered after the VTAC offers have closed."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Successful completion of 50 points of foundation studies followed by 100 points of study as required to complete the Diploma of General Studies (D-GENST).",
                "50 points of foundation studies taken in the first semester of study comprising the following subjects:",
                [
                    "MAST10023",
                    "ENST10005",
                    "SKIL10007",
                    "AUST10002"
                ],
                "Followed by core subject:",
                [
                    "MECM10005"
                ],
                "Plus choose any 7 of the below elective subjects:",
                [
                    "MAST10017",
                    "ECON10006",
                    "NRMT10007",
                    "AGRI10044",
                    "BIOL10006",
                    "ANSC10002",
                    "ENST10004",
                    "CHEM10008",
                    "ACCT10004",
                    "GEOG10002",
                    "MGMT10003",
                    "AGRI10052"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates of the Diploma in General Studies may wish to continue their studies at University or TAFE.",
        "Eligible graduates may consider applying for further study in one of the following courses at the University of Melbourne:",
        [
            "Bachelor of Science",
            "Bachelor of Commerce",
            "Bachelor of Agriculture",
            "Bachelor of Design"
        ]
    ]
}