{
    "Course name": "Doctor of Veterinary Medicine",
    "Course code": "MC-DVETMED",
    "Overview text": [
        "The program of study will be four years full time, and will be delivered at the Parkville campus (Years One and Two) and at the Werribee campus (Years Three and Four).",
        "The Doctor of Veterinary Medicine (DVM) curriculum will assume prior knowledge and experience of scientific thought processes. This will allow for the early introduction of an integrated, interdisciplinary approach to veterinary studies, an approach that provides opportunities for students to apply their understanding to authentic cases, to practise evidence-based decision-making, to solve clinical problems and to acquire clinical competencies in an ordered and sequential way, from the first year of their course. By the time they reach the final year of the DVM, students will be immersed in a community of best practice in veterinary clinics, where the explicit teaching of the lecture theatre, practical class and tutorial room gives way to peer to peer teaching and experiential learning.",
        "Students successfully completing the Veterinary Bioscience major of the BSc will have guaranteed progression to the DVM, with credit for all subjects in DVM1.",
        "Doctor of Veterinary Medicine with Distinction",
        "The Doctor of Veterinary Medicine with Distinction will be awarded to completing students (graduates) who have achieved a weighted average mark of 80% or more across all subjects in the final three years of the DVM course.",
        ""
    ],
    "Overview table": {
        "Award title": "Doctor of Veterinary Medicine",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "071999D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "400 credit points",
        "Duration": "48 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "Normal Entry (Graduate Selection)",
            "1. In order to be considered for entry, applicants must have completed:",
            "the Bachelor of Science, Bachelor of Biomedicine or Bachelor of Agriculture degree at the University of Melbourne, or an equivalent degree from another institution, including specified prerequisite subjects (at least one semester of study in biology and at least one semester of study in biochemistry), and",
            "a personal statement demonstrating interest in and commitment to animal health, production and welfare and interest in and commitment to pursuing a career in the veterinary science profession and any experience working with animals and/or in other fields relevant to veterinary science, and",
            "a situational judgement test.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance in tertiary subjects in a science-based bachelor’s degree, with a 3:1 weighting placed on final year level subjects relative to penultimate year level subjects, and",
            "the personal statement, and",
            "completion of further, relevant studies (academic performance not considered), and",
            "Graduate Access Melbourne application, where applicable (domestic applicants only), and",
            "the situational judgement test.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required.",
            "Entry with Advanced Standing via the Veterinary Bioscience Major of the Bachelor of Science Degree at the University of Melbourne (Undergraduate Selection)",
            "The alternative pathway for entry to the Doctor of Veterinary Medicine is available to current undergraduate students who have completed two years of the Bachelor of Science degree at the University of Melbourne, including the specified prerequisite subjects.",
            "Applicants apply for the Doctor of Veterinary Medicine at the end of their second year and, if successful, are enrolled into subjects in the Veterinary Bioscience major of the Bachelor of Science. Students selected via this pathway who then successfully complete the Bachelor of Science, including all subjects in the Veterinary Bioscience major will be assured entry in to the Doctor of Veterinary Medicine program, with credit for all subjects at the Doctor of Veterinary Medicine at first year level (100 credit points). The selection point into the Doctor of Veterinary Medicine is therefore prior to the third year of the Bachelor of Science.",
            "1. In order to be considered for entry, applicants must have completed:",
            "the first and second years of the Bachelor of Science (or Bachelor of Biomedicine) degree at the University of Melbourne, including specified prerequisite subjects, and",
            "a personal statement demonstrating interest in and commitment to animal health, production and welfare and interest in and commitment to pursuing a career in the veterinary science profession and any experience working with animals and/or in other fields relevant to veterinary science, and",
            "a situational judgement test.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance in subjects from the Bachelor of Science or Bachelor Biomedicine degree at the University of Melbourne, with a 3:1 weighting placed on second (and any completed third-year) level subjects relative to first-year level subjects, and",
            "the personal statement, and",
            "Graduate Access Melbourne application, where applicable (domestic applicants only), and",
            "the situational judgement test.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required.",
            "NOTES",
            "For more detailed information on selection into the Doctor of Veterinary Medicine course and the Selection Guidelines, see: \n",
            "The Selection Committee will consider Graduate Access Melbourne applications from domestic graduates and undergraduates for Commonwealth Supported Places and Australian Fee Places in the Doctor of Veterinary Medicine course.  For more information on Graduate Access Melbourne, see:  and \n",
            "Successful graduate and undergraduate applicants must consent to be vaccinated against Q fever, or provide evidence of previous vaccination/inoculation against Q fever upon request.",
            "Graduate Degree Packages for High Achieving School Leavers",
            "The University of Melbourne offers Graduate Degree Packages to high achieving school leavers, allowing them to secure places (Commonwealth Supported Places for domestic students or International Fee Places for non-domestic students) in the Doctor of Veterinary Medicine course if they meet certain requirements.",
            "For a Commonwealth Supported Place or an International Fee Place, the applicant must:",
            "complete an Australian Year 12 or the International Baccalaureate (IB) in 2018 or a later year in Australia (or, for Australian citizens only, outside Australia)",
            "achieve an ATAR (or notional ATAR) of at least 98.50;",
            "apply for a University of Melbourne Graduate Degree Package for commencement in the year following completion of Year 12 or the IB via VTAC;",
            "enrol immediately or be granted deferral in the year following completion of Year 12 or the IB;",
            "complete the first and second years of the Bachelor of Science degree at the University of Melbourne, including specified prerequisite subjects;",
            "achieve a minimum weighted average mark of H2B (70%) across all level 1 subjects and a weighted average mark of H2B (70%) average across all level 2 subjects;",
            "at the time of enrolment in the Veterinary Bioscience major, submit a personal statement demonstrating interest and commitment to animal health, production and welfare and in pursuing a career in the veterinary science profession, and",
            "at the time of enrolment in the Veterinary Bioscience major, satisfactorily complete the situational judgement test (only for students in year 12 from 2020 onwards)",
            "commence the Doctor of Veterinary Medicine within 18 months of completing the undergraduate degree.",
            "Applicants should refer to the University Handbook for the additional entry requirements for the Bachelor of Science.",
            "Guaranteed Entry for High Achieving Domestic School Leavers",
            "High achieving domestic school leavers can secure Australian Full Fee-Paying Places in the Doctor of Veterinary Medicine course at the University of Melbourne, if they meet certain requirements.",
            "For a guaranteed Australian Full Fee-Paying Place, the applicant must:",
            "complete an Australian Year 12 or the International Baccalaureate (IB) in 2018 or a later year",
            "achieve an ATAR (or notional ATAR) of between 95.00 and 98.45;",
            "enrol in the Bachelor of Science degree at the University of Melbourne in the year following completion of Year 12 or the IB;",
            "complete the first and second years of the Bachelor of Science degree at the University of Melbourne, including specified prerequisite subjects;",
            "achieve a minimum weighted average mark of H2B (70%) across all level 1 subjects and a weighted average mark of H2B (70%) average across all level 2 subjects;",
            "apply for entry into the Veterinary Bioscience major at the end of the second year of the Bachelor of Science degree, and",
            "at the time of application, submit a personal statement demonstrating interest and commitment to animal health, production and welfare and in pursuing a career in the veterinary science profession, and",
            "following application, satisfactorily complete the situational judgement test (only for students in year 12 from 2020 onwards).",
            "Applicants should refer to the University Handbook for the additional entry requirements for the Bachelor of Science.",
            "For more information on Graduate Degree Packages and Guaranteed Entry for High Achieving Domestic School Leavers, see:",
            "https://study.unimelb.edu.au/find/courses/graduate/doctor-of-veterinary-medicine/entry-requirementsandhttps://study.unimelb.edu.au/study-with-us/understand-your-undergraduate-to-graduate-degree-pathways/from-secondary-school"
        ],
        "Inherent requirements (core participation requirements)": [
            "Students must comply with Fitness to Practice Rules, which are accessible fromSchedule 1of theStudent Fitness to Practice Policy (MPF1345).",
            "Veterinary medicine is a physically and mentally challenging profession in which practitioners are required to put the interest of animals above their own.  This necessitates commitment to a lifetime of service with dedication to continuous learning.",
            "The DVM course at the University of Melbourne is a four-year graduate degree accredited by theAustralasian Veterinary Boards Council, theRoyal College of Veterinary Surgeonsand theAmerican Veterinary Medical Association Council on Education.  Students who complete the course requirements of the DVM program are eligible to apply for registration as a veterinary practitioner within Australia and New Zealand, the United Kingdom and the United States of America.",
            "Students enrolled in the DVM course must develop the necessary skills to register as veterinary practitioners with theVeterinary Practitioners Registration Board of Victoria.  The course is designed to educate students on the foundation of knowledge, attitude, skills and behaviours that are required in veterinary practice.  Certain inherent requirements must be demonstrated by students in order to progress through the curriculum and ultimately receive the DVM degree, the qualification that provides the basis of a person’s application for registration to practise.",
            "The University of Melbourne and the Melbourne Veterinary School are committed to supporting students to pursue a veterinary education and to achieve both their potential and their career objectives.  The School is committed to making reasonable adjustments to teaching and learning, assessments, clinical practice and other activities to address the impact of students' disabilities and personal circumstances so that they are able to participate and succeed in the course.",
            "The School has developed a series of Inherent Requirement statements as a guide for prospective and current students.  These statements specify the requirements of the DVM program for student admission and progression.  The statements are clustered under eight domains: ethical behaviour, behavioural stability, legal, communication, cognition, sensory abilities, strength and mobility, and health and sustainable performance.",
            "Many of the activities associated with veterinary professional practice are time-sensitive, with practitioners requiring the capacity to perform certain activities within specified time limits to reduce or avoid risks to human safety and animal welfare.",
            "Students are also required to undertake clinical placement activities in mixed gender and mixed socioeconomic environments which reflect the Australian animal industry context.",
            "If you are intending to enrol in the veterinary course at the Melbourne Veterinary School, you should look at these inherent requirement statements and think about whether you may experience challenges in meeting the requirements.",
            "If you think you may experience challenges in your studies, you should discuss your concerns with a University course advisor or disability coordinator.  These staff members can work collaboratively with you to determine whether reasonable adjustments can be made to assist you to meet the Inherent Requirements.",
            "Students should note that a reasonable adjustment may include modification to assessment and the provision of additional support services, but the University cannot make an adjustment which would compromise the academic integrity of the DVM course or human or animal safety.  Part of the DVM course takes place at clinical sites off-campus where it may not be possible for either the University or placement host to make the same reasonable adjustments that are possible on campus.  This means that having a disability which prevents training in a particular context may preclude completion of course requirements and therefore prevent progression to practice.",
            "Once enrolled in the DVM course, students with a disability are encouraged to register with the Student Equity and Disability Support as early as possible.  The role of this service is to negotiate reasonable adjustments, following consultations with students and staff of the School, and to provide information and advice to students in this context.  If it is determined that inherent requirements cannot be met with reasonable adjustments, the University staff can provide guidance regarding other study options.",
            "There are eight categories of Inherent Requirements of the DVM course:",
            "Legal",
            "Behavioural and emotional stability",
            "Ethical and professional behaviour",
            "Communication",
            "Cognition",
            "Sensory abilities",
            "Strength and mobility",
            "Health and sustainable performance",
            "Some of these categories have multiple parts.",
            "Each Inherent Requirement is made up of the following levels:",
            "Introduction to the inherent requirement",
            "Description of the inherent requirement",
            "Explanation of why this is an inherent requirement of the course",
            "The nature of any adjustments that may be made to allow you to meet the requirement",
            "Examples of what you must be able to do to show that you have met the requirement.",
            "Inherent Requirement Statements",
            "Veterinary practice is mandated by specific  to enable the safe delivery of veterinary care.",
            "Students should demonstrates knowledge of and compliance with Victorian and Australian law and the professional  of the Veterinary Practitioners Registration Board of Victoria",
            "Justification of Inherent Requirement",
            "Knowledge, understanding and compliance with legislative and regulatory requirements and guidelines are necessary pre-requisites for clinical placements in order to reduce the risk of harm, to animals, to self and to others.",
            "Compliance with these professional guidelines and Victorian and Australian law ensures that students are both responsible and accountable for their actions.",
            "Adjustments",
            "Must be consistent with legislative and regulatory requirements",
            "Exemplars",
            "Complying with all relevant legislation, e.g. Veterinary Practice Act, Controlled Substances Act",
            "Inherent Requirement Statements",
            "Veterinary medicine is a profession in which practitioners must balance the welfare of animals, their owners and clients, and that of their colleagues, often in conflicting scenarios.",
            "Behavioural and emotional stability is required to function and adapt effectively and sensitively in such a demanding role.",
            "Students should demonstrate behavioural and emotional stability to work constructively in a diverse and changing academic and clinical environment.",
            "Students are expected, and will demonstrate the ability, to monitor their own mental and physical health and their behaviour, and to seek help when required.",
            "Students will demonstrate the ability to respond in a productive and professional way to the advice and direction of both University and placement supervisors with respect to enhancing their knowledge, skills and professional behaviour.   ",
            "Students must be aware of their professional limitations and be cognisant of when and where to seek assistance and advice.",
            "Justification of Inherent Requirement",
            "Behavioural and emotional stability is required to work individually and in teams in changing and unpredictable environments.",
            "Veterinary students will be exposed to emergency situations and animal suffering, and will be required to have behavioural stability to manage these events objectively and professionally.",
            "Veterinary students will observe owners experiencing emotional and financial distress, and will need to manage these occasions with empathy, respect and skilful detachment.",
            "Adjustments",
            "Must support stable, effective and professional behaviour in both academic and clinical settings",
            "Exemplars",
            "Being receptive and responding appropriately to constructive feedback",
            "Coping with own emotions and behaviour effectively when dealing with adverse clinical settings",
            "Seeking help when required for physical, behavioural or emotional support",
            "Inherent Requirement Statements",
            "Veterinary medicine is a profession governed by the t, with practitioners being both accountable and responsible for ensuring that their behaviour is professional in all contexts.",
            "Students must demonstrate knowledge of and engage in ethical behaviour in practice, consistent with the professional code of ethics and the professional expectations of University and workplace supervisors.",
            "Justification of Inherent Requirement",
            "Compliance with the codes, guidelines and policies facilitates:\n\n",
            [
                [
                    "safe, competent interactions and relationships for students and/or the people they engage with, including other students, professional staff, academic staff, clients and the general public.  This ensures the physical, psychological, emotional and spiritual well-being of the individual is not placed at risk.",
                    "the maintenance of the welfare of individual animals and populations of animals, ensuring their freedom from pain, hunger, thirst, heat, cold or other adverse conditions."
                ]
            ],
            "safe, competent interactions and relationships for students and/or the people they engage with, including other students, professional staff, academic staff, clients and the general public.  This ensures the physical, psychological, emotional and spiritual well-being of the individual is not placed at risk.",
            "the maintenance of the welfare of individual animals and populations of animals, ensuring their freedom from pain, hunger, thirst, heat, cold or other adverse conditions.",
            "Adjustments",
            "Must be consistent with professional codes, guidelines, regulations and policies and not result in unethical or unprofessional behaviour",
            "Must not impose an ethically unacceptable cost on the use of animals in teaching or research",
            "Exemplars",
            "Complying with University and Faculty policies and not being subject to findings of Academic or General Misconduct",
            "Complying with the behavioural expectations of colleagues and the veterinary profession so as to avoid unprofessional conduct",
            "Demonstrating appropriate behaviour with confidential information in classroom and clinical settings",
            "Identifying and reporting animal welfare concerns",
            "The DVM course requires effective, verbal, non-verbal and written communication skills.  Communication is bi- and multi-directional, between people and between people and animals.",
            "Verbal",
            "Inherent Requirement Statements",
            "Effective and efficient verbal communication, in English, is an essential requirement to ensure student and staff safety and for delivery of animal care.",
            "Effective verbal communication to direct and control animal behaviour is an essential requirement for preserving human safety and animal welfare.",
            "Student demonstrates:",
            "The ability to understand and respond to verbal communication, in English, accurately, appropriately and in a timely manner, including in noisy busy professional environments",
            "The ability to provide clear and timely instructions in the context of the situation, especially in the maintenance of occupational safety",
            "The ability to direct and interact with all animals by verbalising in a safe and confident manner",
            "Justification of Inherent Requirement",
            "Adequate communication with clients is essential to the diagnosis and management process in veterinary medicine.",
            "Communication may be restricted to verbal because of physical limitations of the individual.",
            "Speed and interactivity of communication may be critical for self and client safety or for the welfare and treatment of animals.",
            "Directly influencing animal behaviour through verbalisation is necessary to ensure human and animal safety.",
            "Timely, accurate and effective delivery of instructions is critical to client safety and animal safety, treatment and welfare.",
            "Adjustments",
            "Must address effectiveness, timeliness, clarity and accuracy issues to ensure personnel safety and animal welfare",
            "Exemplars",
            "Participating in tutorials, simulations and clinical discussions",
            "Responding appropriately to a care request in the clinical environment",
            "Safely and efficiently directing the movement of herds and flocks in a field setting",
            "Non-verbal",
            "Inherent Requirement Statements",
            "Effective non-verbal communication which is clear and attentive is fundamental to the safety of people handling animals and to the animals being restrained or handled.",
            "Effective non-verbal communication with other students, staff, clients and colleagues must be non-judgemental, empathetic, honest, culturally sensitive and respectful.",
            "Student demonstrates:",
            "The capacity to recognise, interpret and respond appropriately to behavioural cues of people and domestic animals",
            "Consistent and appropriate awareness of own behaviours",
            "Sensitivity to individual differences",
            "Ability to direct and safely interact with all animals in a safe and confident manner.  ",
            "Justification of Inherent Requirement",
            "The ability to observe and understand non-verbal cues assists with building a rapport with people and gaining their trust and respect in academic and professional relationships.",
            "Displaying appropriate facial expressions, maintaining eye contact, and being mindful of space, time boundaries and body movements and gestures promote trust in academic and professional relationships.",
            "Being sensitive to individual differences displays respect for and empathy to others and develops trusting relationships.",
            "The ability to observe and understand clients’ non-verbal cues is essential for safe and effective observation of an animal’s clinical signs and behavioural reactions, to facilitate the diagnosis and treatment.",
            "Displaying consistent and appropriate facial expressions, eye contact, body movements and gestures, with awareness of fear and flight distances, promotes safe animal handling and protects the welfare of the animals.",
            "Adjustments",
            "Must maintain the capacity to recognise, respond to or initiate effective non-verbal communication or its equivalent in a timely and appropriate manner",
            "Must maintain the capacity to interact safely with domestic animals using non-verbal cues",
            "Exemplars",
            "Recognising and responding appropriately in classroom situations",
            "Recognising and responding appropriately to cues in the clinical environment",
            "Safely and efficiently directing the movement of herds and flocks in a field setting",
            "Written",
            "Inherent Requirement Statements",
            "Effective written communication, in English, is a fundamental veterinary professional and legal responsibility.",
            "Student demonstrates:",
            "Capacity to construct coherent written documents, in English, appropriate to the circumstances.",
            "Justification of Inherent Requirement",
            "Construction of written text-based assessment tasks that meet the required academic standards is necessary to convey knowledge and understanding of relevant subject matter for professional practice.",
            "Accurate written communication, including medical record keeping, is vital to provide consistent and safe patient care.",
            "Adjustments",
            "Must meet necessary standards of clarity, accuracy, accessibility, transferability and portability to ensure effective recording and transmission of information in both academic and clinical settings",
            "Exemplars",
            "Constructing an essay to the required academic standards of the DVM Course",
            "Constructing a veterinary medical record in a timely manner that meets professional standards",
            "Providing written advice to a client",
            "The DVM course requires the accumulation of knowledge utilising cognitive, literacy and numeracy skills.",
            "Knowledge and Cognitive Skills",
            "Inherent Requirement Statements",
            "Ability to learn, accumulate knowledge and utilise that knowledge using a variety of cognitive skills, to provide safe and competent veterinary care",
            "Student demonstrates:",
            "Self-motivated, self-directed learning activity",
            "Capacity to locate appropriate and relevant information",
            "Ability to process information relevant to practice",
            "Ability to integrate and implement knowledge in practice",
            "Justification of Inherent Requirement",
            "Safe and effective delivery of veterinary care is based on comprehensive knowledge that must be sourced, understood, processed and applied appropriately.",
            "Adjustments",
            "Must ensure that a clear demonstration of both knowledge accumulation and development of the cognitive skill to use that knowledge is not compromised or impeded, and is timely",
            "Exemplars",
            "Ability to conceptualise and use appropriate knowledge in response to academic assessment tasks",
            "Appropriately applying knowledge of policy and procedures in the clinical setting",
            "Appropriately triaging emergency presentations in clinical settings",
            "Literacy (Language)",
            "Inherent Requirement Statements",
            "Competent literacy skills are essential to provide safe and effective delivery of veterinary care and to satisfy the expectations regarding skills for an  degree.",
            "The University of Melbourne provides tuition in English and requires all students to undertake study, submit assignments and sit examinations in English.",
            "Student demonstrates:",
            "Ability to accurately acquire information and convey appropriate and effective messages",
            "Ability to read and comprehend a range of literature and information",
            "Ability to comprehend complex scientific information and relay or describe it in lay terms",
            "Capacity to understand and construct written text in a scholarly manner",
            "Ability to independently:",
            "\n\n",
            [
                [
                    "analyse critically, reflect on and synthesise complex information, problems, concepts and theories",
                    "research and apply established theories to a body of knowledge or practice",
                    "interpret and transmit knowledge, skills and ideas to specialist and non-specialist audiences"
                ]
            ],
            "analyse critically, reflect on and synthesise complex information, problems, concepts and theories",
            "research and apply established theories to a body of knowledge or practice",
            "interpret and transmit knowledge, skills and ideas to specialist and non-specialist audiences",
            "Justification of Inherent Requirement",
            "The ability to acquire information and to accurately convey messages is fundamental to ensure safe and effective assessment, diagnosis, treatment and delivery of veterinary care.",
            "The ability to read, decode, interpret and comprehend multiple sources of information is fundamental for safe and effective delivery of veterinary care.",
            "Adjustments to Address Literacy Issues",
            "Must meet accuracy, clarity and availability requirements and demonstrate a capacity to effectively comprehend, apply and communicate information in a timely manner relevant to the situation",
            "Exemplars",
            "Conveying a spoken message accurately and effectively in a clinical setting",
            "Paraphrasing, summarising and referencing in accordance with appropriate academic conventions in written assignments",
            "Producing accurate, concise and clear veterinary medical records which meet legal requirements",
            "Numeracy",
            "Inherent Requirement Statements",
            "Competent and accurate numeracy skills are essential for safe and effective animal care.",
            "Student interprets and correctly applies data, measurements and numerical criteria.",
            "Justification of Inherent Requirement",
            "Competent application of numeracy skills is essential in veterinary medicine to facilitate the safe and effective delivery of animal care.",
            "Adjustments",
            "Must demonstrate a capacity to interpret and apply concepts and processes appropriately in a timely, accurate and effective manner",
            "Exemplars",
            "Performing accurate drug dosing and withholding time calculations",
            "Demonstrate accurate interpretation of patient's clinical chemistry and haematology results",
            "The DVM course requires adequate visual, auditory and tactile abilities.  Students with disabilities of visual, auditory and tactile capabilitiesmustdiscuss these with the disability coordinator prior to enrolling in the course.  Potential for reasonable adjustments to promote success in the course are possible only if applied in a prospective manner.",
            "If such a disability becomes evident whilst undertaking the course, the student is expected to discuss this and its potential implications with the course co-ordinator at the earliest sign, to enable the student and the University to explore what options may be feasible for reasonable adjustment to enable continuation in the course.   However, it must be acknowledged that, if a reasonable adjustment is not possible, it might be necessary for the student to transfer to an alternative course of study.",
            "Visual",
            "Inherent Requirement Statements",
            "Adequate visual acuity is required to provide safe and effective veterinary care.",
            "Visual acuity with maximal correction of N8 and/or 6/18 (or better) is required for veterinary practice.  Students whose vision is insufficient to meet these criteria or who have significant other visual problems (such as visual field defects, nystagmus etc.) may require assessment by an ophthalmologist.",
            "Justification of Inherent Requirement",
            "Sufficient visual acuity is necessary to demonstrate the required range of clinical skills, through the performance of relevant tasks and assessments whilst maintaining consistent, accurate and safe care to self and others.",
            "Visual observations, examination and assessment are fundamental to safe and effective veterinary practice.",
            "Adjustments",
            "Must address the need to perform the full range of tasks involved in veterinary practice.  Any strategies to address the effects of a vision impairment must be effective, consistent and not compromise treatment or safety.",
            "Exemplars",
            "Accurately drawing up medication to administer",
            "Observing and detecting subtle changes in a patient's response to medical procedures",
            "Sufficient visual acuity to read small print on ampoules or similar, read a monitor at a distance of 2 metres and respond to visual alarms",
            "Auditory",
            "Inherent Requirement Statements",
            "Adequate auditory ability is required to provide effective and safe veterinary care.",
            "Student demonstrates sufficient aural function to undertake the required range of tasks.",
            "Justification of Inherent Requirement",
            "Sufficient auditory ability is necessary to monitor, assess and manage animal health needs consistently and accurately.",
            "Auditory assessments and observations are fundamental to safe and effective veterinary practice.",
            "Adjustments",
            "Must address the need to perform the full range of tasks involved in clinical practice.  Any strategies to address the effects of hearing impairment must be effective, consistent and not compromise treatment or safety.",
            "Exemplars",
            "Accurately detecting heart sounds by auscultation",
            "Accurately undertaking a blood pressure measurement by auscultation",
            "A student, wearing functioning hearing aids (if required), should demonstrate the ability to understand the human voice at 1 metre with less than 40 db loss across speech frequencies.",
            "Tactile",
            "Inherent Requirement Statements",
            "Sufficient tactile ability is required to perform competent and safe veterinary medicine and surgery.",
            "Student demonstrates sufficient tactile function to undertake the required range of skills and assessments.",
            "Justification of Inherent Requirement",
            "Sufficient tactile ability is necessary to monitor, assess and detect animals’ physical characteristics and act on any abnormalities detected to provide safe and appropriate medical care.",
            "Tactile assessments and observations are fundamental to safe and effective veterinary practice, including surgery.",
            "Adjustments",
            "Must ensure the capacity to make effective assessments of physical characteristics and abnormalities within safe time frames",
            "Exemplars",
            "Detecting any changes in circulation observations (e.g. temperature and pulse palpation)",
            "Conducting a physical assessment and detecting any anatomical abnormalities",
            "Demonstrating sufficient fine touch to palpate vessels and organs of cattle and horses using rectal palpation",
            "Completing surgical procedures such as ovariohysterectomy in dogs",
            "The DVM course requires strength and mobility involving fine and gross motor skills.",
            "Gross Motor Skills",
            "Inherent Requirement Statements",
            "Utilisation of appropriate gross motor skills is required to undertake appropriate veterinary clinical care and animal handling.",
            "Student demonstrates the ability to perform gross motor skills to function within the scope of veterinary practice.",
            "Justification of Inherent Requirement",
            "Sufficient gross motor skills are necessary to perform, coordinate and prioritise care.  Tasks that involve gross motor skills include lifting, carrying, pushing, pulling, standing, walking and running, twisting and bending, and restraining animals.  Students must be able to demonstrate and perform these tasks consistently and safely to reduce the risk of harm to self and others, and to the animals.",
            "Adjustments",
            "Must facilitate functional effectiveness, safety of self and others and a capacity to provide appropriate care",
            "Exemplars",
            "Performing a physical assessment such as percussion and/or palpation of body parts",
            "Escaping quickly from a box stall",
            "Controlling and trotting a horse using a halter and/or twitch",
            "Operating a cattle crush",
            "Restraining sheep",
            "Fine Motor Skills",
            "Inherent Requirement Statements",
            "Veterinary practice requires manual dexterity, and possession of fine motor skills is fundamental to the provision of adequate clinical care.",
            "Student demonstrates the ability to use fine motor skills to provide safe and effective diagnosis, treatment and clinical care.",
            "Justification of Inherent Requirement",
            "Sufficient fine motor skills are necessary to perform and coordinate veterinary tasks.  Tasks that include fine motor skills include being able to grasp, press, push, turn, squeeze and manipulate various objects and animals.  Students must be able to demonstrate and perform these tasks consistently and safely to reduce the risk of harm to self and others, and to ensure animal welfare.",
            "Adjustments",
            "Must facilitate functional effectiveness, safety to self and others and a capacity to provide appropriate care to animals",
            "Exemplars",
            "Manipulating instruments in diagnostic procedures",
            "Performing treatment techniques (e.g. cannulation and/or venipuncture)",
            "Safely and gently holding and restraining small animals such as rats, mice and birds",
            "Completing surgical procedures such as ovariohysterectomy in dogs",
            "Inherent Requirement Statements",
            "Veterinary practice requires both physical and mental performance at a consistent and sustained level to meet the needs for animal care, over time.",
            "Current vaccinations for tetanus and/or documented immunity to Q Fever are requirements for enrolment.  The School may add to this requirement during a student’s enrolment= if there is potential for zoonotic disease (e.g. if a student chooses to work in a rabies endemic area, rabies pre-vaccination would be required).",
            "Veterinary practice requires students to be conscious and aware at all times when interacting with animals and clients.  Unexpected interruptions to consciousness place self, others and animals at risk.",
            "Student demonstrates:",
            "A consistent and sustained level of physical energy to complete a specific task in a timely manner and over time",
            "The ability to perform repetitive activities with a level of concentration that ensures a capacity to focus on the activity until it is completed appropriately",
            "The capacity to maintain consistency and quality of performance throughout the designated period of duty   ",
            "There must be no risk of interruptions of consciousness that would present a risk to self, others or animals.",
            "Justification of Inherent Requirement",
            "Personal protection to prevent student’s acquisition of common transmissible zoonotic diseases is fundamental to maintaining health and sustainable performance.",
            "Sufficient physical and mental endurance is an essential requirement needed to perform multiple tasks in an assigned period to provide safe and effective animal care without compromise.",
            "Uncontrolled loss of consciousness in a veterinary student will put people and animals at significant risk.",
            "Adjustments",
            "Must not compromise the prevention of preventable zoonotic diseases",
            "Must ensure that performance is consistent and sustained over a negotiated period",
            "Repeated periods of loss of consciousness (e.g. due to epilepsy, narcolepsy or repetitive fainting) will require careful assessment and effective treatment.",
            "Exemplars",
            "Participating in tutorials, lectures and practical classes throughout the day",
            "Providing consistent care over a negotiated time frame",
            "Being able to complete any surgical procedure that has been initiated",
            "Students remaining conscious throughout the study and work period",
            "1. Johnson, A., Allan,T., Phillips,K., Azzopardi,T., Dickson,C., Goldsmith,M & Hengstberger-Sims, C. (2011). Inherent Requirements of Nursing Education (IRONE), Western Sydney University School of Nursing & Midwifery and Student Equity & Disability Services.",
            "2. https://www.westernsydney.edu.au/ir/inherent_requirements/inherent_requirements_for_medicine_courses",
            "3. University of Melbourne MDHS Fitness to Practice Policy",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Commonwealth 2005) and Students Experiencing Academic Disadvantage Policy, academic requirements for the subjects in the Doctor of Veterinary Medicine course are articulated in the Overview, Intended Learning Outcomes, Generic Skills and Assessment entries for each subject. The University is dedicated to supporting students with special requirements.  Further information on the support that is available can be found at the Student Equity and Disability Support website:https://students.unimelb.edu.au/explore/student-equity.",
            "Do I have to make a declaration or disclosure to the University about my disability?",
            "No.  The University does not require students to disclose any form of disability at any stage, whether as part of the application process or as an enrolled student.",
            "What should I do if I am worried about my ability to successfully fulfil a listed inherent requirement?",
            "You may wish to contact the Student Equity and Disability Support (SEDS) at the University to discuss your specific issue.  SEDS may be able to provide advice as to the reasonable adjustments which may be made.",
            "What is a reasonable adjustment?",
            "The University of Melbourne is required by the Disability Discrimination Act 1992 (Commonwealth), the Disability Standards for Education 2005 (Commonwealth) and the Equal Opportunity Act 2010 (Victoria) to ensure that reasonable adjustments are made for students with disabilities.",
            "“Reasonable adjustments” are modifications or accommodations made by the University that assist a student with a disability to participate in their course or access University facilities on the same basis as someone without a disability.  A reasonable adjustment might be an aid to vision or hearing, allowing extra time for written examinations or an adjustment to hours of fieldwork.  The role of SEDS is to support students with disabilities, including assisting in the negotiation of reasonable adjustments for them.",
            "Any such adjustments must be reasonable and cannot compromise the academic integrity of a course. Reasonable adjustments are provided to assist students to fulfil the inherent requirements, not as a substitute for those requirements.",
            "Can I enrol even if I am not sure I will be able to fulfil some of the inherent requirements?",
            "Yes.  It is your decision as to whether or not you wish to enrol, if you are offered a place in the DVM course.  It is unlawful for the University to make determinations regarding enrolment solely on the basis of disability, or to discriminate against a student with a disability in other ways.",
            "What happens if I do enrol and I am unable to fulfil some of the inherent requirements?",
            "The School is accountable to external accreditation and registration bodies (e.g. the Veterinary Practitioners Registration Board of Victoria) that its veterinary graduates meet registration requirements.",
            "If you are unable to fulfil the inherent requirements, even with reasonable adjustments having been made, you may fail a core component of the DVM.  Should this occur, you would not be able to complete the course, graduate with a DVM degree or be registered as a veterinarian.",
            "It is a requirement of the DVM course that students fully participate in teaching activities involving the use of animals.  There are no exceptions to this requirement.",
            "The University has a policy regarding the conscientious objection to animal use.  However, within the DVM course, activities involving the use of animals for teaching purposes are essential to the development of multiple veterinary skills and attributes, and the requirement for all students to fully and actively participate cannot be waived.",
            "Additional requirements of the DVM course are that students agree to be vaccinated against Q fever and tetanus. Students selected into the DVM course must also complete the on-line Academic Integrity Module within their first semester of enrolment.",
            "Attendance at practical classes, tutorials, case studies, workshops and clinical rotations is compulsory in the DVM course.  Teaching staff may take a roll to record attendance.  Students failing to comply with attendance requirements may be excluded from examinations.  Alternatively, their results may be withheld, and additional examinations or assignments assigned to demonstrate that they have achieved the intended learning outcomes of the classes.",
            "Students in the DVM course must be capable of working effectively both as individuals and as members of teams.  At all times, they are expected to behave in a respectful and collegial fashion with other students and with academic, administrative and technical staff of the Faculty, members of the veterinary profession, representatives of animal and allied industries, government authorities, animal owners and members of the public."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "The veterinary program at the University of Melbourne is accredited by the Australasian Veterinary Boards Council, the Royal College of Veterinary Surgeons (London, United Kingdom), and the American Veterinary Medical Association. Accreditation is reviewed on a 7 year cycle for all accredited veterinary schools. The accrediting authorities have been informed of the changes to the degree structure through the customary annual reporting process. A formal review of the program will occur in line with the normal accreditation process.",
            "Australiasian Veterinary Boards Council",
            "The veterinary program at the University of Melbourne is accredited by the Australasian Boards Council, the Royal College Veterinary Surgeons (London, United Kingdom), and the American Veterinary Medical Association.  Accreditation is reviewed on a 7 year cycle for all accredited veterinary schools.   The accrediting authorities are kept informed of all changes to the degree structure through he customary annual reporting process.  A formal review of the program occurs in line with the normal accreditation process."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": []
        },
        "Subject options": {
            "overview": [
                "All subjects in the Doctor of Veterinary Medicine course are core.",
                "Across the first and second year of the course, students must undertake 12 weeks of animal husbandry/pre-clinical extramural placements across extensive, intensive, and other types of sites. Students undertake preclinical and animal husbandry WIL in an extramural workplace settings of each of the following species/disciplines: equine, production animals, and companion animals."
            ],
            "YEAR ONE (DVM 1):": {
                "overview": [
                    "All of:",
                    [
                        "VETS90122",
                        "VETS90121",
                        "VETS90120",
                        "VETS90123",
                        "VETS90124",
                        "VETS90125",
                        "VETS90126",
                        "VETS90127"
                    ]
                ]
            },
            "YEAR ONE (VIA THE VETERINARY BIOSCIENCE MAJOR in the B-SCI)": {
                "overview": [
                    "Students enrolled in the Bachelor of Science - Veterinary Bioscience Major should enrol in all of the following:",
                    [
                        "VETS30029",
                        "VETS30016",
                        "VETS30030",
                        "VETS30031",
                        "VETS30014",
                        "VETS30018",
                        "VETS30017",
                        "VETS30032"
                    ],
                    "YEAR TWO (DVM 2):",
                    "All of:",
                    [
                        "VETS90128",
                        "VETS90129",
                        "VETS90130",
                        "VETS90131",
                        "VETS90133",
                        "VETS90132",
                        "VETS90134",
                        "VETS90135",
                        "VETS90136",
                        "VETS90137",
                        "VETS90138",
                        "VETS90139",
                        "VETS90140"
                    ],
                    "YEAR THREE (DVM 3):All of:",
                    [
                        "VETS90141",
                        "VETS90142",
                        "VETS90144",
                        "VETS90145",
                        "VETS90143",
                        "VETS90078",
                        "VETS90147",
                        "VETS90149",
                        "VETS90148",
                        "VETS90150",
                        "VETS90146",
                        "VETS90079"
                    ],
                    "Across the third and fourth year of the of the course, students must undertake 21 weeks of clinical extramural placements including experience across the following species: equine, production animals, and companion animals.",
                    "The third year of the DVM course incorporates Pre-Tracks. Pre-Tracks provide opportunities for students to undertake practical classes and activities in a chosen area of veterinary science to complement their core training. The four Pre-Tracks available to students are Production Animal, Small Animal, Equine, and Government, Industry and Conservation Health. Pre-Track practical classes and activities are components of VETS90141 Veterinary Professional Practice 3 and VETS90146 Veterinary Professional Practice 4 within DVM 3.",
                    "In the fourth year of the DVM course, students undertake four weeks of Track activities in Production Animal, Small Animal, Equine, or Government, Industry and Conservation Health to further enhance their clinical skills and experience and to expand their professional networks.  Students have complete flexibility as to which Track they select at DVM 4 level.",
                    "For further information about Pre-Tracks and Tracks, see:https://study.unimelb.edu.au/find/courses/graduate/doctor-of-veterinary-medicine/where-will-this-take-me/"
                ]
            },
            "YEAR FOUR (DVM 4):": {
                "overview": [
                    [
                        "VETS90096"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}