{
    "Course name": "Doctor of Veterinary Science",
    "Course code": "DH-VSC",
    "Overview text": [
        "Candidates for the Doctor of Veterinary Science (DVSc) have undertaken original scientific work to the extent that they have authoritative standing in that field and have made a substantial published contribution to Veterinary Science. The work need not be limited to a particular field of research, but it would be expected that a particular field be covered in depth. Some unpublished work may be included.",
        "An applicant may provide their published work in an unbound submission to establish whether the work meets the criteria for acceptance of candidature. Publications are then put together to form a thesis which is examined by at least two examiners, one or both of whom are external to the Faculty of Veterinary and Agricultural Sciences. The published contributions would in large part be original papers published in refereed journals of high standing.",
        "The University simply acts as an examining body for this degree and no time is spent as an enrolled candidate in the Melbourne Veterinary School.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Doctor of Veterinary Science",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "Duration and credit points not applicable for this course."
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "A candidate for the degree of Doctor of Veterinary Science must be a graduate in veterinary science of at least three years' standing and have made substantial published contributions to veterinary science."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at theStudent Equity and Disability Support website."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Candidates for the Doctor of Veterinary Science (DVSc) have undertaken original scientific work to the extent that they have authoritative standing in that field and have made a substantial published contribution to Veterinary Science. The work need not be limited to a particular field of research, but it would be expected that a particular field be covered in depth. Some unpublished work may be included.",
                "An applicant may provide their published work in an unbound submission to establish whether the work meets the criteria for acceptance of candidature. Publications are then put together to form a thesis which is examined by at least two examiners, one or both of whom are external to the Faculty of Veterinary and Agricultural Sciences. The published contributions would in large part be original papers published in refereed journals of high standing."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}