{
    "Course name": "Doctor of Optometry",
    "Course code": "MC-DOPTOM",
    "Overview text": [
        "Optometrists are independent, primary health care professionals trained to examine the eyes and visual system. Optometrists diagnose, treat and manage diseases and injuries of the eye and associated structures. Optometrists are experts in the management of vision disorders, and in the correction of reduced vision. Numerous systemic conditions affect vision and ocular structures, so optometrists also play an important role in identifying general health disorders. Optometrists prescribe spectacles, contact lenses, medications for ocular conditions, vision therapy, and low vision rehabilitation.",
        "The Doctor of Optometry (OD) is a masters-level professional degree. The OD program is the first of its kind in the southern hemisphere, creating a new benchmark in optometric education. It is an internationally recognised qualification with full accreditation from the Optometry Council of Australia and New Zealand. Completion of the OD satisfies the legislative requirements that permit graduates to register as optometrists in all states and territories of Australia and in New Zealand. The qualification also affords the opportunity, either with or without further study and examination, to register to practice in other countries around the world.",
        "The OD is a four-year full-time program consisting of a combination of on-campus teaching and clinical placements. Clinical studies commence in first year and gradually increase to become the main learning activities in the final year. The course covers the basic and applied optical, visual, and biomedical sciences that underpin optometry.",
        "A research project, with clinical relevance, is conducted as a required component of the degree. Students will typically be given the opportunity to undertake clinical training at metropolitan, rural and overseas sites as part of their final year of study.",
        "Last updated: 19 December 2023"
    ],
    "Overview table": {
        "Award title": "Doctor of Optometry",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "072811B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "400 credit points",
        "Duration": "48 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.In order to be considered for entry, applicants must have completed",
            "an undergraduate degree in any discipline, with studies to have been completed within 10 years of commencing the Doctor of Optometry Or\n",
            "for applicants whose most recently completed undergraduate degree was completed 10 or more years before January 1st of the year in which the applicant intends to commence the Doctor of Optometry, a Graduate Diploma, Master or PhD degree, or equivalent, completed within 10 years of commencing the Doctor of OptometryAnd\n",
            "three subjects at level 2 or level 3 (or equivalent) from one or more relevant biological science disciplines with subjects to have been completed within 10 years of commencing the Doctor of Optometry.",
            "one of either the GAMSAT (Graduate Australian Medical School Admissions Test), the MCAT (Medical College Admissions Test) or the OAT (Optometry Admission Test (USA), no more than two years before the date of commencement of the Doctor of Optometry.Meeting these requirements does not guarantee selection.\n",
            "2.In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the GAMSAT or MCAT or OAT.",
            "3.The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4.Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.Note:1. Successful applicants with relevant prior study or professional practice may be granted up to 200 points of advanced standing towards the Doctor of Optometry as follows:100 points of advanced standing will normally be granted to applicants with an undergraduate degree with a major in optometry or vision science, or equivalent;200 points of advanced standing will normally be granted to applicants who are registered as an optometrist with the Optometry Board of Australia and have at least three years of documented clinical practice as a registered optometrist within the last ten years.",
            "2. Please note that results for 2020 subjects completed before the COVID-19 pandemic will be included in entry score calculations. Results for honours completed in 2020 will be included in entry score calculations for 2022 and all future intakes. All other 2020 subject results will be excluded from entry score calculations for 2022 and all future intakes.",
            "If an applicant completed their final year of undergraduate study in 2020, weightings will be applied by weighting the penultimate year by 1, and the final year subjects completed before the pandemic by 2.",
            "If an applicant completed their penultimate year of undergraduate study in 2020, weightings will be applied by weighting the penultimate year subjects completed before the pandemic by 1 and the final year by 2.",
            "For the avoidance of doubt, please note that subjects from all other study periods will be used in entry score calculations.",
            "3. Graduate Degree Packages for School Leavers:",
            "The University of Melbourne offers Graduate Degree Packages to high achieving school leavers, allowing them to secure places (Commonwealth Supported places for domestic students or International fee places) in the Doctor of Optometry provided that they meet certain requirements.",
            "For a Commonwealth Supported Place or International Fee Place, the applicant must:",
            "complete an Australian Year 12 or the International Baccalaureate (IB) in 2018 or later either:",
            "—in Australia; or",
            "—outside Australia and be an Australian citizen;",
            "achieve an ATAR (or notional ATAR) of at least 99.00;",
            "apply for a University of Melbourne Graduate Degree Package for commencement in the year following completion of Year 12 or IB via VTAC;",
            "enrol immediately or be granted deferral in the year following Year 12;",
            "successfully complete a Bachelor of Biomedicine or Science at the University of Melbourne including all the specified prerequisite subjects;",
            "achieve a minimum weighted average mark of H2A (75%) in their undergraduate degree;",
            "pass on the first attempt any subject course prerequisites taken at the University of Melbourne; and",
            "commence the Doctor of Optometry within 18 months of completing the undergraduate degree.",
            "Applicants eligible for entry via a Graduate Degree Package will not be required to complete the GAMSAT. The exclusion of some subjects in 2020 due to the COVID pandemic as outlined above (note 2) also applies to weighted average mark calculations for applicants under the Graduate Degree Package pathway.",
            "Applicants should refer to the University handbook for the additional entry requirements for the undergraduate degrees in the Graduate Degree Package."
        ],
        "Inherent requirements (core participation requirements)": [
            "Students must comply with Fitness to Practice Rules, which are accessible fromSchedule 1of theStudent Fitness to Practice Policy (MPF1345).",
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Student Support and Engagement Policy, academic requirements for this subject are articulated in the Subject Overview, Learning Outcomes, Assessment and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support:http://services.unimelb.edu.au/disability",
            "It is a requirement of the course that students will perform clinical procedures on their peers, and have clinical procedures performed on them by their peers.",
            "All students in the Doctor of Optometry (OD) course must possess the intellectual, ethical, physical and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence at graduation required by the Department of Optometry and Vision Sciences and the Australia Health Practitioner Registration Agency.",
            "A student with a disability may be asked to provide independent medical or other clinical assessments of the disability and its possible impact on the ability of the student to successfully complete the course, before being accepted into the course. This statement would be treated in confidence with only those on the admissions committee and Disability Liaison having access to the document. (Deliberate misinformation about the student’s ability to successfully complete the course will be regarded as unprofessional practice and treated as such.)",
            "While the Department of Optometry and Vision Sciences will make reasonable adjustments to minimise the impact of a disability, all students must be able to participate in the program in an independent manner. It is not reasonable for students to use an intermediary as an adjustment to compensate for a disability impacting on any of the five categories listed below. In the clinical environment there is a primary duty of care to the patients, and the needs of students cannot compromise this. It is expected that all students will be able to participate fully in all classroom based learning activities and to successfully fulfil the clinical assessment and self-study requirements of the course. The presence of a disability will not automatically entitle the student to preferential treatment in clinical place allocation.",
            "A candidate for the OD must have abilities and skills in the following five categories:",
            "1. \nObservation:Practical Classes: The student must be able to observe mandatory demonstrations and experiments in the designated subjects.Clinical Work: The student must be able to observe a patient accurately at a distance and close at hand. Observation necessitates the functional use of the senses of vision, hearing and somatic sensation. It is enhanced by the functional use of the sense of smell.",
            "2. \nCommunication:Practical Classes: The student must be able to hear and comprehend instructions in practical sessions and be able to clearly and independently communicate knowledge and application of the principles and practices of the subject during assessment tasks.Clinical Work: A student must be able to hear, speak to, and observe patients in order to elicit information and perceive nonverbal communications. A student must be able to communicate effectively and sensitively with patients in both oral and written forms. The student must also be able to communicate effectively and efficiently in both oral and written forms with all health care practitioners involved in patient management (including the use of telephones and computers).",
            "3. \nMotor:Practical Classes: A student must be able to undertake the motor requirements for any mandatory practical sessions. Such actions require coordination of both gross and fine muscular movements, equilibrium, and functional use of the senses of touch and vision.Clinical Work: Students should have sufficient motor function to elicit information from patients by clinical examination. Such actions require coordination of both gross and fine muscular movements, equilibrium, and functional use of the senses of touch and vision.",
            "4. \nIntellectual-Conceptual, Integrative and Quantitative Abilities:Practical Classes: The student is expected to have the ability to develop problem-solving skills and demonstrate this ability in practical sessions. These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving requires all of these intellectual abilities. Clinical Work: The student is expected to have the ability to develop problem-solving skills and demonstrate the ability to establish management plans and priorities. These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving requires all of these intellectual abilities.",
            "5. \nBehavioural and Social Attributes:Practical Classes: A student must possess the emotional health required for full utilization of his/her intellectual abilities, the exercise of good judgement, and the prompt completion of all required tasks.Clinical Work: A student must possess the emotional health required for full utilization of his/her intellectual abilities, the exercise of good judgement, the prompt completion of all responsibilities attendant to the diagnosis and care of patients, and the development of mature, sensitive, and effective relationships with patients and colleagues."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Upon completion of the Doctor of Optometry you can submit an application to register and practice as an optometrist in all states and territories of Australia and in New Zealand.",
            "This course prepares students to meet the registration requirements of the Optometry Board of Australia. More information on this official body can be found at the following website -http://www.optometryboard.gov.au/"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete 400 credit points over the 4-year program. These 400 points of credit are accumulated from a compulsory series of six core subjects totalling 100 points per year.",
                "Doctor of Optometry 1st year(100 points): Covers the basic vision sciences and pre-clinical optometry training.Doctor of Optometry 2nd year(100 points): Covers the applied clinical vision sciences and clinical optometry training, as well as research in vision and optometry.Doctor of Optometry 3rd year(100 points): Covers further applied clinical vision sciences and clinical optometry training, as well as clinical optometry practice.Doctor of Optometry 4th year(100 points): Covers advanced clinical optometry practice"
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Doctor of Optometry 1st year": {
            "overview": [
                "Compulsory subjects:",
                [
                    "OPTO90027",
                    "OPTO90024"
                ],
                "Subject by invitation only:",
                [
                    "OPTO90029"
                ]
            ]
        },
        "Doctor of Optometry 2nd year": {
            "overview": [
                "Compulsory subjects:",
                [
                    "OPTO90023",
                    "OPTO90025"
                ]
            ]
        },
        "Doctor of Optometry 3rd year": {
            "overview": [
                "Compulsory subject:",
                [
                    "OPTO90026"
                ]
            ]
        },
        "Doctor of Optometry 4th year": {
            "overview": [
                "Compulsory subject:",
                [
                    "OPTO90028"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "On completion, students may wish to apply for entry into a research higher degree program."
    ]
}