{
    "Course name": "Doctor of Laws",
    "Course code": "DH-LLD",
    "Overview text": [
        "The Doctor of Laws (LLD) is the highest qualification available by examination at Melbourne Law School. The work submitted for examination must be of such standard that it makes a substantial and original contribution to legal scholarship and gives the candidate authoritative standing in their field of research."
    ],
    "Overview table": {
        "Award title": "Doctor of Laws",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "Duration and credit points not applicable for this course."
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "Applicants must be a graduate in Law of the University of Melbourne of at least four years' standing; or a graduate of another university who has held a recognised degree for at least four years and received adequate training for legal scholarship.",
            "Applications to enrol in the degree normally follow an invitation from Melbourne Law School to individuals of considerable seniority and with a connection to Melbourne Law School.",
            "Applicants must also meet theUniversity's English language requirements.",
            "A formal application for admission to candidature for the LLD comprises a nomination by a Melbourne Law School academic. The nomination should be addressed to the Dean of Melbourne Law School.",
            "The proposer should have sufficient familiarity with the proposed candidate and the candidate's field of research to enable the proposer to recommend that the quality of the work(s) to be submitted warrants the award of LLD.",
            "The proposer must provide the following:",
            "information that demonstrates that the proposed candidate is eligible for admission LDD candidature;",
            "a statement expressing why the proposed candidate’s work is ‘a substantial and original contribution to legal scholarship and gives the candidate authoritative standing in their field of research;",
            "a statement outlining the work(s) to be examined, which may comprise (i) a sustained body of work over a lengthy period, or (ii) a seminal work that has profoundly contributed to the corpus of knowledge in a particular field;",
            "a curriculum vitae for the proposed candidate and a full list of the candidate's publications; and",
            "the names and contact details of three referees (other than the proposer) who have sufficient familiarity with the proposed candidate's field of research to enable them to recommend whether or not the quality of the work(s) submitted warrants the award of LLD.",
            "A nomination for admission to candidature is considered by a committee established by the Dean of Melbourne Law School, comprising at least two Melbourne Law School academics. The Dean, Associate Dean (Research) and the Director of Graduate Research of Melbourne Law School may be members of the committee, but the proposer may not.",
            "In considering whether to accept the candidature, the committee considers:",
            "whether the proposed candidate's work as identified in the nomination meets, on a prima facie basis, the subject, scope and character required for admission to the degree of LLD;",
            "if the proposed candidate is not a graduate in law of the University, whether or not the proposed candidate has received adequate training for legal scholarship and whether or not the proposed candidate's degree is recognised, pursuant to 'Part 4 – Selection and Admission' of the Academic Board Regulation as appropriate for the LLD; and",
            "if work is submitted for assessment that has previously been presented for a degree in any university, whether or not this work should be approved for examination.",
            "The decision of the committee will be taken by consensus or, if necessary, by majority."
        ],
        "Inherent requirements (core participation requirements)": [
            "A body of work is submitted for examination.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a candidate's participation in the University's programs. Candidates who feel their disability will impact on meeting the requirements of this course are encouraged to discuss this matter with a Graduate Research Officer andStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "A body of work is submitted for examination."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}