{
    "Course name": "Doctor of Music",
    "Course code": "DH-MUS",
    "Overview text": [
        "The DMus is a higher doctorate, awarded on the basis of published or commercially recorded work in composition, performance or the history, theory, psychology and aesthetics of music and music therapy, together with any other appropriate body of work, published or unpublished, or commercially released recordings completed during the year of candidacy, provided the examiners are satisfied the work represents a substantial, sustained and original contribution to the discipline of music.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Doctor of Music",
        "Year & campus": "2024— Southbank",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "Duration and credit points not applicable for this course."
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "Candidates must be BMus graduates of significant national and international distinction and achievement for admission to a higher doctorate in Music. Applications for admission to the Doctor of Music are to be made directly to the Associate Director (Research) at the Melbourne Conservatorium of Music for initial consideration of whether a prima facie case can be established for admission to candidature. Composition applicants must include a compositional CV detailing a list of works published, commercial CDs released, major performances, broadcasts and festivals, critical reviews, awards, and competitive commissions. Scores and recordings are not required at the initial stage of application. Performance applicants must include a CV and recordings of commercially available performances together with any additional published works and reviews of major performances. Musicology, Ethnomusicology, Music Therapy, Music Psychology and Music Performance Science applicants should provide a scholarly CV with details of major refereed journal articles and book chapters, monographs, and other scholarly publications, critical reviews, keynote addresses at major international conferences, awards and competitive research funding.",
            "If the prima facie case is established, the applicant will be invited to provide a proposal for the DMus submission, detailing the body of existing published and/or recorded work to be submitted together with a description of a major new work or performances to be completed during the period of candidature, including a timeline for completion. Applicants may be required to attend an interview and the committee may request further supporting materials. For composition applicants the new work will normally be over half an hour in length for forces such as a symphonic work, concerto, ballet score, opera or similar major composition. For performance applicants the new work would form at least one commercially released recording, and/or series of public performances. For Musicology, Ethnomusicology, Music Therapy, Music Psychology and Music Performance Science the new work will take the form of a scholarly monograph (with accompanying multimedia as appropriate) and an indication of acceptance for publication by a recognised international publisher.",
            "Please contact the Faculty of Fine Arts and Music Research Office, onfineartsmusic-research@unimelb.edu.aufor information if you wish to apply for this course."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Please refer to the course overview"
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}