{
    "Course name": "Doctor of Dental Science",
    "Course code": "DH-DSC",
    "Overview text": [
        "The Doctor of Dental Science (DDSc) is the highest qualification available by examination at Melbourne Dental School.",
        "The work submitted for examination must be of such a standard that it makes \"a substantial and original contribution to dental scholarship and is of such standard as to give the candidate authoritative standing in the field of the candidate's study\".",
        "Applications to enrol in the degree normally follow an invitation from Melbourne Dental School to individuals of considerable seniority and with a connection to the Melbourne Dental School.",
        "Last updated: 18 June 2024"
    ],
    "Overview table": {
        "Award title": "Doctor of Dental Science",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "Duration and credit points not applicable for this course."
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "You must hold the BDSc (or equivalent) degree, or in exceptional circumstances another qualification (e.g. BSc) that is recognised by the Faculty as appropriate. You must have held this degree for at least four years before commencing the DDSc.",
            "A formal application for admission to candidature for the DDSc comprises a nomination by a Melbourne Dental School academic. The nomination should be addressed to the Head of Melbourne Dental School.",
            "The person nominating (proposer) should have sufficient familiarity with the proposed candidate and the candidate's field of research to enable the proposer to recommend that the quality of the work(s) to be submitted warrants the award of DDSc.",
            "The proposer must provide the following:",
            "information that demonstrates that the proposed candidate is eligible for admission to candidature for the DDSc;",
            "a statement expressing why the proposed candidate's work is \"a substantial and original contribution to dental scholarship and is of such standard as to give the candidate authoritative standing in the field of the candidate's study\";",
            "a statement outlining the work(s) to be examined, which may comprise (i) a sustained body of work over a lengthy period, or (ii) a seminal work that has profoundly contributed to the corpus of knowledge in a particular field;",
            "a curriculum vitae for the proposed candidate and a full list of the candidate's publications; and",
            "the names and contact details of three referees (other than the proposer) who have sufficient familiarity with the proposed candidate's field of research to enable them to recommend whether or not the quality of the work(s) submitted warrants the award of DDSc",
            "In considering whether to accept the candidature, the committee considers:",
            "whether the proposed candidate's work as identified in the nomination meets, on a prima facie basis, the subject, scope and character required for admission to the degree of DDSc;",
            "if the proposed candidate is not a graduate in dentistry of the University, whether or not the proposed candidate has received adequate training for dental scholarship and whether or not the proposed candidate's degree is recognised pursuant to section 4 of Regulation 11.1.A2 as appropriate for the DDSc; and",
            "if work is submitted for assessment that has previously been presented for a degree in any university, whether or not this work should be approved for examination.",
            "The decision of the committee will be taken by consensus or, if necessary, by majority."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "N/A"
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}