{
    "Course name": "Doctor of Science",
    "Course code": "DH-SC",
    "Overview text": [
        "A candidate whose work, in the opinion of the examiners includes a substantial, original contribution to Science; and is of such a standard as to give the candidate authoritative standing in the field of the candidate's study; and who has fulfilled the prescribed conditions; may be admitted to the degree of Doctor of Science.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Doctor of Science",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "Duration and credit points not applicable for this course."
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. The Faculty of Science may admit a candidate for the degree of Doctor of Science who has made a significant contribution in a scientific field closely related to the core disciplines within the Faculty of Science and either- has held a University of Melbourne Bachelor degree or Master degree or MPhil or PhD for more than ten years- has held a Bachelor degree or Master degree or MPhil or PhD, for more than ten years, from another institution and has been a member of the academic staff of the University of Melbourne or had a substantial association with the University of Melbourne, for at least five years.",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:- prior academic performance.The Academic Board may determine levels of prior academic performance which guarantee selection.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants will satisfy the University's English language requirements for the Diploma by meeting the English language requirements for the Bachelor degree in which they are enrolled concurrently"
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Structure & Available Subjects field of this entry. The University is dedicated to provide support to those with special requirements. Further details on the disability support scheme can be found atStudent Equity and Disability Support"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Dean of the Faculty of Science will appoint a perusal committee to determine whether the candidate meets the entry requirements. To enable this the candidate will be asked to provide the Faculty of Science with a detailed CV (including an up to date list of publications); a statement of research impact and a statement detailing how their field of study is closely related to the core scientific disciplines within the Faculty of Science. The perusal committee will then decide, in general terms, if the quality and quantity and area of research justifies submitting the work for assessment.",
                "If appropriate the candidate will then be invited to submit a digital copy of their thesis. The thesis should consist of reprints (PDF files from the journal are acceptable) of publications and/or papers. In addition, an introduction to the works being presented for examination should be included. Where the candidate has collaborated with others, a signed statement indicating the content of their share in the work must also be included. Candidates should be able to show that they have been responsible for a significant portion of the research work."
            ]
        },
        "Subject options": {
            "overview": [
                "Once the submission has been approved for examination by the perusal committee, candidates are enrolled in the subject SCIE90001 Doctor of Science and are invoiced as indicated athttp://futurestudents.unimelb.edu.au/admissions/fees/grad-dom/aust-fee-place-fees/australian_graduate_fees_table"
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}