{
    "Course name": "Doctor of Medicine",
    "Course code": "MC-DMED",
    "Overview text": [
        "The Doctor of Medicine (MD) program is a four-year postgraduate, entry to practice medical course. Graduates of the program are prepared to join the medical workforce as an intern, with the requisite knowledge, skills and attributes to deliver excellent healthcare within the Australian health system.",
        "The MD is a full-time course of study, with learning in clinical settings in each year of the program. Student’s learning is structured around three domains: applied biomedical science, clinical skills and professional practice. Embedded within each of these domains are the themes of First Nations Health, Population and Global Health and research methods. In Year 1 students will develop foundational knowledge and skills via small group tutorials, practicals, clinical placement and interactive online learning.  In years 2 and 3 students are immersed in full time clinical placement where they apply foundational knowledge and skills to a broad range of patient encounters in a wide variety of health care settings. Clinical placement is complemented with small group tutorials, simulation, clinical and procedural skills alongside online interactive learning. In Year 4 students complete a research project in an area of interest and undertake a clinical placement-based capstone experience- learning as trainee junior doctors. This final capstone experience ensures that students are well prepared for their pending entry into the health care workforce.",
        "A highlight of the MD program is the opportunity for students to individualise their learning experiences through participation in a Discovery learning pathway at each level of the MD. Discovery learning can be selected from a variety of bespoke clinically focused topics or from a curated list of approved faculty subjects allowing students to explore a wide range of areas or complete a deeper dive into a future speciality. In the final two years of Discovery learning, students can choose to follow a research scholar pathway that extends their knowledge and skills in research and leadership or a clinical scholar pathway that extends their knowledge and skills in health advocacy and leadership.",
        "Another unique feature of the Melbourne MD is the yearly student conference. The MD Student Conference provides opportunities for broader disciplinary and inter-disciplinary learning and brings together all students from the MD. The conference allows students to participate in future focused learning and provides opportunities to explore areas of interest beyond core medical practice.",
        "Beyond core, discovery and conference learning, students also have the opportunity to complete an elective placement outside of their allocated clinical school to broaden their understanding of health care. Rural rotations are available to all students to provide opportunities to experience clinical training in a rural setting.",
        "Overall the Doctor of Medicine is an ungraded course, with subject achievement being a pass/fail. An ungraded MD is intended to decrease stress and improve student wellbeing, promote intrinsic motivation and longer-term learning, foster collaborative practice, and to support professional identify formation. Minimum performance standards across all standardised assessments in the MD program (for example OSCE and MCQ assessments) are set using widely accepted standard setting methods (such as the Modified Angoff and Borderline Regression approaches). Non-standardised assessments (such as workplace based assessments) and written assignments are assessed on a 5-point Likert scale, with the minimum performance standard (“satisfactory”) carefully mapped to the relevant subject and course intended learning outcomes.",
        ""
    ],
    "Overview table": {
        "Award title": "Doctor of Medicine",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "071304G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "400 credit points",
        "Duration": "48 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "either",
            "– an undergraduate degree in any discipline, with studies to have been completed within 10 years of 1 January in the year in which the applicant intends to commence the Doctor of Medicine; or",
            "– for applicants whose most recently completed undergraduate degree was completed 10 or more years before 1 January of the year in which the applicant intends to commence the Doctor of Medicine, a Graduate Diploma, Masters or PhD degree or equivalent completed within 10 years before 1 January of the year in which the applicant intends to commence the Doctor of Medicine; and",
            "the Graduate Australian Medical Schools Admission Test (GAMSAT) or for international students who are located overseas only, either the GAMSAT or the North American Medical Colleges Admission Test (MCAT); and",
            "a Multi Mini Interview.",
            "OR",
            "For students applying via the MD Rural Pathway either",
            "the Bachelor of Biomedical Science (Medical) at La Trobe University with a Weighted Average Mark of at least 70",
            "or",
            "either",
            "– an undergraduate degree in any discipline, with studies to have been completed within 10 years of 1 January in the year in which the applicant intends to commence the Doctor of Medicine; or",
            "– for applicants whose most recently completed undergraduate degree was completed 10 or more years before 1 January of the year in which the applicant intends to commence the Doctor of Medicine, a Graduate Diploma, Masters or PhD degree or equivalent completed within 10 years before 1 January of the year in which the applicant intends to commence the Doctor of Medicine; and",
            "a rural-specific Multi Mini Interview; and",
            "the Doctor of Medicine Rural Pathway rurality form including evidence of having resided, according to principal home address, for at least 5 years consecutively, or 10 years cumulatively, in areas classified by the Modified Monash Model as category MM2 - MM7 since birth and preferably have completed Years 11 and 12 at a school in an area classified as MM2 to MM7.",
            "Meeting these requirements does not guarantee selection (except for completion of the Bachelor of Biomedical Science (Medical) at La Trobe with the required WAM).",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the GAMSAT or MCAT score; and",
            "the interview.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the University’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required.",
            "See Notes below for further details.",
            "1. Except for applicants applying via the MD Rural Pathway, The Selection Committee will shortlist applicants for Multi Mini Interview on the basis of their performance in previous studies, using a Grade Point Average (GPA) computed in a manner approved by the Academic Board for the Doctor of Medicine (see note 3 below), and their results in the GAMSAT or MCAT. All sections in the GAMSAT will be weighted equally to determine the GAMSAT score. Offers will be made on the basis of a combined ranked list where the interview will contribute 50%, GPA will contribute 25%, and GAMSAT (or MCAT) will contribute 25% to the final ranking after interview.",
            "2. For applicants applying via the MD Rural pathway, not having completed the Bachelor of Biomedical Science (Medical) degree at La Trobe University, the Selection Committee will shortlist applicants for rural-specific Multi Mini Interview on the basis of their performance in previous studies, using a Grade Point Average (GPA) computed in a manner approved by the Academic Board for the Doctor of Medicine (see note 3 below). Offers will be made on the basis of a combined ranked list where the rural-specific interview will contribute 70%, GPA will contribute 30% to the final ranking after interview.",
            "3. Except for (i) applicants eligible under the Guaranteed entry pathway, and (ii) as explicitly provided for under note 6 below, the Grade Point Average (GPA) used to rank applicants on academic merit based on their previous tertiary studies will be computed in the following way. The most recent bachelor degree results (including Honours*) will be used for the purposes of calculating the Grade Point Average (GPA) regardless of any subsequent graduate studies completed. The Grade Point Average (GPA) will be measured by considering the last three years of the applicant's undergraduate coursework studies (including Honours*). Weightings will be applied by weighting the first of the final three years by 1, the second year by 2 and the final year by 2. Please note that results for 2020 subjects completed before the COVID-19 pandemic will be included in GPA calculations. Results for honours completed in 2020 will be included in GPA calculations for 2022 and all future intakes. All other 2020 subject results will be excluded from GPA calculations for 2022 and all future intakes. If an applicant completed their final year of undergraduate study in 2020, weightings will be applied by weighting the first year of the final three years by 1, the second year by 2 and the final year subjects completed before the pandemic by 2. If an applicant completed their penultimate year of undergraduate study in 2020, weightings will be applied by weighting the first year of the final three years by 1, the second year subjects completed before the pandemic by 2 and the final year by 2. If an applicant completed their first year (of the final three years) of undergraduate study in 2020, weightings will be applied by weighting the first year subjects completed before the pandemic by 1, the second year by 2 and the final year by 2. For the avoidance of doubt, please note that subjects from all other study periods will be calculated according to the standard GPA calculation method described at the beginning of point 3.",
            "4. In considering students under special entry access schemes, the Selection Committee will consider aspects of disadvantage as set out from time to time in the University of Melbourne Graduate Access policy, evidence of rurality for rural applicants, and confirmation of Aboriginality for Indigenous applicants.",
            "5. Aboriginal and/or Torres Strait Islander (Indigenous) applicants are given priority access to the Doctor of Medicine under the Indigenous MD student entry pathway. Verified Indigenous applicants are required to meet minimum selection criteria only^. Applicants eligible for the Indigenous MD student entry pathway will not be subject to ranking and will be selected into the Doctor of Medicine if the following minimum entry requirements are met: prerequisite subjects passed; Grade Point Average (GPA) of 5.0 or above; and Multi Mini Interview passed. Indigenous applicants who satisfy these minimum requirements will be invited to attend an interview with a panel chaired by the Associate Dean (Indigenous) of the Faculty (or their nominee), and other appropriate Indigenous representatives. Indigenous applicants are not required to apply via the Graduate Entry Medical School Admissions System (GEMSAS), nor sit the Graduate Medical School Admission Test (GAMSAT).",
            "6. Students applying for the Doctor of Medicine (Doctor of Physiotherapy, or Doctor of Dental Surgery) from the University of Melbourne degrees of Bachelor of Arts, Bachelor of Biomedicine, Bachelor of Commerce, Bachelor of Design, Bachelor of Environments, Bachelor of Agriculture, Bachelor of Music, or Bachelor of Science who meet entry and course requirements for a guaranteed place are admitted subject only to: meeting any minimum Grade Point Average as prescribed by the Academic Board; satisfactory performance at an interview to demonstrate adequate communication skills (Doctor of Medicine and Doctor of Physiotherapy only); and completion of relevant prerequisite subjects on the first attempt (Doctor of Physiotherapy and Doctor of Dental Surgery only).",
            "7. The Selection Committee may re-rank applicants with a high level of performance in postgraduate studies in a cognate area subject to the following:",
            "postgraduate study must have been completed within ten years of commencement of the Doctor of Medicine, Doctor of Dental Surgery or Doctor of Physiotherapy;",
            "postgraduate study must be the equivalent of at least a one year full time program;",
            "postgraduate study must be in a discipline that builds upon studies completed at the undergraduate level;",
            "postgraduate study must be in a health related or biological sciences discipline.",
            "The quotas of places available for selection of applicants re-ranked on the basis of postgraduate study as prescribed below are set initially as follows:",
            "(a) Doctor of Medicine — up to 10 places",
            "(b) Doctor of Dental Surgery — up to 2 places",
            "(c) Doctor of Physiotherapy — up to 3 places",
            "Re-ranked applicants not selected on this basis, who otherwise satisfy the selection criteria, will be considered on the basis of their undergraduate results. The Selection Committee is not required to fill the quotas and any unused places will be allocated as normal.",
            "*For further information about Honours, please refer to:http://mdhs-study.unimelb.edu.au/degrees/doctor-of-medicine/entry-requirements#entry-requirements"
        ],
        "Inherent requirements (core participation requirements)": [
            "Students must comply with Fitness to Practice Rules, which are accessible fromSchedule 1of theStudent Fitness to Practice Policy (MPF1345).",
            "The curriculum framework of The University of Melbourne Doctor of Medicine (MD) course has four domains; clinician scholar and scientist, health systems, patient advocate and professional and a leader. In order to make informed decisions regarding their study, students should carefully consider the course learning outcomes in each domain and the Core Participation Requirements.",
            "The Core Participation Requirements are categorised under specific skill areas and are based on the “Inherent Requirements for studying medicine in Australia and New Zealand”. This document has been endorsed by Representatives of Medical Deans of Australia and New Zealand (8 October 2015). Additional information from the publication “Higher Education Occupational Physicians (HEOPS) Practitioners: medical students – fitness to train”, has also been incorporated.",
            "The University of Melbourne welcomes applications from students with disabilities. It is University policy to take reasonable and proportionate measures to minimise the impact of disability upon academic study.",
            "With appropriate support and reasonable adjustments where possible, students must be able to meet the Core Participation Requirements in order to graduate from the MD course. Students will be given the opportunity to demonstrate how they can meet these requirements in the context of their disability.",
            "In determining whether an adjustment is reasonable, the University will consider:",
            "The nature of the disability;",
            "The effect of the adjustment on the student’s ability to demonstrate the required learning outcomes and participate in the MD course;",
            "The effect of the adjustment on any other person, including other students, staff and patients; and",
            "The cost and logistical impact of the adjustment.",
            "Students should note that a reasonable adjustment may include modification to assessment and providing additional support services, but the University cannot make an adjustment which would affect the academic integrity of the MD course or patient safety. Similarly, part of the MD course takes place at clinical sites off-campus where it may not be reasonable for the University to make the same adjustments that are possible on campus. This means that having a disability which prevents training in a particular context may have implications for completion of course requirements and future practice.",
            "Once enrolled in the MD course, students with a disability are encouraged to register with the Student Equity and Disability Service as early as possible. The role of this Service is to determine reasonable adjustments, following consultations with students and the School, and to provide information and advice to students in this context.",
            "VisionAdequate visual acuity is required to provide safe and effective medical care. A medical student is expected to demonstrate: Sufficient visual acuity to perform the required range of skills, including reading small print on ampoules or similar, reading a monitor across a bed and responding to visual alarms.",
            "Visual acuity with maximal correction of N8 and/or 6/18 (or better) is required for the practice of medicine. Students whose vision is insufficient to meet these criteria or who have significant other visual problems (such as visual field defects, nystagmus, etc.) may require assessment by an ophthalmologist.",
            "HearingAdequate auditory ability is required to provide effective and safe medical care. A medical student is expected to demonstrate: Sufficient aural function to undertake the required range of tasks including the ability to work effectively in the emergency situation.",
            "A student, wearing functioning hearing aids (if required), should demonstrate the ability to understand the human voice at 1 metre with less than 40db loss across speech frequencies.",
            "TouchSufficient tactile ability is required to perform competent and safe medical care. A medical student is expected to demonstrate sufficient fine touch to undertake the required range of skills and clinical assessments, such as palpation of vessels and organs, and to estimate the size of skin lesions.",
            "Mobility and gross motor skillsMobility and gross motor skills are required in medicine to undertake appropriate clinical care. A medical student is expected to demonstrate the ability to perform gross motor skills to undertake a full physical examination, cardiopulmonary resuscitation, and to function within scope of practice including independent mobility in order to attend medical emergencies when required. A student must demonstrate the ability to undertake a full physical examination avoiding injury to patients, colleagues and self, and possess one fully functional arm and the other capable of providing support.",
            "Fine motor skillsMedicine is a profession that requires manual dexterity, and possession of fine motor skills is fundamental in providing adequate clinical care. A medical student is expected to demonstrate the ability to use fine motor skills to provide safe, effective diagnosis, treatment and clinical care and the ability to undertake a full physical examination without harming patient or self, including having one fully functioning arm and the other capable of providing support. Medical students, by the end of their training should be able to carry out the following: venepuncture, wound suture and intravenous cannulation.",
            "Interruptions to consciousnessMedical practice requires the student to be conscious and aware at all times when interacting with patients. Unexpected interruptions to consciousness place patients at risk. A medical student is expected to demonstrate that there must be no risk of interruptions of consciousness that would present a risk to patients. Uncontrolled epilepsy in a medical student will put patients at significant risk. Narcolepsy and repetitive fainting will require careful assessment and treatment.",
            "Verbal communicationEffective and efficient verbal communication, in English, is an essential requirement to provide safe delivery of care during medical training. A medical student is expected to demonstrate the ability to understand and respond to verbal communication accurately, appropriately and in a timely manner and the ability to provide clear and timely instructions in the context of the situation.",
            "IELTS 7.0 (or other standard as promulgated) is required by AHPRA for international students at the point of commencing an internship. A medical student must have the ability to be understood at 3 metres in a quiet room.",
            "Written communicationEffective written communication is a fundamental medical responsibility with professional and legal ramifications. A medical student is expected to demonstrate capacity to construct coherent written communication appropriate to the circumstances.",
            "NumeracyCompetent and accurate numeracy skills are essential for safe and effective patient care. A medical student is expected to interpret and correctly apply data, measurements and numerical criteria, and to prescribe safely and effectively including calculating drug dosages.",
            "Sustainable performanceMedical training requires both physical and mental performance at a consistent and sustained level to meet the MD course requirements over time. MD subjects are typically integrated over the course of a year and are structured to ensure progressive development of attributes. Fragmentation of the course, for example through prolonged absences during parts of the year or during parts of a day, hinders such learning. A medical student will be expected to attend for 30–40 hours per week for up to 40 weeks a year. A medical student will be required to undertake the MD course in a full-time, continuous fashion.",
            "Monitor and manage own healthA medical student is expected to monitor their own mental and physical health and their behaviour, and to seek help when required.",
            "Clinical examinationIt is a requirement of the course that students will be expected to physically examine their peers (of all genders) in classroom settings, and patients (of all genders) in clinics and hospital wards."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "The Doctor of Medicine (MD) is accredited by the Australian Medical Council.",
            "Graduates of the Doctor of Medicine are eligible for provisional registration with the Medical Board of Australia and full registration upon completion of an accredited internship."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Doctor of Medicine requires the successful completion of 400 credit points.",
                "Doctor of Medicine (MD)",
                "400 point program:",
                "• Eight compulsory subjects (312.5 points) and",
                "• Four selective (Discovery) subjects (87.5 points)"
            ],
            "COURSE STRUCTURE FOR STUDENTS COMMENCING FROM 2022": {
                "overview": [
                    "YEAR ONE SUBJECTS (100 CREDIT POINTS)",
                    "Students must complete the below two subjects:",
                    [
                        "MEDS90031",
                        "MEDS90003"
                    ],
                    "AND",
                    "12.5 credit points from the following list of subjects:",
                    [
                        "MEDS90039"
                    ],
                    "OR",
                    [
                        "POPH90013",
                        "POPH90014",
                        "POPH90094",
                        "POPH90217",
                        "POPH90230",
                        "POPH90247",
                        "POPH90270",
                        "POPH90275",
                        "POPH90303",
                        "POPH90304",
                        "ISYS90069",
                        "INFO90011"
                    ],
                    "Note:",
                    "For INFO90011 that students will only be permitted to undertake the Semester 1 availability and not Semester 2",
                    "YEAR TWO SUBJECTS (100 CREDIT POINTS)",
                    "Students must complete the below two subjects:",
                    [
                        "MEDS90004",
                        "MEDS90005"
                    ],
                    "AND",
                    "12.5 credit points from the following list of subjects:",
                    [
                        "MEDS90040"
                    ],
                    "OR",
                    [
                        "POPH90303",
                        "POPH90304",
                        "POPH90270",
                        "POPH90013",
                        "POPH90014",
                        "POPH90217",
                        "POPH90094",
                        "POPH90247",
                        "POPH90230",
                        "POPH90275",
                        "POPH90267",
                        "POPH90257",
                        "ABPL90377",
                        "POPH90199",
                        "POPH90117",
                        "POPH90206",
                        "POPH90058",
                        "MAST90101",
                        "POPH90131",
                        "POPH90231",
                        "ISYS90069",
                        "INFO90011"
                    ],
                    "*Note:",
                    "For INFO90011 students will only be permitted to undertake the Semester 1 availability and not Semester 2",
                    "For POPH90231 students will only be permitted to undertake the Semester 1 availability and not Semester 2",
                    "YEAR THREE SUBJECTS (100 CREDIT POINTS)",
                    "Students must complete the below two subjects:",
                    [
                        "MEDS90020",
                        "MEDS90022"
                    ],
                    "AND",
                    "12.5 credit points from the following list of subjects:",
                    "For the Clinical Scholar pathway:",
                    [
                        "MEDS90041"
                    ],
                    "(OR List of Discovery 3 Selective: pending)",
                    "For the Research Scholar Pathway:",
                    [
                        "MEDS90043"
                    ],
                    "YEAR FOUR SUBJECTS (100 CREDIT POINTS)",
                    "Students must complete the below subjects:",
                    [
                        "MEDS90025",
                        "MEDS90024"
                    ],
                    "AND 50 credit points from the following list of subjects:",
                    "For the Clinical Schol Pathway:",
                    [
                        "MEDS90042"
                    ],
                    "For the Research Scholar pathway:",
                    [
                        "MEDS90044"
                    ]
                ]
            },
            "COURSE STRUCTURE FOR STUDENTS WHO COMMENCED PRIOR TO 2022": {
                "overview": [
                    "Due to the COVID-19 pandemic, the course structures for the 2021 - 2023 cohorts have been altered. The below structure represents the structure for students who commenced the course in 2021.",
                    "Students must complete all subjects listed",
                    "YEAR ONE SUBJECTS:",
                    [
                        "MEDS90031",
                        "MEDS90003"
                    ],
                    "YEAR TWO SUBJECTS:",
                    [
                        "MEDS90004",
                        "MEDS90005"
                    ],
                    "YEAR THREE SUBJECTS",
                    [
                        "MEDS90034",
                        "MEDS90036",
                        "MEDS90022"
                    ],
                    "YEAR FOUR SUBJECTS",
                    [
                        "MEDS90037",
                        "MEDS90024"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}