{
    "Course name": "Doctor of Philosophy - Indigenous Knowledge",
    "Course code": "DR-PHILIK",
    "Overview text": [
        "The degree of Doctor of Philosophy signifies that the holder has undertaken a substantial piece of original research, which has been conducted and reported by the holder under proper academic supervision and in a research environment for a prescribed period.",
        "The PhD thesis demonstrates authority in the candidate’s field and shows evidence of command of knowledge in relevant fields. It shows that the candidate has a thorough grasp of the appropriate methodological techniques and an awareness of their limitations. The thesis also makes a distinct contribution to knowledge. Its contribution to knowledge rests on originality of approach and/or interpretation of the findings and, in some cases, the discovery of new facts. The thesis demonstrates an ability to communicate research findings effectively in the professional arena and in an international context. It is a careful, rigorous and sustained piece of work demonstrating that a research apprenticeship is complete, and the holder is admitted to the community of scholars in the discipline.",
        "In scope, the PhD thesis differs from a research master thesis chiefly by its deeper and more comprehensive treatment of the chosen subject. It is written succinctly, in English, unless approval has been given for the thesis to be written in a language other than English. The normal length of a PhD thesis is 80,000 words (or equivalent), exclusive of words in tables, maps, bibliographies, and appendices. Footnotes are included as part of the word limit. The thesis should not exceed 100,000 words (or equivalent) without special approval from the Higher Degrees by Research Committee",
        "The duration of Doctor of Philosophy candidature is three years for full-time candidates, two six-month extensions are allowed.The thesis may also be submitted in the format of a written dissertation with a creative folio. Any thesis submitted in the format of a dissertation with folio will be examined as an integrated whole. Theses submitted in the format of a dissertation with folio must be equivalent to 80,000 words."
    ],
    "Overview table": {
        "Award title": "Doctor of Philosophy",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "111523E",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "4 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a four-year bachelor degree in a relevant discipline which includes a substantial research component equivalent to at least 25% of one year of full-time study and have achieved a minimum weighted average of 75% in the final year subjects or (University of Melbourne) equivalent;",
            "or a master degree in a relevant discipline which includes a substantial research component equivalent to at least 25% of one year of full-time study and achieved a minimum weighted average of 75% or (University of Melbourne) equivalent;",
            "or a qualification or professional experience considered to be equivalent.",
            "or be an Indigenous Australian, who is not otherwise selected, if the Selection Committee decides they are likely to succeed in their proposed course of study.",
            "For this purpose of this PhD course, professional experience is understood to include demonstrable experience of maintaining and/or revitalising Indigenous knowledge practices, such as cultural, language, ceremonial and/or environmental practices.",
            "Applicants for all discipline areas must provide:",
            "referee reports (except for applicants who have graduated from the University of Melbourne within the last 5 years);",
            "and evidence of the endorsement of a prospective supervisor.",
            "In addition, applicants must provide a research proposal,and may optionally provide an exampleof scholarly writing, folio, recording and/or audition as pertinent to the proposed topic and approach:",
            "a written research proposal of 1000 to 2500 words (mandatory),",
            "a recent example of scholarly writing of 2000 to 5000 words (optional),",
            "a folio of 3–4 representative works pertinent to the proposed approach (optional),",
            "demonstrate a very high standard of performance ability via a live audition or live recording of at least 20 minutes in length (optional),",
            "a CV including lists of publications, works, performances, broadcasts, research experience and/or community services (optional)",
            "Meeting these requirements does not guarantee selection.2. In selecting applicants, the selection committee will consider applicants’:",
            "prior academic performance and, if relevant, professional qualifications;",
            "understanding of the research question to be explored;",
            "demonstrated ability in Indigenous knowledge practices;",
            "performance at an interview;",
            "motivation and capacity to complete the course in a timely manner;",
            "relevant prior research and/or professional experience;",
            "and the referee reports.",
            "3. The selection committee may seek further information to clarify any aspect of an application in accordance with the Selection and Admission Policy",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, the following performance band are required: Band 6.5"
        ],
        "Inherent requirements (core participation requirements)": [
            "All candidates are required to complete the equivalent of at least one-third advanced study and research at the University (unless studying at an approved outside institution). The Higher Degrees by Research Committee (HDRC) will not approve entirely distance supervision or entirely on-line supervision forGraduate Researchers.",
            "Throughout their candidature candidates are expected to attend the University in order to benefit from planning, conducting and writing up their research within a University community and environment.",
            "The residency requirement is deemed especially important during the period of probationary candidature. During probationary candidature theGraduate Researcheris expected to interact on a regular basis with the supervisor, the department (including staff and otherGraduate Researchers) and the University, so as to build the skills and knowledge necessary to carry out the proposed research program to acquire an understanding of the standards and requirements for a PhD awarded by the University to make use of support programs and facilities provided by the University of Melbourne throughout candidature.",
            "The minimum residency requirement may be waived only by the President of the Board if the President is satisfied the following conditions apply:(a) exceptional circumstances exist that prevent the applicant from complying with the residency requirement in section 4.14;(b) the applicant has a demonstrated professional background in the area of their proposed research; and(c) the applicant provides a plan for their regular attendance at the University that has been endorsed by their supervisors.Meeting these requirements does not guarantee a minimum residency waiver.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry. It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance aGraduate Researchers's participation in the University's programs.Graduate Researcherswho feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "A candidate will have appropriately experienced supervisor(s) and an Advisory Committee who, in consultation with the candidate, arranges a course of supervised research designed to suit the individual requirements and interests of the candidate.",
                "A candidate may be required to supplement their research program by attendance at, or enrolment in, additional subjects if considered necessary by the supervisors.",
                "All candidates for the PhD will be examined on the basis of their thesis. The thesis will be submitted in one of the following formats:",
                [
                    "dissertation of 80,000 words,",
                    "dissertation of 60,000 words with a minor folio of work,",
                    "dissertation of 40,000 words with a medium folio of work, or",
                    "dissertation of 20,000 words with a major folio of work."
                ],
                "The thesis should not exceed 100,000 words without special approval from the Research Higher Degrees Committee.",
                "Expected duration of candidature is three years (full-time equivalent). Two extensions of six months each may be allowed.",
                "The thesis and folio must be presented in a form that can be sent for assessment by external examiners internationally. The work submitted must be created during the candidature for the purposes of fulfilling the requirements of the PhD."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}