{
    "Course name": "Doctor of Philosophy - Victorian College of the Arts",
    "Course code": "DR-PHILVCA",
    "Overview text": [
        "The Doctor of Philosophy (VCA) is now offered in the Doctor of Philosophy – Fine Arts and Music course.",
        "Information on the Doctor of Philosophy – Fine Arts and Music can be found in the Handbookhere.",
        "If you wish to apply for entry to the Doctor of Philosophy – Fine Arts and Music, information on admissions is on the Study Hubhere.",
        "You can find details of our discipline areas and all the courses offered by the Faculty of Fine Arts and Musichere.",
        "The degree of Doctor of Philosophy signifies that the holder has undertaken a substantial piece of original research, which has been conducted and reported by the holder under proper academic supervision and in a research environment for a prescribed period.",
        "The PhD thesis demonstrates authority in the candidate's field and shows evidence of command of knowledge in relevant fields. It shows that the candidate has a thorough grasp of the appropriate methodological techniques and an awareness of their limitations. The thesis also makes a distinct contribution to knowledge. Its contribution to knowledge rests on originality of approach and / or interpretation of the findings and, in some cases, the discovery of new facts. The thesis demonstrates an ability to communicate research findings effectively in the professional arena and in an international context. It is a careful, rigorous and sustained piece of work demonstrating that a research 'apprenticeship' is complete and the holder is admitted to the community of scholars in the discipline.",
        "In scope, the PhD thesis differs from a research Masters thesis chiefly by its deeper and more comprehensive treatment of the chosen subject. It is written succinctly, in English, unless approval has been given for the thesis to be written in a language other than English. The normal length of a PhD thesis is 80,000 words, exclusive of words in tables, maps, bibliographies and appendices. Footnotes are included as part of the word limit. The thesis should not exceed 100,000 words (or equivalent) without special approval from the Research Higher Degrees Committee.",
        "Further information and forms are available at:www.gradresearch.unimelb.edu.auandhttp://futurestudents.unimelb.edu.au/info/research. Initial contact should be made through the VCA & MCM Faculty Research Office by calling +61 3 9035 9175 or by emailingvcamcm-research@unimelb.edu.auand Faculty information on applications can be found at:http://vca.unimelb.edu.au/study/degrees"
    ],
    "Overview table": {
        "Award title": "Doctor of Philosophy",
        "Year & campus": "2024",
        "CRICOS code": "059249K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "4 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "• a four-year bachelor degree in a relevant discipline which includes a substantial research component equivalent to at least 25% of one year of full-time study and have achieved a minimum weighted average of 75% in the final year subjects or (University of Melbourne) equivalent (for the Faculty of Medicine, Dentistry and Health Sciences (MDHS), a minimum weighted average of 80% in the final year subjects or (University of Melbourne) equivalent); or",
            "• a masters degree in a relevant discipline which includes a substantial research component equivalent to at least 25% of one year of full-time study and achieved a minimum weighted average of 75% or (University of Melbourne) equivalent; (for the Faculty of Medicine, Dentistry and Health Sciences (MDHS), a minimum weighted average of 80% or University of Melbourne equivalent); or",
            "• a qualification and professional experience considered to be equivalent;",
            "and",
            "• a research proposal;",
            "• referee reports (except for applicants who have graduated from the University of Melbourne within the last 5 years); and",
            "• the endorsement of a prospective supervisor",
            "Meeting these requirements does not guarantee selection.",
            "2. In selecting applicants, the selection committee will consider applicants’:",
            "• prior academic performance and, if relevant, professional qualifications;",
            "• understanding of the research question to be explored;",
            "• demonstrated ability in the creative discipline;",
            "• performance at an interview;",
            "• motivation and capacity to complete the course in a timely manner;",
            "• relevant prior research and/or professional experience; and",
            "• the referee reports.",
            "3. The selection committee may seek further information to clarify any aspect of an application in accordance with theSelection and Admission Policy.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, the following performance bands are required: Doctor of Philosophy - PhD – Victorian College of the ArtsBand 6.5"
        ],
        "Inherent requirements (core participation requirements)": [
            "All candidates are required to complete the equivalent of at least one-third advanced study and research at the University (unless studying at an approved outside institution). The RHDC will not approve entirely distance supervision or entirely on-line supervision for research higher degree students.Throughout their candidature candidates are expected to attend the University in order to benefit from planning, conducting and writing up their research within a University community and environment.The residency requirement is deemed especially important during the period of probationary candidature. During probationary candidature the student is expected to interact on a regular basis with the supervisor, the department (including staff and other research students) and the University, so as:",
            "to build the skills and knowledge necessary to carry out the proposed research program",
            "to acquire an understanding of the standards and requirements for a PhD awarded by the University",
            "to make use of support programs and facilities provided by the Melbourne School of Graduate Research throughout candidature.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Doctor of Philosophy (PhD) at the VCA is a program of independent creative arts research, for which both traditional and practice-led PhD research modes are offered. The PhD involves a substantial piece of original and independent research, pursued under the guidance of Supervisors with expertise in your area of research interest.",
                "Students are required to complete CREA90001 Research Methods 1 in their first semester of candidature.",
                "The normal length of a doctoral thesis is 80,000 - 100,000 words. In this degree, a PhD thesis may take the form of performance and/or corpus of creative work (please refer to the Intended Learning Outcomes above), plus a dissertation of 40,000 - 50,000 words which aims to address, elucidate and contextualise the work."
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "CREA90001"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}