{
    "Course name": "Doctor of Education",
    "Course code": "300BB",
    "Overview text": [
        "The Doctor of Education is a research doctorate for experienced professionals with educational responsibilities. Carefully designed to build the knowledge and skills necessary for research at the doctoral level through a tailored coursework program, the course enables experienced educators to design and carry out research projects that have direct relevance to their professional role."
    ],
    "Overview table": {
        "Award title": "Doctor of Education",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "051658B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "4 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a Masters degree or equivalent in the discipline of Education or a cognate field relevant to the proposed area of study with at least an H2A average over the course; and",
            "five years of documented work or teaching experience in a field relevant to the proposed area of study;",
            "evidence of capacity to undertake research*.",
            "Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the professional experience; and",
            "the capacity to undertake research.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. The minimum English language requirements for this course are Band 7 English language requirements.",
            "*Applicants are normally required to have completed a research project, component, subject or group of subjects that accounts for at least 25% of their work (i.e. Honours year), or 25% of one year accumulated over the length of a Masters course, and which has, or have, been conducted, and assessed, individually. Research carried out in groups should at least have been graded individually. This project, component, or subject(s) may include:",
            "(a) any obviously research oriented project, subject or sustained piece of scholarly writing conducted for assessment, such as small theses, research essays, long essays, or studios; AND/OR",
            "(b) any less-obviously research subjects, including practice-based subjects such as performance or fieldwork, where there is also scholastic rigor as documented in a sustained piece of writing analogous to (a); AND/OR",
            "(c) any subjects directed at the formation of research skills, such as methodology and reasoning, such as scientific reasoning, or legal reasoning, where a sustained piece of writing has also been produced."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.",
            "The core participation requirements for study in the Faculty of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching.",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The first part of the Doctor of Education consists of 100 points of coursework.",
                "Doctor of Education candidates must complete the following four doctoral-level subjects (each 25 points):",
                [
                    "Laying the Foundations for Your Research (EDUC90870)",
                    "Methodological Foundations (EDUC90868)",
                    "Writing a Literature Review (EDUC90867)",
                    "Doctor of Education Thesis Proposal (EDUC90869)"
                ],
                "Full time Doctor of Education candidates complete their coursework component in their first year, part time Doctor of Education candidates over their first and second years.",
                "Doctor of Education candidates must gain at least an H2A average in the coursework component, including at least an H2A result in the Doctor of Education Thesis Proposal subject (EDUC90869), to proceed to the thesis.",
                "The second stage of the program consists of a 55,000 word thesis.",
                "Full time Doctor of Education candidates complete their thesis over the second to fourth year of candidature, part time Doctor of Education candidates over years three to eight.",
                "In the six months prior to submission of their thesis, Doctor of Education candidates must present their research findings at a public Completion Seminar attended by their Advisory Committee."
            ]
        },
        "Core subjects": {
            "overview": [
                "Doctor of Education candidates must complete four compulsory subjects (each 25 points; see below). One of these, the Doctor of Education Thesis Proposal subject (EDUC90869), must be taken in the semester immediately prior to the commencement of the thesis (i.e. in semester 2 (full-time enrolment) or in semester 4 (part-time enrolment)).",
                [
                    "EDUC90870",
                    "EDUC90868",
                    "EDUC90867",
                    "EDUC90869"
                ]
            ]
        },
        "Subject options for Doctor of Education candidates who commenced their degree prior to 2017": {
            "overview": [
                "Doctor of Education candidates who are well advanced in their coursework and who commenced their degrees prior to 2017 may enrol in appropriate 12.5 point subjects from the Master of Education (960AC) and the Melbourne Graduate School of Education'sspecialist masters coursesfor which they have the prerequisites. These Doctor of Education candidates also may take the Doctor of Education Thesis Proposal subject (EDUC90869) as a 12.5 point subject.",
                "These Doctor of Education candidates are required to consult with the Course Coordinator to see which enrolment options suit them best."
            ]
        },
        "Thesis": {
            "overview": [
                "Detailed information on the thesis is available atGraduate Research Hub.",
                [
                    "EDUC80002"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}