{
    "Course name": "Doctor of Philosophy - Fine Arts and Music",
    "Course code": "DR-PHILFAM",
    "Overview text": [
        "The degree of Doctor of Philosophy signifies that the holder has undertaken a substantial piece of original research, which has been conducted and reported by the holder under proper academic supervision and in a research environment for a prescribed period.",
        "The PhD thesis demonstrates authority in the candidate's field and shows evidence of command of knowledge in relevant fields. It shows that the candidate has a thorough grasp of the appropriate methodological techniques and an awareness of their limitations. The thesis also makes a distinct contribution to knowledge. Its contribution to knowledge rests on originality of approach and / or interpretation of the findings and, in some cases, the discovery of new facts. The thesis demonstrates an ability to communicate research findings effectively in the professional arena and in an international context. It is a careful, rigorous and sustained piece of work demonstrating that a research 'apprenticeship' is complete and the holder is admitted to the community of scholars in the discipline.",
        "In scope, the PhD thesis differs from a research Masters thesis chiefly by its deeper and more comprehensive treatment of the chosen subject. It is written succinctly, in English, unless approval has been given for the thesis to be written in a language other than English. The normal length of a PhD thesis is 80,000 words, exclusive of words in tables, maps, bibliographies and appendices. Footnotes are included as part of the word limit. The thesis should not exceed 100,000 words (or equivalent) without special approval from the Higher Degrees by Research Committee.",
        "The duration of Doctor of Philosophy-Fine Arts and Music candidature is three years for full-time candidates, two six month extensions are allowed.",
        "Except in the disciplines of Creative Arts Therapies, Music Psychology, Music Therapy and Musicology/Ethnomusicology, the thesis may be submitted as Creative Work and Dissertation. Any thesis submitted as Creative Work and Dissertation will be examined as an integrated whole.",
        "The Faculty of Fine Arts and Music offers PhD programmes in the following disciplines:",
        "At the Melbourne Conservatorium of Music:",
        "At the Victorian College of the Arts",
        "Through the Faculty of Fine Arts and Music",
        "Theses submitted as Creative Work and dissertation must be equivalent to 80,000 words – for details see Course Structure below.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Doctor of Philosophy",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "099323G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "4 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "Entry requirements",
            "1. In order to be considered for entry, applicants must have completed:",
            "a four-year bachelor degree in a relevant discipline which includes a substantial research component equivalent to at least 25% of one year of full-time study and have achieved a minimum weighted average of 75% in the final year subjects or (University of Melbourne) equivalent; or",
            "a masters degree in a relevant discipline which includes a substantial research component equivalent to at least 25% of one year of full-time study and achieved a minimum weighted average of 75% or (University of Melbourne) equivalent; or",
            "a qualification and professional experience considered to be equivalent;",
            "Applicants for all discipline areas must provide:",
            "referee reports (except for applicants who have graduated from the University of Melbourne within the last 5 years); and",
            "evidence of the endorsement of a prospective supervisor.",
            "In addition, applicants must provide a research proposal, example of scholarly writing and/or folio as follows:",
            "Creative Arts Therapies, Music Psychology, Music Therapy and Musicology/Ethnomusicology:",
            "a research proposal of 2,500 words; and",
            "a recent example of scholarly writing of 4,000 to 5,000 words.",
            "Dance, Design, Film and Television, Indigenous Arts and Culture, Music Theatre, Production, Social Practice and Community Engagement, Theatre and Visual Art:",
            "a research proposal of 2,000 words;",
            "a recent example of scholarly writing of 4,000 to 5,000 words; and",
            "a folio of work as per discipline requirements.",
            "Composition:",
            "A proposal of approximately 1,000 words for the PhD folio and dissertation;",
            "A recent example of scholarly writing of approximately 2,000 words;",
            "Three representative works submitted as recordings and in notated score format (where applicable). These should include a major work of over 15 minutes duration and a work for large acoustic ensemble (may be the same work), and at least one work written in the last 2 years; and",
            "A CV including list of works composed, performances and broadcasts.",
            "Interactive Composition:",
            "a research proposal of 2,000 words;",
            "a recent example of scholarly writing of 4,000 to 5,000 words; and",
            "a folio containing recordings of 4 of your original compositions at a total duration of 20 minutes.",
            "Jazz & Improvisation:",
            "a research proposal of 2,000 words;",
            "a recent example of scholarly writing of approximately 2,000 words; and",
            "applicants must demonstrate a very high standard of artistic ability via a live audition or live performance recording. The audition or recording must be at least 20 minutes in length.",
            "Music Performance:",
            "a research proposal of 2,000 words outlining plans for a research project that integrates a written thesis (minimum 20,000-25,000 words) and portfolio of recorded works (210 minutes) with details of proposed repertoire and timeline for completion;",
            "70 minutes of unedited live recordings; and",
            "a recent example of scholarly writing of 4,000 to 5,000 words.",
            "Meeting these requirements does not guarantee selection.",
            "2. In selecting applicants, the selection committee will consider applicants’:",
            "prior academic performance and, if relevant, professional qualifications;",
            "understanding of the research question to be explored;",
            "demonstrated ability in the creative discipline;",
            "performance at an interview;",
            "motivation and capacity to complete the course in a timely manner;",
            "relevant prior research and/or professional experience; and",
            "the referee reports.",
            "3. The selection committee may seek further information to clarify any aspect of an application in accordance with theSelection and Admission Policy.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, the following performance bands are required: Doctor of Philosophy - PhD – Fine Arts and MusicBand 6.5"
        ],
        "Inherent requirements (core participation requirements)": [
            "All candidates are required to complete the equivalent of at least one-third advanced study and research at the University (unless studying at an approved outside institution). The Higher Degrees by Research Committee (HDRC) will not approve entirely distance supervision or entirely on-line supervision for graduate research students.",
            "Throughout their candidature candidates are expected to attend the University in order to benefit from planning, conducting and writing up their research within a University community and environment.",
            "The residency requirement is deemed especially important during the period of probationary candidature. During probationary candidature the student is expected to interact on a regular basis with the supervisor, the department (including staff and other research students) and the University, so as:",
            "to build the skills and knowledge necessary to carry out the proposed research program",
            "to acquire an understanding of the standards and requirements for a PhD awarded by the University",
            "to make use of support programs and facilities provided by the University of Melbourne throughout candidature.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "A candidate will have appropriately experienced supervisor(s) and an Advisory Committee who, in consultation with the candidate, arranges a course of supervised research designed to suit the individual requirements and interests of the candidate."
            ]
        },
        "Coursework Component": {
            "overview": [
                "Candidates enrolled in disciplines offered by the Victorian College of the Arts are required to complete the following subject in their first semester of enrolment:",
                [
                    "CREA90001"
                ],
                "Candidates enrolled in disciplines offered by the Melbourne Conservatorium of Music who do not have the appropriate research methodology background may be required to take the following Research Methodology subject in the first semester of their candidature:",
                [
                    "MUSI90191"
                ],
                "Candidates in the discipline of Music Psychology are required to complete the following subject in their first semester of enrolment:",
                [
                    "MUSI90252"
                ]
            ]
        },
        "Thesis Submission": {
            "overview": [
                [
                    "MUSI80002",
                    "CREA80001"
                ]
            ],
            "Creative Arts Therapies, Music Psychology, Music Therapy and Musicology/Ethnomusicology": {
                "overview": [
                    "PhD candidates undertake supervised work that leads to a thesis (of approximately 80,000 words).",
                    "Research in Creative Arts and Music Therapy is significantly supported and promoted by theCreative Arts and Music Therapy Research Unit."
                ]
            },
            "Dance, Design, Film and Television, Indigenous Arts and Culture, Music Theatre, Production, Social Practice and Community Engagement, Theatre and Visual Art": {
                "overview": [
                    "The PhD thesis may take the form of performance and/or corpus of creative work, plus a dissertation of 40,000 - 50,000 words which aims to address, elucidate and contextualise the work; or as a written dissertation of approximately 80,000 words."
                ]
            },
            "Composition": {
                "overview": [
                    "PhD candidates in Composition submit a folio and dissertation. The folio will constitute 90-120 minutes of music and is weighted at 70%. The accompanying dissertation will be 20-25,000 words and weighted at 30%."
                ]
            },
            "Interactive Composition": {
                "overview": [
                    "PhD candidates in interactive Composition submit a folio and dissertation. The folio will constitute 90-120 minutes of music and sound with other media and is weighted at 70%. The accompanying dissertation will be 20-25,000 words and weighted at 30%."
                ]
            },
            "Jazz & Improvisation": {
                "overview": [
                    "PhD candidates undertake supervised work that leads to a dissertation, normally of 40,000-50,000 words, and a folio of creative work. The thesis and folio must be presented in a form that can be sent for assessment by external examiners who are usually international."
                ]
            },
            "Music Performance": {
                "overview": [
                    "PhD candidates undertake supervised work that leads to a dissertation, normally of 20-25,000 words, and a folio of performances equivalent to 3 full recitals or 210 minutes. The thesis and folio must be presented in a form that can be sent for assessment by external examiners who are usually international. The performance folio must created during the candidature for the purposes of fulfilling the requirements of the PhD."
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}