{
    "Course name": "Graduate Certificate in Business",
    "Course code": "GC-BUS",
    "Overview text": [
        "The Graduate Certificate in Business is comprised of four core subjects which provide introductory studies in a range of business disciplines including finance, accounting, economics and management.",
        "Students who complete the Graduate Certificate in Business are eligible to apply to join the Master of Management or the Master of International Business with credit."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Business",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline, or equivalent; and",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance",
            "the personal statement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Business and Economics welcomes applications from students with disabilities. It is University and Faculty policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.The BCom and Masters degrees of the Faculty of Business and Economics equip graduates with the knowledge and technical skills necessary to understand and participate in the modern business world. The degrees include the following academic requirements for study:(1) The ability to explain and evaluate concepts, theories, institutional arrangements and operations of modern mixed economies;(2) The ability to critically evaluate the economy, commerce and business in the broader social and political context;(3) The ability to explain and apply concepts across a range of commerce and business disciplines in solving business and policy problems; and(4) The ability to contribute positively to the development of organisations and society in relation to business, government and the commercial professions.All students of the Faculty’s courses must possess intellectual, ethical, and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the Faculty. Candidates for the BCom degree and for FBE Masters degrees must have abilities and skills in communication; in conceptual, integrative, and quantitative dimensions; and in behavioural and social dimensions.I. Communication: The student must be able to communicate effectively and efficiently in oral and/or written form. A student must have the ability to clearly and independently communicate knowledge and application of a discipline, principles or practices during assessment tasks, and in some discipline streams.II. Intellectual‐Conceptual, Integrative and Quantitative Abilities: The student is expected to have the ability to develop problem‐solving skills and demonstrate the ability to establish study plans and priorities. These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving requires all of these intellectual abilities. Students should also have the ability to comprehend complex disciplinary and cross disciplinary information related to the BCom and Masters degrees.III. Behavioural and Social Attributes: A student must possess behavioural and social attributes that enable them to participate in a complex learning environment and the emotional health required for full utilisation of his/her intellectual abilities. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students.",
            "Assessment may include the outcomes of tasks completed in collaboration with other students. Integrity, concern for others, interpersonal skills, interest, and motivation are all personal qualities that are deemed necessary for students enrolled in FBE courses.",
            "Students who feel their disability will prevent them from participating in tasks involving the inherent academic requirements of the BCom and FBE Masters courses are encouraged to contact the Disability Liaison Unit. Adjustments can be provided to minimise the impact of a disability, but students should participate in the course in an independent manner."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Business is comprised of four core subjects.",
                "Students will select four from a range of six 12.5 credit point intensively delivered online subjects. Students who complete the Graduate Certificate in Business may be eligible to progress to the Master of Management suite of programs or the Master of International Business.",
                "Subjects have no prerequisites or corequisites and can be taken in any order.",
                [
                    "ACCT90040",
                    "ECON90077",
                    "ECON90076",
                    "FNCE90075",
                    "MGMT90239",
                    "MKTG90038"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates of the Graduate Certificate in Business may apply for a place in the Master of Management or Master of International Business.",
        "Students wishing to apply to join the on-campus Master of Management or Master of International Business following successful completion of the certificate will be eligible for credit towards the masters degree."
    ]
}