{
    "Course name": "Graduate Certificate in Science",
    "Course code": "GC-SC",
    "Overview text": [
        "The Graduate Certificate allows students who have completed an undergraduate degree to re-focus or expand their body of knowledge by completing the requirement of an undergraduate major (or equivalent)",
        "The following areas of study are available:"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Science",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "62.5 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree, or equivalent; and",
            "appropriate prerequisite studies for the stream into which entry is sought. For stream specific requirements please see below:",
            "Prerequisite requirements:",
            "Applied Mathematics:Subject prerequisites – all three of MAST20009 Vector Calculus and MAST20026 Real Analysis and MAST20030 Differential Equations, or equivalent",
            "Chemistry:Subject prerequisites – all three of CHEM20018 Reactions and Synthesis and CHEM20019 Practical Chemistry 2 and CHEM20020 Structure and Properties, or equivalents",
            "Discrete Mathematics / Operations Research:Subject prerequisites – both of MAST20018 Discrete Mathematics and Operations Research and MAST20026 Real Analysis plus one of MAST20004 Probability or MAST20006 Probability for Statistics, or equivalents",
            "Genetics:Subject prerequisites – both of GENE20001 Foundations of Genetics and Genomics and GENE20004 Applications of Genetics and Genomics, or equivalents.",
            "Geology:Subject prerequisites – both of GEOL20002 Earth Structure, Geophysics, Geodynamics, GEOL20003 Building Earth: Rocks, Minerals, Magma, plus two of ERTH20001 Dangerous Earth, GEOL20001 Geology of Southeast Australia, GEOL20004 Field Mapping and Sedimentary Geology, or equivalents.",
            "Human Geography:Subject prerequisites – any three of GEOG20001 Society and Environments, GEOG20003 Environmental Politics and Management, GEOG20008 Inside the City of Diversity, GEOG20010 China in Transition, GEOG20011 Global Inequalities in the Anthropocene, GEOG20012 Post-Conflict Development and Difference, GEOG20013 Health Geography, GEOG20016 Fertility, Mortality and Social Change, GEOG20017 Spatial Analysis in Geography, GEOG20018 India: Economics, Politics and Society, or equivalents.",
            "Integrated Geography:Subject prerequisites - Students must have completed 37.5 points of: 12.5 to 25 points of Physical Geography: GEOG20002 Landscapes and Environmental Change, GEOG20015 Environmental Change and the Human Journey, GEOG20017 Spatial Analysis in Geography, ERTH20001 Dangerous Earth, FRST20014 Forests in a Global Context, UNIB20001 Climate Change II, or equivalents; plus 12.5 to 25 points of Human Geography: GEOG20001 Society and Environments, GEOG20003 Environmental Politics and Management, GEOG20008 Inside the City of Diversity, GEOG20010 China in Transition, GEOG20011 Global Inequalities in the Anthropocene, GEOG20012 Post-Conflict Development and Difference, GEOG20013 Health Geography, GEOG20016 Fertility, Mortality and Social Change, GEOG20017 Spatial Analysis in Geography, GEOG20018 India: Economics, Politics and Society, or equivalents.",
            "Medicinal Chemistry:Subject prerequisites – CHEM20019 Practical Chemistry 2 plus BIOM20002 Human Structure and Function or PHRM20001 Pharmacology: How Drugs Work and CHEM20018 Reactions and Synthesis Genetics, or equivalents",
            "Plant Science:Subject prerequisites – any three of BCMB20002 Biochemistry and Molecular Biology; BOTA20001 Green Planet: Plants and the Environment; BOTA20002 Plant Biodiversity; BOTA20004 Flora Victoria; CEDB20003 Fundamentals of Cell Biology, or equivalent",
            "Physical Geography:Subject prerequisites – any three of GEOG20002 Landscapes and Environmental Change, GEOG20015 Environmental Change and the Human Journey, GEOG20017 Spatial Analysis in Geography, ERTH20001 Dangerous Earth, FRST20014 Forests in a Global Context, UNIB20001 Climate Change II, or equivalents.",
            "Physics:Subject prerequisites – Two of PHYC20012 Quantum and Thermal Physics, PHYC20013 Laboratory and Computational Physics 2, PHYC20015 Special Relativity and Electromagnetism, MAST20009 Vector Calculus or equivalents and one of MAST10009 Accelerated Mathematics 2, MAST20026 Real Analysis, MAST20030 Differential Equations, PHYC20014 Theoretical Physics 2 or equivalents.",
            "Pure Mathematics:Subject prerequisites – all three of MAST20009 Vector Calculus and MAST20022 Group Theory and Linear Algebra and MAST20026 Real Analysis, or equivalents",
            "Statistics / Stochastic Processes:Subject prerequisites – both of MAST20005 Statistics and MAST20026 Real Analysis plus one of MAST20004 Probability or MAST20006 Probability for Statistics, or equivalents",
            "Zoology:Subject prerequisites – Both of MAST20031 Analysis of Biological Data and ZOOL20005 Animal Structure and Function, or equivalents.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Graduate Certificate in Science welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree.",
            "The Graduate Certificate in Science requires all students to enrol in subjects where they will require: 1. the ability to comprehend complex science, technology and/or engineering systems related information; 2. the ability to clearly and independently communicate a knowledge and application of science, technology and engineering systems principles and practices during assessment tasks; and in some areas of study; 3. the ability to actively and safely contribute in clinical, laboratory, and fieldwork/excursion activities.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "There are additional inherent academic requirements for some disciplines and subjects, and these requirements are listed within the description of the requirements for each of these disciplines and subjects. Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the relevant Subject Coordinator and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/",
            "Discipline‐specific Core Participation Requirements",
            "ChemistryCore participation requirements: Laboratory experiments This discipline requires students to actively, independently and safely participate in all practical classes, utilising a range of observational, communication, motor, intellectual, and behavioural and social skills. Visual acuity, muscle coordination and balance are essential for participation. Assessment is reliant on careful observation and visual interpretation of results.",
            "GeologyCore participation requirements: Fieldwork The sites essential to this fieldwork are not wheelchair accessible and require students to traverse broken ground. Visual observation and interpretation of the sites is also an essential component, as is specimen and microscope work.",
            "Plant ScienceCore participation requirements: Fieldwork, practicals and laboratory experiments This discipline requires all students to actively, independently and safely participate in all practical classes, utilising a range of observational, communication, motor, intellectual, and behavioural and social skills. Visual acuity, muscle coordination and balance are essential for participation. Details of the participation requirements can be found athttp://www.vet.unimelb.edu.au/docs/CoreParticipationReqsBSc.pdfThe sites essential to this fieldwork are not wheel chair accessible and may require students to traverse broken ground. Students are also required to undertake experiments including specimen and microscope work with assessment reliant on careful observation and visual interpretation of results. Practicals may also involve handling and working with animals.",
            "ZoologyCore participation requirements: Fieldwork, practicals and laboratory experiments This discipline requires all students to actively, independently and safely participate in all practical classes, utilising a range of observational, communication, motor, intellectual, and behavioural and social skills. Visual acuity, muscle coordination and balance are essential for participation. Details of the participation requirements can be found athttp://www.vet.unimelb.edu.au/docs/CoreParticipationReqsBSc.pdfThe sites essential to this fieldwork are not wheel chair accessible and may require students to traverse broken ground. Students are also required to undertake experiments including specimen and microscope work with assessment reliant on careful observation and visual interpretation of results. Practicals may also involve handling and working with animals."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Completion of 62.5 points of study:",
                [
                    "50 points of study at Level 3",
                    "12.5 points of study at Level 9"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students will be allowed to apply for entry into the associated Master of Science program after completing the undergraduate component (50 points) of the Graduate Certificate. Students who then enter the Master of Science will be able to have one level 9 subject cross-credited from their Master of Science back to their Graduate Certificate in Science in order to complete the Certificate"
    ]
}