{
    "Course name": "Graduate Certificate in Physiotherapy (Paediatrics)",
    "Course code": "GC-PHTYPAE",
    "Overview text": [
        "The Graduate Certificate in Physiotherapy (Paediatrics) is offered to physiotherapists who wish to enhance their knowledge and clinical management skills as a means of improving professional practice in paediatrics."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Physiotherapy (Paediatrics)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "Applicants must be qualified to practise as physiotherapists and should normally have at least two years' clinical experience with one of the two years preferably being in the area of course specialisation. Both academic achievement and clinical experience will be considered by the Selection Committee."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Student Support and Engagement Policy, academic requirements for this subject are articulated in the Subject Overview, Learning Outcomes, Assessment and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Physiotherapy (Paediatrics) comprises one core subject and two specialist subjects taught over two  x two  full-time weeks throughout the year. Assignments are submitted over the remainder of each semester."
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "PHTY90013",
                    "PHTY90030",
                    "PHTY90040"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of other graduate coursework programs."
    ]
}