{
    "Course name": "Graduate Certificate in Early Childhood Research",
    "Course code": "GC-ECHRES",
    "Overview text": [
        "The Graduate Certificate in Early Childhood Research is a coursework program which provides an introduction to research methodology and enables participants to design and complete a research project with a focus on early childhood. Research throughout the course is about uncovering new ideas, understandings, and knowledges through collaborative and thoughtful design that is contextual and relevant to local and global communities. The course is suitable for practicing early childhood educators and teachers, school teachers, policy makers, administrators/directors and university academics looking to upskill, build their capacity in undertaking early childhood research, create informed and responsive policy and decisions, and engage in continuous improvement practices in classrooms and beyond.",
        "This course is delivered completely online and utilises the Collective Model to support students throughout the course. The Collective Model brings together students in small groups with a Collective Mentor (staff mentor/lecturer) who leads conversations connecting the subject content to the research process, builds understanding of the connection between research and teaching, and facilitates sharing experiences and discussing questions and ideas. Through the Collective, students build a strong relationship with a staff member and have a consistent support system.",
        "Note that this course is not equivalent to theGraduate Certificate in Educational Research(which is designed to prepare individuals for a graduate research degree)."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Early Childhood Research",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree in any discipline.",
            "Meeting these requirements does not guarantee selection.",
            "2. In assessing applications, the Selection Committee will consider:",
            "Prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAcademic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.",
            "The inherent requirements for study in the Faculty of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education.",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Early Childhood Research requires the completion of 50 credit points of study over one year part time.",
                "Students must complete:",
                [
                    "2 compulsory subjects (totalling 50 points)"
                ]
            ]
        },
        "Subject Options": {
            "overview": [],
            "Compulsory Subjects": {
                "overview": [
                    "Complete the two online subjects in the following sequence:",
                    [
                        "EDUC91195",
                        "EDUC91196"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Professional and Continuing Education Degrees",
        "The University of Melbourne's Faculty of Education is widely recognised as a leader in continuing professional education.",
        "Graduates interested in further study in one of Faculty of Education’s suite ofgraduate coursework degreesmay have several options, depending on their prior qualifications, academic achievement, and professional experience. For more information about continuing professional study in Education, see theFaculty of Education Coursespage.",
        "Graduate Research Degrees",
        "The University of Melbourne's Faculty of Education is widely recognised as a leader in Australian and international education research.",
        "Graduates interested in further study in one ofFaculty of Education’s suite of graduate research degreesmay have several options, depending on their prior qualifications, academic achievement, research experience and professional experience. Entry to graduate research degrees is competitive. For more information about graduate research study in Education see theFaculty of Education Research Degreespage."
    ]
}