{
    "Course name": "Graduate Diploma in Psychology",
    "Course code": "340AA",
    "Overview text": [
        "Taught at the University of Melbourne since the 1800’s, psychology is a broad and intellectually stimulating scientific discipline that informs our understanding of human behaviour and experience from neural foundations to complex social interactions. Study in psychology prepares graduates for a diverse range of careers that are based on understanding human behaviour, including health, education, industry, commerce, welfare and government. More broadly, graduates are prepared to engage actively with philosophical, ethical and moral questions that are related to human behaviour.",
        "TheMelbourne School of Psychological Sciences’ Graduate Diploma in Psychologyis designed for graduates of other disciplines who may be interested in changing career direction and eventually qualifying as a registered psychologist, or for those who wish to study psychology simply out of interest in the discipline.",
        "The course is accredited by theAustralian Psychology Accreditation Council (APAC),providing the required foundational sequence of subjects for students wishing to undertake further study in psychology to pursue a career as a registered psychologist. An accredited foundational program in psychology is also the recommended pathway for students who wish to pursue a career as a researcher in psychology.",
        "The course is comprised of 125 credit points of psychology subjects, including eight compulsory psychology subjects (100 credit points), and two elective psychology subjects at Level 3, selected from a range of electives (25 credit points).",
        "Graduate Diploma in Psychology students undertake most of the same subjects and attend most of the same classes as students completing the accredited undergraduate major in Psychology, with the exception of two compulsory advanced level subjects that replace the two compulsory Level 3 subjects in the undergraduate major. The two advanced level subjects recognise the graduate status of the students and specify learning outcomes consistent with an AQF Level 8 qualification, particularly in relation to research methods and communication skills.",
        "The accredited sequence provides a strong grounding in core psychological concepts and theories in the areas of biological, cognitive, developmental, social, and clinical psychology, with reference to both the historical foundations of the discipline and to the latest cutting-edge research. The range of electives subjects in the final year provide the opportunity to develop in-depth knowledge in at least one domain of interest.",
        "The academic staff are internationally renowned researchers in their fields who guide students to develop advanced skills in critical thinking, scientific reasoning, psychological research design, data analysis and the application of research findings to a range of contexts. In addition, students develop their ethical reasoning skills and an awareness of and respect for the diversity of human experiences.",
        "The Graduate Diploma culminates in the Level 3Capstonesubject in which students pursue their own research project in small teams under the supervision of a member of academic staff.",
        "The Graduate Diploma in Psychology has been designed to enable flexible study options. Students can complete the entire 125 credit point accredited sequence of subjects inone year, full-time. Or, students can undertake the coursepart-timeover a period of up to six semesters. Students wishing to complete the course in one year full-time complete the two required Level 100 subjects in an intensive Summer Term and then enrol in the remainder of the course full-time over the following two semesters.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Psychology",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "061720G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "125 credit points",
        "Duration": "12 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree with a major other than Psychology, or equivalent.",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required.",
            "A mid-year intake is available for part-time students only. Graduates who apply and are selected for mid-year intake should note that their sequence of study will be different to those students who begin in the first semester. Applicants for mid-year entry will need to discuss their course plan with the Department prior to enrolling in the Graduate Diploma in Psychology."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne School of Psychological Sciences welcomes applications from students with disabilities. It is University and Faculty policy to take all reasonable steps to enable the participation of students with disabilities and reasonable adjustments will be made to enhance a student's participation in the Department's programs.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "The inherent academic requirements for study in Psychology are:",
            "The ability to comprehend complex disciplinary and interdisciplinary information related to the courses taught in the Faculty.",
            "The ability to clearly and independently communicate a knowledge and application of behavioural and social sciences principles and practices during assessment tasks.",
            "The ability to actively and safely contribute to laboratory-based learning activities.",
            "Students who feel their disability will prevent them from participating in tasks involving these inherent academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "The Graduate Diploma in Psychology is accredited by the Australian Psychological Accreditation Council (APAC) as the equivalent of an undergraduate Psychology major."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Diploma in Psychology involves the completion of ten Psychology subjects that are equivalent to an APAC accredited Psychology major.",
                "To qualify for the Graduate Diploma students must complete 100 points (eight subjects) of core subjects and 25 points (two subjects) of elective subjects."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Part-time course requirements": {
            "overview": [
                "Students enrolled in the part-time Graduate Diploma complete the course over two or three years, completing the following core subjects, plus two third-year elective subjects from the elective list below.",
                "One of:",
                [
                    "PSYC10003",
                    "PSYC90097",
                    "PSYC10006"
                ],
                "Plus one of:",
                [
                    "PSYC10004",
                    "PSYC90098",
                    "PSYC10007"
                ],
                "All of:",
                [
                    "PSYC20006",
                    "PSYC20008",
                    "PSYC20007",
                    "PSYC20009",
                    "PSYC40014",
                    "PSYC40013"
                ]
            ]
        },
        "Full-time course requirements": {
            "overview": [
                "Students enrolled in the Full-time Graduate Diploma complete the course in one year, including taking the two first-year subjects in the summer semester. They take the core second and third year subjects in first and second semesters, together with two elective subjects from the lower list (one in first semester and one in second semester).",
                [
                    "PSYC90097",
                    "PSYC90098",
                    "PSYC20006",
                    "PSYC20008",
                    "PSYC20007",
                    "PSYC20009",
                    "PSYC40014",
                    "PSYC40013"
                ]
            ]
        },
        "Elective Subjects": {
            "overview": [
                "All students, whether completing the Graduate Diploma in part-time or full-time mode, MUST complete two elective subjects in addition to the core subjects listed above. Ideally, one elective should be taken in each semester of the third-year (for part-time students) or in each semester of second- and third-year subjects (for full-time students).",
                [
                    "PSYC30012",
                    "PSYC30014",
                    "PSYC30016",
                    "PSYC30017",
                    "PSYC30018",
                    "PSYC30019",
                    "PSYC30020",
                    "PSYC30022",
                    "PSYC30023"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "In order to become eligible for registration as a Psychologist in Australia, it is necessary to complete an APAC accredited six-year sequence, consisting of an undergraduate major in Psychology (or its equivalent, eg Graduate Diploma), a fourth-year Honours program (or equivalent eg Advanced Graduate Diploma in Psychology) plus a two-year coursework Master's qualification, which includes substantial clinical placement components.",
        "Graduates of the Graduate Diploma are eligible to apply for entry to the Advanced Graduate Diploma of Psychology. Entry to the Advanced Graduate Diploma is by competitive selection and applicants must achieve a minimum grade average over second and third-level subjects of 77%."
    ]
}