{
    "Course name": "Graduate Diploma in Intellectual Property Law",
    "Course code": "276AA",
    "Overview text": [
        "Melbourne Law School's specialisation in intellectual property (IP) is one of the largest and most respected specialist IP law programs in the world. Its extensive range of challenging, cutting-edge subjects covers the spectrum of IP protection regimes, and are practically focused and theoretically rigorous. The majority of the specialisation's subjects are accredited by the Trans-Tasman IP Attorneys Board (TTIPAB). This program is recommended for those seeking accreditation as a patent and/or trade marks attorney."
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Intellectual Property Law",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "075327A",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "Start Year Intake 2024",
            "1. In order to be considered for entry, applicants must have completed:",
            "• a degree in Law (LLB, JD or equivalent) at honours standard or equivalent leading to admission to legal practice; or",
            "• a degree in Law (LLB, JD or equivalent) or equivalent leading to admission to legal practice and at least one year of documented, relevant professional experience; or",
            "• an undergraduate degree in a relevant discipline and at least one year of documented, relevant professional work experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "• prior academic performance; and if necessary",
            "• the professional experience.",
            "3.  The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Mid-year Intake 2024",
            "1. In order to be considered for entry, applicants must have completed:",
            "• a degree in Law (LLB, JD or equivalent) at honours standard or equivalent leading to admission to legal practice; or",
            "• a degree in Law (LLB, JD or equivalent) or equivalent leading to admission to legal practice and at least one year of documented, relevant professional experience; or",
            "• an undergraduate degree in a relevant discipline and at least one year of documented, relevant professional work experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "• prior academic performance; and if necessary",
            "• the professional experience.",
            "3.  The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.0 with no band less than 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne Law Masters welcomes applications from students with disabilities. The inherent academic requirements for study in the Melbourne Law Masters are:",
            "The ability to attend a minimum of 75% of classes and actively engage in the analysis and critique of complex materials and debate;",
            "The ability to read, analyse and comprehend complex written legal materials and complex interdisciplinary materials;",
            "The ability to clearly and independently communicate in writing a knowledge and application of legal principles and interdisciplinary materials and to critically evaluate these;",
            "The ability to clearly and independently communicate orally a knowledge and application of legal principles and interdisciplinary materials and critically evaluate these;",
            "The ability to work independently and as a part of a group;",
            "The ability to present orally and in writing legal analysis to a professional standard.",
            "Students who feel their disability will inhibit them from meeting these inherent academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Trans-Tasman IP Attorneys Board",
            "By satisfactorily completing appropriate subjects, a suitably qualified person may be accredited with satisfying all of the topic groups necessary for registration as a trade marks attorney and for registration as a patent attorney. Applicants seeking registration as a patent attorney and/or trade marks attorney seek advice from the TTIPAB and the Law School on subject selection at the time of enrolment. For more information, please visit the Melbourne Law SchoolIntellectual Property Law specialisationor theTrans-Tasman IP Attorneys Board."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete 50 credit points from the prescribed list.",
                "Students who do not have a law degree from a common law jurisdiction or any prior legal studies or experience are also expected to complete the two-day preliminary subjectAustralian Legal Process and Legal Institutions.Note: Most subjects in the MLM program are 12.5 credit points each. Check individual subject handbook entries for confirmation.",
                "Overview of Intellectual Property",
                "Overview of Intellectual Propertyis a two-day seminar that provides a general survey of the various regimes comprising intellectual property (IP). It is accredited by the TTIPAB as satisfying part of their accreditation requirements for Topic Group A."
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "LAWS90145",
                    "LAWS90046",
                    "LAWS70208",
                    "LAWS70207",
                    "LAWS70261",
                    "LAWS90126",
                    "LAWS90157",
                    "LAWS70418",
                    "LAWS90125",
                    "LAWS70387",
                    "LAWS70362",
                    "LAWS90178",
                    "LAWS90094",
                    "LAWS70242",
                    "LAWS70396",
                    "LAWS70061",
                    "LAWS70421",
                    "LAWS90129",
                    "LAWS70209",
                    "LAWS70021",
                    "LAWS70060",
                    "LAWS90183",
                    "LAWS90035",
                    "LAWS70046",
                    "LAWS90104",
                    "LAWS70406",
                    "LAWS90105",
                    "LAWS90286",
                    "LAWS90092",
                    "LAWS90299",
                    "LAWS90298"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}