{
    "Course name": "Graduate Certificate in Environment",
    "Course code": "GC-ENV",
    "Overview text": [
        "The Graduate Certificate in Environment is a flexible, multidisciplinary course that enables students to develop knowledge for professional practice in environment or sustainability. Depending on their academic background, interests and career aspirations students can choose from over 200 subjects taught by ten different faculties. The course is 50 points (equivalent to four subjects or six months full-time study).",
        "Last updated: 26 April 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Environment",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "040953G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree in any discipline with at least an H3 (65%) weighted average, or equivalent. ",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and, if relevant",
            "professional experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. The minimum English language requirements for this course are Band 6.5.",
            "Note:",
            "Students Completing the Graduate Certificate in Environment will be eligible for 50 points of credit into the Graduate Diploma of Environment or the Master of Environment.",
            "Students completing the Graduate Diploma in Environment will be eligible for 100 points of credit into the Master of Environment."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry. The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students who undertake the GC-ENV Graduate Certificate in Environment must take one core subject and then choose subjects 37.5 points of subjects selected from an approved subject list in consultation with an academic advisor.The relevant elective subjects are all approved for the tailored specialisation in the Master of Environment, please see the link below."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subject": {
            "overview": [
                "Students must complete the following core subject:",
                [
                    "MULT90004"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduate Diploma in Environment; Master of Environment."
    ]
}