{
    "Course name": "Graduate Certificate in Urban Horticulture",
    "Course code": "GC-URBHORT",
    "Overview text": [
        "The Graduate Certificate is designed for those with qualifications in disciplines other than horticulture. The course provides knowledge and vocational specific skills in the planning, installation and management of vegetation across a range of urban landscape applications.  The four core subjects encompass critical learning around the science, function and identification of landscape plants, as well as their propagation, cultivation and use. They also deliver outcomes important in the horticulture of urban landscapes, particularly in relation to soils, water, growing conditions and maintenance. Employment outcomes can be found in technical and planning roles in the areas of open space and landscape management, revegetation and restoration works and horticultural maintenance. Further study pathways are available to the Graduate Diploma and Master of Urban Horticulture.",
        "Last updated: 21 March 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Urban Horticulture",
        "Year & campus": "2024— Burnley",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree or a graduate or postgraduate certificate in any discipline with at least an H3 (65%) weighted average, or equivalent;",
            "OR",
            "an honours degree, graduate diploma or postgraduate diploma in any discipline, or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the University’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard test approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Compulsory core subjects (all 12.5 points), two in semester 1 and two in semester 2:",
                [
                    "HORT90008",
                    "HORT90033",
                    "ERTH90028",
                    "HORT90004"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}