{
    "Course name": "Graduate Certificate in Adolescent Health and Wellbeing",
    "Course code": "GC-ADOLHW",
    "Overview text": [
        "The Graduate Certificate in Adolescent Health and Wellbeing is a four subject course with a choice of two specialisations - ahealth promotionspecialisation and anoncologyspecialisation.",
        "The Graduate Certificate in Adolescent Health and Wellbeing is designed to enable students to:",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Adolescent Health and Wellbeing",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• either– an undergraduate degree in a cognate discipline such as Education, Health Science, Social Work or related discipline, or equivalent, or– an undergraduate degree in any discipline, or equivalent, and at least two years of documented relevant work experience, or– at least five years of documented relevant work experience, including clear evidence of career development, of professional writing, and generally of professional achievement or practice comparable to that expected of undergraduate degree holders;and• a curriculum vitae in a form prescribed by the Selection Committee.Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:• prior academic performance and/or work experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required.Note.• Students who complete the Graduate Diploma in Adolescent Health and Wellbeing with a weighted average mark of at least H2B (75%) will be permitted to transfer into the Master of Adolescent Health and Wellbeing with 100 points of credit.• Students who enter directly into the Master of Adolescent Health and Wellbeing program (having not previously completed the Graduate Diploma) are required to achieve with a weighted average mark of at least H2B (75%) in the Graduate Diploma level subjects in order to progress to the final 100 credit points of the Master of Adolescent Health and Wellbeing. Students who fail to achieve a 75% average in the Graduate Diploma level subjects are eligible to receive the Graduate Diploma as an exit award if all relevant subjects have been passed."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must satisfactorily complete either specialisation of four core subjects to qualify for the Graduate Certificate in Adolescent Health and Wellbeing."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                "Compulsory subjects for both specialisations are:",
                [
                    "POPH90167",
                    "PAED90007"
                ]
            ]
        },
        "Health Promotion Specialisation": {
            "overview": [
                "The following two subjects are compulsory for the Health Promotion Specialisation",
                [
                    "POPH90172",
                    "POPH90173"
                ]
            ]
        },
        "Oncology Specialisation": {
            "overview": [
                "The following two subjects are compulsory for the Oncology Specialisation",
                [
                    "PSYC90062",
                    "PAED90026"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Completion of the Graduate Certificate provides credit towards the Graduate Diploma in Adolescent Health and Wellbeing and the Master of Adolescent Health and Wellbeing."
    ]
}