{
    "Course name": "Graduate Certificate in Agricultural Sciences",
    "Course code": "GC-AGSC",
    "Overview text": [
        "Students will be introduced to many of the issues underpinning the advances in food and fibre production within the Australian and International Agriculture sectors. The available subjects within the Graduate Certificate in Agricultural Sciences cover a range of plant and animal disciplines as well as a focus on current and emerging environmental agricultural and associated industry impacts.",
        "Students undertake interdisciplinary studies in the nature of agricultural crop, food and fibre production and markets at an advanced level. Knowledge and skills are developed in environmental, economic, social and ethical factors related to plant- and animal-derived food and fibre production in Australia and globally. Graduates will have a foundation in the scientific principles and analytical skills behind improved agricultural production systems and their sustainability.",
        "The Graduate Certificate in Agricultural Sciences is a pathway into the Graduate Diploma and/or the Master of Agricultural Sciences."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Agricultural Sciences",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "085101C",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "The Selection Committee will evaluate the applicant’s ability to pursue the course successfully using the following criteria:",
            "1. In order to be considered for entry, applicants must have completed: either",
            "An undergraduate degree in any discipline, or equivalent with a weighted average mark of at least H3 (65%), or equivalent; or",
            "A minimum of six years documented relevant professional work experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection committee will consider:",
            "Prior academic performance; and, if relevant",
            "Professional experience.",
            "3. The Selection committee may seek further information to clarify any aspect of an application in accordance with the Academic BoardRuleson the use of selection instruments.",
            "4. Applicants are required to satisfy the University’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required.",
            "Notes:",
            "Successful applicants whose undergraduate degree is in a cognate discipline may receive up to 50 points credit towards the Masters.",
            "Successful applicants with an honours degree in a cognate discipline may receive up to 100 points credit towards the Masters.",
            "Successful applicants with completed graduate level subjects in a cognate discipline may receive credit towards the Masters, up to 100 points."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Science welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to make reasonable adjustments so as to enable the student’s participation in the Faculty's programs. The Faculty of Science contributes to the New Generation degrees and offers a broad range of programs across undergraduate and post-graduate levels many of which adopt a multi-disciplinary approach.",
            "Students of the Faculty's courses must possess intellectual, ethical, and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the Faculty. Students must have abilities and skills in observation; motor in relevant areas; communication; in conceptual, integrative, and quantitative dimensions; and in behavioural and social dimensions.",
            "Adjustments can be provided to minimise the impact of a disability, however students need to be able to participate in the program in an independent manner and with regard to their safety and the safety of others.",
            "I. Observation:In some contexts, the student must be able to observe demonstrations and experiments in the basic and applied sciences. More broadly, observation requires reading text, diagrams, maps, drawings and numerical data. Students should be able to observe details at a number of scales and record useful observations in discipline dependant contexts.",
            "II. Communication:Students must be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public.   Students should be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.",
            "III. Motor:Students should have sufficient motor function necessary for participation in the inherent discipline-related activities. The practical work, design work, field work, diagnostic procedures, laboratory tests, require varying motor movement abilities. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments.",
            "IV. Intellectual-Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving, the critical skill demanded of professionals in land and environment industries, requires all of these intellectual abilities. In addition, the student should be able to comprehend three-dimensional relationships and to understand the spatial relationships of structures.",
            "V. Behavioural and Social Attributes:Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel their disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                [
                    "Course core subject (12.5 credit points)",
                    "Discipline core subject (12.5 credit points)",
                    "Elective subjects (25 credit points)"
                ]
            ],
            "Course Core Subject": {
                "overview": [
                    "All students are required to take the core subject:",
                    [
                        "AGRI90097"
                    ]
                ]
            },
            "Discipline Core Subjects": {
                "overview": [
                    "Students must select ONE discipline core subject. The following subjects are recommended for specific disciplines:",
                    [
                        "Agribusiness - Choose AGRI90012 Agribusiness 1",
                        "Animal Science - Choose ANSC90004 Monogastric Science",
                        "Crop and Soil Sciences - Choose AGRI90066 Soil Science and Management",
                        "Food Sustainability - No specifically recommended subject. Please discuss options with course coordinator",
                        "Agricultural Innovation and Extension - Choose AGRI90092 Agricultural Advisory Practice and Theory"
                    ],
                    [
                        "ANSC90004",
                        "AGRI90012",
                        "AGRI90092",
                        "AGRI90066"
                    ]
                ]
            },
            "Elective Subjects": {
                "overview": [
                    "Students should choose their remaining 25 credit points from the following elective subject choices:",
                    [
                        "AGRI90066",
                        "ANSC90004",
                        "FOOD90041",
                        "ANSC90005",
                        "ANSC90006",
                        "FOOD90012",
                        "ENST90032",
                        "AGRI90014",
                        "FOOD90040",
                        "FOOD90034",
                        "ANSC90009",
                        "ANSC90002",
                        "FOOD90010",
                        "AGRI90057",
                        "NRMT90002",
                        "FRST90033",
                        "FOOD90033",
                        "FOOD90035",
                        "AGRI90012",
                        "ANSC90007",
                        "AGRI90092",
                        "AGRI90093",
                        "AGRI90089"
                    ]
                ]
            }
        },
        "Students intending to progress to Master of Agricultural Sciences": {
            "overview": [
                "If you are considering continuing onto the Master of Agricultural Sciences, you should note that there are five specialisations:",
                [
                    "Agribusiness",
                    "Animal Science",
                    "Crop and Soil Sciences",
                    "Food Sustainability",
                    "Agricultural Innovation and Extension"
                ],
                "You should determine which specialisation you wish to undertake at the Master level, especially as some subjects could be a pre-requisite for other subjects within the Masters. Choose your discipline core subject and elective subjects in the Graduate Certificate to suit your chosen specialisation."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students are able to progress to the GD-AGSC Graduate Diploma in Agricultural Sciences or the MC-AGSC Master of Agricultural Sciences."
    ]
}