{
    "Course name": "Graduate Certificate in Innovation Practice",
    "Course code": "GC-INNOVP",
    "Overview text": [
        "The Graduate Certificate in Innovation Practice is designed to allow students who are interested in innovation to augment their post-graduate degree with practical and focused experiences through which they can learn more about innovation, improve their capabilities as innovators, and work with a sponsoring organisation to develop career-relevant professional skills.",
        "The Certificate is offered to students from across the university, creating a highly interdisciplinary learning experience.   A significant portion of that experience is focused around helping a sponsoring organisation achieve its innovation objectives.  Sponsors are drawn from the commercial, government (principally health) and research sectors.",
        "Specifically, the Certificate comprises three subjects.  You can bring two subjects from other programs to accrue credit towards the Certificate, or you can use these subjects to extend your interests and capabilities in Human Centred Design (one subject) and Innovation (second subject). The centre of the Certificate is the subject Prototyping for Commercialisation (ENGR90045).   In this 25-point subject, you will work in a team with some students (generally two others) and one representative of the project sponsor, to take an innovation concept through three rounds of prototyping.  After the first two rounds, you will validate it with users/customers. This subject will allow you to build knowledge and skills in prototyping, human-centred design, project management, teamwork, and sponsor management.  In addition, you will develop a relationship with the sponsor, and learn about the domain of the innovation.",
        "This course is not listed on the Commonwealth Register of Institutions and Courses for Overseas Students (CRICOS) and therefore is not available to international students who require a student visa to study in Australia. International students who are located offshore, or who do not otherwise require a student visa to study in Australia are encouraged to contactFuture Studentsto discuss their eligibility to enrol in this course.",
        "Last updated: 9 May 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Innovation Practice",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed a three- or four-year degree. It can be in any field.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "• Whether or not the candidate has commenced or completed a higher degree (Master’s or Ph.D). The graduate certificate is designed to be taken alongside or subsequent to a higher degree.",
            "• The following attributes:",
            "• Prior relevant experience and education",
            "• Reasons for attempting the certificate",
            "• Personal characteristics associated with success in the certificate",
            "• Prior academic performance",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Innovation Practice is a 50-point qualification comprising three post-graduate level subjects:",
                [
                    "One Human-Centred Design subject (12.5 points) (prerequisite for Prototyping for Commercialisation) ",
                    "One Innovation-related subject (12.5 points) ",
                    "Prototyping for Commercialisation (25 points)  "
                ],
                "Candidates may not satisfy both the Human –Centred Design and Innovation-related subject requirements with one subject (HCD/Innovation)",
                [
                    "A human-centred design subject is one in which a design process is central to the curriculum and empathy with the user is central to that design process.  The subject includes collecting and analysing data from potential users to understand their needs and/or how they will use the object being designed.  Data may be collected by observation, interviewing, and/or analysis of “big data” datasets.   ",
                    "Innovation is fundamentally a process of linking a technology (broadly defined) to a receiving social context (market, social environment, organisation etc.) to create something new, and reduce it to practice.  Consequently, an innovation subject is any subject that deals with (1) the technological aspects of innovation, (2) receiving context aspects of innovation, AND (3) novelty.  Beyond that, the subject area can be very broad.   Innovation subjects might deal with design, venture creation, leadership, finance or regulatory processes in the context of innovation, among others.    "
                ],
                "The Human-Centred design subject is a pre-requisite for Prototyping for Commercialisation.",
                "Candidates may receive up to 25 points of advanced credit  based on subjects already completed.",
                "Candidates will propose their Human-Centred Design and Innovation subjects (12.5 credit points each), and whether or not they are seeking advanced credit, in their application.",
                "Students will complete Prototyping for Commercialisation (25 credit points):",
                [
                    "ENGR90045"
                ],
                "Please see list of subjects viaInnovation Practice Programor refer to the list of subjects that have previously been allowed per below.",
                "Human-Centred Design Subjects:",
                [
                    "ABPL90426",
                    "ABPL90427",
                    "BMEN30008",
                    "BMEN90030",
                    "BUSA90086",
                    "BUSA90527",
                    "BUSA90529",
                    "COMP90018",
                    "ENGM90016",
                    "ENGR90026",
                    "ENGR90034",
                    "ENGR90039",
                    "GEOM90007",
                    "INFO90003",
                    "INFO90004",
                    "INFO90006",
                    "INFO90008",
                    "INFO90010",
                    "LAWS90193",
                    "MCEN90050",
                    "MCEN90061",
                    "MGMT90223",
                    "MGMT90224",
                    "MGMT90230",
                    "MGMT90285",
                    "MGMT90286",
                    "MGMT90287",
                    "MKTG90041"
                ],
                "Innovation Subjects:",
                [
                    "ABPL90426",
                    "BMEN30008",
                    "BMEN90030",
                    "BMEN90039",
                    "BUSA90086",
                    "BUSA90527",
                    "BUSA90529",
                    "ENGM90016",
                    "ENGR90026",
                    "ENGR90034",
                    "ENGR90036",
                    "ENGR90039",
                    "FNCE90089",
                    "INFO90004",
                    "INFO90006",
                    "INFO90008",
                    "INFO90010",
                    "LAWS90193",
                    "MGMT90030",
                    "MGMT90165",
                    "MGMT90201",
                    "MGMT90223",
                    "MGMT90224",
                    "MGMT90225",
                    "MGMT90227",
                    "MGMT90229",
                    "MGMT90285",
                    "MGMT90286",
                    "MGMT90287",
                    "MKTG90037",
                    "MKTG90041"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}