{
    "Course name": "Graduate Diploma in Business Administration",
    "Course code": "GD-BAOL",
    "Overview text": [
        "The main aim of the program is to assist students to prepare for careers in management in a wide range of private, public and government organisations.",
        "This program is offered online, and students need to complete 112.5 credit points which consist of 87.5 credit points of core subjects and 25 credit points of selective core subjects.",
        "Last updated: 12 July 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Business Administration",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "112.5 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have:",
            "Completed an undergraduate degree and had two years of documented work experience.",
            "OR",
            "Had at least six years documented professional work experience.",
            "AND, all applicants must submit",
            "A personal statement (600 words) outlining why they wish to be considered for the course; and",
            "Two referees' reports.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Work experience; and",
            "The personal statement; and",
            "The referees' reports.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Admission and Selection into Course Policy.",
            "4. The minimum English language requirements for this course are Band 6.5.",
            "Notes:",
            "1. Student needs to complete Business Essentials as the first subject.",
            "2. Students who successfully complete 25 credit points will be eligible to receive the Professional Certificate in Business and Administration. Students who successfully complete 50 credit points will be eligible to receive the Graduate Certificate in Business Administration. Students who successfully complete 112.5 credit points will be eligible to receive the Graduate Diploma in Business Administration."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Graduate Diploma of Business Administration (112.5 credit points)",
                "87.5 credit points of core subjects, and",
                "25 credit points of selective core subjects",
                "Students who successfully complete 25 credit points will be eligible to receive the Professional Certificate in Business and Administration.",
                "Students who successfully complete 50 credit points will be eligible to receive the Graduate Certificate in Business Administration.",
                "112.5 credit points that include",
                "Core subjects (87.5 credit points)",
                "Core subjects:",
                [
                    "BUSA90059",
                    "BUSA90225",
                    "BUSA90003",
                    "BUSA90195",
                    "BUSA90246",
                    "BUSA90556",
                    "BUSA90557",
                    "BUSA90558"
                ],
                "Selective core - two subjects from the list below:",
                [
                    "BUSA90095",
                    "BUSA90229",
                    "BUSA90025"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}