{
    "Course name": "Graduate Diploma in Clinical Research",
    "Course code": "N34AA",
    "Overview text": [
        "This course provides individuals from medical and allied health professions (such as nurses, pharmacists, physiotherapists etc) and others with a science-based background and qualifications the opportunity to complete advanced formal training in Clinical Research.",
        "Consequently, students will have the opportunity to build a comprehensive range of skills in the general area of clinical research through the Graduate Certificate, higher-level theoretical skills in a relevant clinical speciality through the Graduate Diploma and applied skills in a relevant area of clinical speciality if they progress through to the Masters award."
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Clinical Research",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "055856G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• an undergraduate degree or equivalent qualification in medicine, an allied health profession, science or social science, and• at least one year of documented, relevant professional work experience in a medical, scientific or allied health environment.Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:• prior academic performance; and• the research experience or evidence of appropriate preparation or potential to undertake research; and• the capacity of a participating department to provide adequate supervision in a research project appropriate to the interests and preparation of the individual applicant.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "To satisfy the requirements of the Graduate Diploma in Clinical Research, students must complete a total of 100 points."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                "Students must complete the following 5 core subjects (75 credit points)",
                [
                    "CLRS90011",
                    "CLRS90013",
                    "CLRS90010",
                    "CLRS90027",
                    "CLRS90029"
                ]
            ]
        },
        "Elective Subjects": {
            "overview": [
                "Students must complete an equivalent of 25 credit points of elective subjects",
                [
                    "CLRS90016",
                    "CLRS90017",
                    "MEDI90019",
                    "INFO90001",
                    "ISYS90069",
                    "HLTH90006",
                    "CLRS90028",
                    "PADM90013",
                    "PADM90014"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "On successful completion of the Graduate Diploma or students will be eligible for 100 points credit towards the Masters programs in Clinical Research"
    ]
}