{
    "Course name": "Graduate Certificate in Sexual Health",
    "Course code": "GC-SEXHLTH",
    "Overview text": [
        "This course is aimed at health practitioners, particularly general practitioners or nurses training in sexual health, (or related fields) who may be in urban, regional or rural Australia. It is also suitable for public health practitioners and students who may have an interest in sexual health. The course draws on national and international developments in the diagnosis and public health control of sexually transmissible infections. It is delivered in a mixed mode, with most core and elective subjects fully online, but one core subject is dual delivery (fully online or online with on-campus classes)",
        "Graduates from this course will find it easier to enter careers related to sexual health in the fields of clinical care, research, the pharmaceutical industry, or hospitals.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Sexual Health",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "• either",
            "– a health related degree, or equivalent, or",
            "– an undergraduate degree in a cognate discipline or equivalent.",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "• prior academic performance.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required.",
            "NOTES:",
            "Successful applicants with completion of master’s level Graduate Certificate in Sexual Health subjects may be eligible for up to 25 points advanced standing.",
            "This Certificate is used as a pathway to the Master of Public Health only and as an exit point from an incomplete Master of Public Health. Students will not be able to take this Certificate concurrently with the Master of Public Health."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Description, Course Objectives and Generic Skills of this entry.The University is dedicated to provide support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Four subjects taken over one or two years part-time (one or two subjects per semester)"
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                "Students must complete at least 2 of the following 3 core subjects:",
                "Please note that POPH90068 Sexually Transmissible Infections now incorporates the learning objectives of Control of Sexual Transmissible Infections (previous subject). Existing students who have already completed either Control of STIs or Sexually Transmissible Infections should enrol in Adolescent Sexuality and Sexual Health as their core requirement. Students with a clinical background may enrol in both POPH90070 and POPH90069.",
                [
                    "POPH90070",
                    "POPH90069",
                    "POPH90068"
                ]
            ]
        },
        "Electives": {
            "overview": [
                "Additional elective subjects can be drawn from any public health/sexual health related subject within the Faculty of Medicine, Dentistry and Health Sciences but will need to be approved by the Course Coordinator before the student enrols in it and in agreement with the appropriate other course authority.",
                [
                    "POPH90169",
                    "GENP90017"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Subjects completed within this degree from the University of Melbourne may receive advanced standing (with credit) within the Master of Public Health.",
        "This Graduate Certificate cannot be taken concurrently with the Master of Public Health. The Graduate Certificate cannot be claimed retrospectively when the relevant subjects are taken as part of a completed Master of Public Health."
    ]
}