{
    "Course name": "Graduate Certificate in Education (Learning Difficulties)",
    "Course code": "GC-EDLD",
    "Overview text": [
        "The Graduate Certificate in Education (Learning Difficulties) will develop understandings of learning difficulties and interactions between different types of learning difficulties, including dyslexia and dyscalculia. The course will enhance participants’ skills in classroom assessment, including the administration of screening tools, probes, checklists, and informal measures, alongside commonly used standardised tests, in order to augment goal setting, instructional choices and responsiveness to learning difficulties. Data-based decision-making, ongoing progress monitoring, and the provision of increasing levels of support for learners in classrooms, schools and systems will be framed using multi-tiered prevention logic. Inclusive pedagogies such as Universal Design for Learning, differentiation, and matching adaptations to learner need will be explored. The course provides a foundation for the Master of Learning Intervention."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Education (Learning Difficulties)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "either",
            "a four-year education degree, or equivalent; or",
            "a three-year undergraduate qualification and a fourth-year level education qualification, or equivalent; or",
            "a three-year undergraduate qualification in an area related to education (such as social work, speech pathology, psychology or occupational therapy) and at least two years of documented, relevant work experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "work experience if relevant.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAcademic Board ruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student's participation in the Faculty's programs. The core participation requirements for study in the Faculty of Education are:",
            "In all courses:",
            "The ability to comprehend complex information related to education and the disciplines in which the student is teaching.",
            "The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "Behavioural and social attributes that enable a student to participate in a complex learning environment.",
            "Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students.",
            "Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "In courses requiring students to undertake practicum placements, the ability to undertake professional practice placements independently, including:",
            "The ability based on personal maturity to establish a professional relationship with students and interact with them appropriately.",
            "The ability to communicate to students the subject matter being taught with clarity and in a way that is age-sensitive.",
            "The ability to model literacy and numeracy skills independently for students and in all their interactions meet community expectations of the literacy and numeracy skills teachers should have.",
            "The ability to demonstrate skilfully and safely activities required in particular discipline areas being taught (e.g. physical education activities, science laboratory techniques).",
            "The ability to create, monitor and maintain a safe physical environment, a stable and supportive psychological environment and a productive learning environment in their classroom.",
            "The ability to establish effective relationships with all members of the school community, including colleagues, students and caregivers.",
            "The ability based on mental and physical health to exercise sound judgement and respond promptly to the demands of classroom situations, and the personal resilience to cope and maintain their wellbeing under stress.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Education (Learning Difficulties) requires the successful completion of four compulsory subjects (50 credit points), which may be completed over either:",
                [
                    "2 years of part-time study, by taking 1 subject per semester; or",
                    "1 year of part time study, by taking 2 subjects per semester."
                ],
                [
                    "EDUC91191",
                    "EDUC90194",
                    "EDUC90195",
                    "EDUC91192"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates of this course may be eligible for 50 credit points of advanced standing towards the University of Melbourne’s Master of Learning Intervention."
    ]
}