{
    "Course name": "Graduate Certificate in Social Change Leadership",
    "Course code": "GC-SCL",
    "Overview text": [
        "The Graduate Certificate of Social Change Leadership is offered to Fellows undertaking the Atlantic Fellows for Social Equity Program (AFSE). The program focusses on developing social change leaders through immersive Indigenous knowledges environments working in critical dialogue with other knowledge systems. Fellows will be equipped with knowledge and skills drawn from a range of disciplines and immersive contexts and take a comparative and global focus. It provides opportunities for Fellows to engage with the wide-ranging dimensions of social change leadership with the goal of working on complex social and environmental issues concerning Indigenous communities.",
        "The program is designed to enable the Fellows to act as catalysts in partnership with communities and organisations to generate Indigenous knowledge informed social change. This is an interdisciplinary and wide-ranging program that draws on expertise from leading academics in the University of Melbourne and Indigenous community leaders."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Social Change Leadership",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a) An application to the Atlantic Fellows for Social Equity program, which requires:",
            "At least 5 years of documented work experience in the social change field working with or for Indigenous communities, institutions and peoples across Australia, New Zealand and/or Pacific Island nations",
            "Two references; and",
            "Workplace notification of release (if employed); and",
            "An outline of a social change project proposal (maximum 1000 words); and",
            "A short application video (maximum 1.5 minutes)",
            "Applicants must have been accepted into the Atlantic Fellows for Social Equity program, before applying for the Graduate Certificate in Social Change Leadership.",
            "b) An application to the Graduate Certificate in Social Change Leadership, which requires:",
            "A pass level undergraduate degree or equivalent; or",
            "At least five years of documented, relevant work experience;",
            "Meeting these requirements does not guarantee selection.",
            "2. In assessing applications, the Selection Committee will consider:",
            "Acceptance into the Atlantic Fellows for Social Equity program; and",
            "The documented, relevant work experience, if applicable",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the University’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band7 is required.",
            "Notes:",
            "Details of the Atlantic Fellows for Social Equity program application are available on theAtlantic Fellows for Social Equity website."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student's participation in the Faculty's programs.",
            "The core participation requirements for study in the Graduate Certificate in Social Change Leadership are:",
            "1. The ability to comprehend complex information related to Indigenous-led social change and the fields in which the Fellow practises;",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines;",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment.",
            "Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact Student Equity and Disability Support.https://students.unimelb.edu.au/student-support/student-equity-and-disability-support"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate of Social Change Leadership requires the successful completion of 50 credit points.  It is completed over one year of study.",
                "To obtain the degree Fellows must complete 50 credit points of study choosing from the following list of subjects:",
                [
                    "INDG90002",
                    "INDG90003",
                    "INDG90004",
                    "INDG90005",
                    "INDG90006"
                ],
                "Note:",
                [
                    "The recommended enrolment pattern for Fellows undertaking the Graduate Certificate is INDG90002 (12.5 points), INDG90004 (25 points); and INDG90005 (12.5 points).",
                    "Prior to admission, Fellows will be asked to consider their preferred course (i.e., Master of Social Change Leadership, or Graduate Certificate in Social Change Leadership). On acceptance into the program, Fellows discuss their study options with AFSE and consult with the Course                    Coordinator to discuss their intended selection of core subjects for the Graduate Certificate (GC-SCL). Subject selection and timing will have a bearing on overall Atlantic Fellows for Social Equity program enrolment.",
                    "Fellows in the GC-SCL who are interested in transferring to the MC-SCL Master of Social Change Leadership (and who meet the MC-SCL entry requirements) will need to complete INDG90002 Enacting Influence as a core subject. Consult with the AFSE program team regarding the process      and deadline for transfer to the MC-SCL."
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The Graduate Certificate in Social Change Leadership may serve as a pathway to further graduate coursework study, such as a Master’s (coursework) degree."
    ]
}