{
    "Course name": "Graduate Certificate in Physiotherapy (Pelvic Floor Physiotherapy)",
    "Course code": "GC-PHTYPFP",
    "Overview text": [
        "This course aims to further enhance physiotherapists' knowledge of epidemiology, health issues related to incontinence, and the anatomy, applied anatomy, physiology and pathology relevant for the assessment and treatment of incontinence. Diagnostic techniques, prevention and intervention strategies including exercise, electrotherapy, biofeedback and continence devices will be addressed. Course content will include specific issues related to adult female and male continence, anorectal continence, incontinence in children and in the older population. The course will require active participation by student in physical assessment and supervised clinical practice. Participants will also develop skills in the use of outcomes measures, the design of single case design studies, and critical review of the literature pertaining to problems of continence."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Physiotherapy (Pelvic Floor Physiotherapy)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• a degree that qualifies graduates to practise as physiotherapists; and• registration to practise physiotherapy in Australia; and• at least two years of documented relevant clinical experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:• prior academic performance; and• the clinical experience (applicants with experience in the area of course specialisation may be favoured).",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note.Overseas or otherwise non-registered applicants must acquire temporary registration for the purposes of postgraduate study through AHPRA. 25 credit points of advanced standing will be granted on completion of the Professional Portfolio, which is a pre-admission requirement."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Physiotherapy (Pelvic Floor Physiotherapy) consists of one core subject taught in semester 1 or semester 2 and two (2) specialist subjects taught over four full-time weeks in June each year. Over the remainder of the semester, assignments are submitted and 40 hours of supervised clinical practice are completed.",
                "Students must complete three (3) subjects to be eligible to graduate."
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "PHTY90002",
                    "PHTY90003",
                    "PHTY90040"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students may continue on to the online Master of Rehabilitation Science, the Master of Sports Medicine or the Master of Sports Rehabilitation. Applicants to these courses who have successfully completed a Graduate Certificate within the previous five (5) years, will be eligible to receive 25 points of credit towards their course (this is the maximum credit which can be granted)."
    ]
}