{
    "Course name": "Graduate Certificate in Health Economics and Economic Evaluation",
    "Course code": "GC-HLTHEEE",
    "Overview text": [
        "The Graduate Certificate of Health Economics and Economic Evaluation offers students the opportunity to develop core skills and knowledge in health economics. Students will learn the fundamental principles of health economics, gain an awareness of the Australian health care system and the complexities of health care finance and resource allocation within a global context.",
        "During the course students will take three core subjects and one elective that will provide a rigorous foundation in health economics theory and application. Two of the subjects focus on the techniques and application of economic evaluation and health technology appraisal (HTA). Through these students will learn and practice techniques in economic evaluation and develop data analysis skills using relevant software.",
        "On successful completion of the course students will be able to evaluate health economics evidence and apply this knowledge to support policy decisions. The course supports career development within health economics and economic evaluation research, consultancy, market access, and health policy roles. The skills students learn within this course will ultimately help them improve the efficiency and fairness of health care systems and ensure health care interventions deliver value for money.",
        "In addition, students will have the opportunity to progress to a Master of Public Health at the University of Melbourne.",
        "This course is suitable for graduates from a range of disciplines and no prior background in economics is required.",
        "The course is ideal for those considering a move into a career as a health economist, but also for practitioners and managers working in health care wishing to understand more about health care systems, finance and priority setting to support their work.",
        "",
        "Last updated: 9 February 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Health Economics and Economic Evaluation",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "18 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• A pass-level undergraduate degree in any disciplineMeeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:• Prior academic performance; and• Economics and health-related work experience, as evidenced by a CV provided by the candidate.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Notes:Successful applicants with completion of master’s level health economics and/or economic evaluation subjects may be eligible for up to 25 points advanced standing."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Health Economics and Economic Evaluation requires the successful completion of 50 credit points.",
                "Students must complete POPH90094 before POPH90229, and POPH90093 before POPH90095.",
                "Students must complete the following three compulsory subjects:",
                [
                    "POPH90094",
                    "POPH90093",
                    "POPH90095"
                ],
                "And one of the following two electives:",
                [
                    "POPH90229"
                ],
                [
                    "POPH90302"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Subjects completed within this degree from the University of Melbourne may receive advanced standing (with credit) within the Master of Public Health.",
        "This Graduate Certificate cannot be taken concurrently with the Master of Public Health. The Graduate Certificate cannot be claimed retrospectively when the relevant subjects are taken as part of a completed Master of Public Health."
    ]
}