{
    "Course name": "Graduate Diploma in Surgical Education",
    "Course code": "GD-SURGED",
    "Overview text": [
        "The program has been developed to address the specialised needs of teaching and learning in surgical environments. Surgical education is unique within the broader discipline of medical education characterised by the clinical settings in which surgery is taught. Technology has had a significant impact and will play an increasingly important role in teaching and learning the complex sets of skills required for safe surgical practice.",
        "The program is designed to support surgeons in developing expertise in teaching and to promote educational scholarship. There are core and elective subjects. The program content reflects critical issues in the broader education community together with specific challenges for surgical education – the role of regulatory bodies, balancing clinical service with training, teaching and learning in the workplace, ethical imperatives for simulation-based education, and safer working conditions including safe hours. Students complete a capstone or minor thesis in their final year. The online delivery mode offers flexibility essential for busy professionals undertaking studies in conjunction with clinical commitments."
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Surgical Education",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• a Doctor of Medicine or Bachelor of Medicine/Bachelor of Surgery or equivalent qualification, and• at least two years of documented relevant clinical work experience.Meeting these requirements does not guarantee selection.2. In ranking and/or assessing applications, the Selection Committee will consider:• prior academic qualification and performance; and• the professional experience.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university's English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Please refer to website."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete the 4 core subjects (12.5 credit points each) and choose another 4 elective subjects (12.5 credit points each) from the list below."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                [
                    "MEDS90006",
                    "MEDS90007",
                    "MEDS90008",
                    "MEDS90009"
                ]
            ]
        },
        "Elective subjects": {
            "overview": [
                "Students must choose 4 of the following elective subjects.",
                [
                    "MEDS90011",
                    "MEDS90012",
                    "MEDS90013",
                    "MEDS90014",
                    "MEDS90015",
                    "MEDS90016",
                    "MEDS90017",
                    "MEDS90018"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who completed the Graduate Diploma in Surgical Education can gain a full credit (100 credit points) toward the Master of Surgical Education."
    ]
}