{
    "Course name": "Graduate Diploma in Mental Health Nursing Practice",
    "Course code": "GD-MHNP",
    "Overview text": [
        "The Graduate Diploma in Mental Health Nursing Practice is a 100 credit-point coursework program offered online with clinical specialty practice competency requirements. Students complete seven 12.5 credit point theory subjects and two 6.25 credit point nursing practice subjects either full-time over one year or part-time over two years.",
        "Last updated: 2 August 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Mental Health Nursing Practice",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have:",
            "Completed a Bachelor of Nursing, or equivalent qualification (i.e. Master of Nursing Science entry to practice); and",
            "Current unrestricted registration with AHPRA; and",
            "Clinical support from a partnering health service and be employed a minimum of three (3) days or 24 hours per week for the standard course duration in a clinical setting that will provide the relevant clinical experience to meet course learning outcomes",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance",
            "Area of speciality practice and clinical experience",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Student Support and Engagement Policy, academic requirements for this subject are articulated in the Subject Overview, Learning Outcomes, Assessment and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support:http://services.unimelb.edu.au/disability"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Diploma in Nursing Practice (Mental Health) is a 100 credit point course consisting of six 12.5 CP core specialty subjects, two 6.25 CP nursing practice subjects, and one 12.5 CP elective subject."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core subjects": {
            "overview": [
                [
                    "NURS90077",
                    "NURS90078",
                    "NURS90012",
                    "NURS90018",
                    "NURS90093",
                    "NURS90101",
                    "NURS90119",
                    "NURS90120"
                ]
            ]
        },
        "Elective subjects": {
            "overview": [
                [
                    "NURS90025",
                    "NURS90067",
                    "NURS90072",
                    "NURS90076",
                    "SCWK90027",
                    "HLTH90009",
                    "HLTH90007",
                    "PSYT90112",
                    "PSYT90097",
                    "NURS90141",
                    "NURS90142",
                    "PSYT90092",
                    "NURS90070",
                    "POPH90302"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}