{
    "Course name": "Graduate Diploma in Biostatistics",
    "Course code": "GD-BIOSTAT",
    "Overview text": [
        "The Graduate Diploma in Biostatistics provides advanced biostatistical training with a solid foundation in mathematics and probability for a diverse range of students. Graduates acquire specialised knowledge and skills in the statistical methods used in health and medical investigations, with the necessary mathematical foundation to integrate sophisticated statistical understanding and specialised skills into their training. On completion of the Graduate Diploma, graduates will have attained the required skills for employment as a biostatistician.",
        "Please note:mid-year intake to this course is not available for international students.",
        "Last updated: 18 July 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Biostatistics",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "088479M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "A Bachelor degree in a relevant discipline, such as statistics, mathematics, biomedicine, psychology, science, pharmacy, health sciences, economics, from an approved university, with an average mark over the degree of at least 70% or equivalent; and",
            "Successful completion (average mark of 65%) at tertiary level of at least one mathematics subject, including elements of multivariable calculus and linear algebra.",
            "Applicants may be required to attend a test to elucidate any of the matters listed above.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Where relevant, performance in an interview or test, and/or referee reports or employer references.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceBand6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Description, Course Objectives and Generic Skills of this entry.The University is dedicated to provide support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "The Graduate Diploma in Biostatistics course is accredited by the Statistical Society of Australia, which means that graduates automatically qualify for registration with the professional qualification of Graduate Statistician."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "FIVEcore subjects andTHREEelectives (100 points)"
            ]
        },
        "CORE SUBJECTS": {
            "overview": [
                "Students must complete the followingFIVE COREsubjects:",
                [
                    "MAST90100",
                    "POPH90014",
                    "MAST90101",
                    "MAST90102",
                    "MAST90099"
                ]
            ]
        },
        "ELECTIVE SUBJECTS": {
            "overview": [
                "Students must chooseTHREEsubjects from the following list of electives:",
                [
                    "POPH90118",
                    "POPH90117",
                    "POPH90123",
                    "ISYS90069",
                    "POPH90124",
                    "MAST90140",
                    "MAST90083",
                    "POPH90119",
                    "MAST90027",
                    "POPH90242",
                    "INFO90002",
                    "COMP90041",
                    "POPH90139",
                    "POPH90094",
                    "SCIE90013",
                    "MAST90141",
                    "POPH90112"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}