{
    "Course name": "Graduate Certificate in Infectious Disease Epidemiology",
    "Course code": "GC-IDEPI",
    "Overview text": [
        "The Graduate Certificate in Infectious Disease Epidemiology provides the baseline skills necessary to work in the field of infectious disease investigation, monitoring, reporting, decision making and research. Within this degree students will learn to use surveillance data, investigate outbreaks, and analyse and interpret information from studies of infectious diseases.",
        "The course covers the fundamental concepts of epidemiology and biostatistics, and the application of these concepts to infectious disease epidemiology and modelling. Students completing the course will be able to contribute to infectious diseases epidemiologic or medical research, analyse data and critically appraise evidence for public health decisions.",
        "Students interested in further study at the completion of the Graduate Certificate will be well placed to undertake:",
        "Last updated: 16 August 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Infectious Disease Epidemiology",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "Graduate Certificate in Infectious Disease Epidemiology",
            "1. In order to be considered for entry, applicants must have completed:\nA pass-level undergraduate degree in any discipline\n",
            "2. A pass-level undergraduate degree in any discipline",
            "A pass-level undergraduate degree in any discipline",
            "Meeting these requirements does not guarantee selection.",
            "1. In ranking applications, the Selection Committee will consider:\n\nPrior academic performance; and\nPublic health and health-related work experience, as evidenced by a CV provided by the candidate\n\n\n",
            "2. Prior academic performance; and",
            "3. Public health and health-related work experience, as evidenced by a CV provided by the candidate\n",
            "4. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.\n",
            "5. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Prior academic performance; and",
            "Public health and health-related work experience, as evidenced by a CV provided by the candidate\n",
            "Notes:",
            "Successful applicants with completion of master’s level epidemiology and/or biostastitstic’s subjects may be eligible for up to 25 points advanced standing.",
            "This Certificate is used as a pathway to the MPH only and as an exit point from an incomplete MPH. Students will not be able to take this Certificate concurrently with the Master of Public Health."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "To qualify for the Graduate Certificate in Infectious Disease Epidemiology, students must successfully complete:",
                [
                    "Four compulsory subjects (50 credit points)"
                ]
            ]
        },
        "Core Subjects": {
            "overview": [
                "Students must complete the following four Compulsory subjects (50 points):",
                [
                    "POPH90013",
                    "POPH90014",
                    "POPH90112",
                    "POPH90271"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Subjects completed within this degree from the University of Melbourne may receive advanced standing (with credit) within the Master of Public Health.",
        "This Graduate Certificate cannot be taken concurrently with the Master of Public Health. The Graduate Certificate cannot be claimed retrospectively when the relevant subjects are taken as part of a completed Master of Public Health."
    ]
}