{
    "Course name": "Graduate Diploma in Psychology (Advanced)",
    "Course code": "GDA-PSYCH",
    "Overview text": [
        "Psychology is a broad and intellectually fascinating scientific discipline with a focus on understanding behaviour and experience, particularly in humans. The science of psychology involves a wide range of perspectives and approaches, with psychological research findings having important applications in areas such as health, education, business and commerce, as well as informing us about how human behaviours and motivations relate to a wide range of societal issues.",
        "The Melbourne School of Psychological Sciences’Graduate Diploma in Psychology (Advanced)is accredited by the Australian Psychology Accreditation Council (APAC) as a pathway for graduates of other disciplines, who have subsequently been awarded the equivalent of an undergraduate major in psychology, to complete an accredited fourth year in psychology.",
        "An APAC accredited fourth year in Psychology is a prerequisite for the further studies in Psychology that are required to register as a practicing psychologist; it is also the recommended pathway for students wishing to undertake a higher research degree in Psychology to pursue a career in psychological research.",
        "The Graduate Diploma in Psychology (Advanced) has been designed to build on the knowledge and skills attained in the APAC accredited Graduate Diploma in Psychology. The course provides students with flexibility and choice in advanced coursework in the core discipline areas of Psychology, as well as an opportunity to undertake advanced training in the conduct of a significant research project, and to develop pre-professional knowledge of the ethical principles and assessment and interviewing skills that underpin further professional training as a psychologist.",
        "Note: The Graduate Diploma in Psychology (Advanced) is identical in content and assessment to the Psychology Honours program (via the Bachelor of Arts or Bachelor of Science). However, the two programs differ in their award requirements. Honours students require a minimum overall mark of 65% to be awarded the degree, whereas Graduate Diploma in Psychology (Advanced) students require a minimum overall mark of 50%. The academic results obtained through both courses are considered equivalent for those intending to undertake further study.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Psychology (Advanced)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "026666K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree that includes an Australian Psychology Accreditation Council (APAC) accredited major in Psychology with a weighted average of at least 70% (H2B) in second and third-year subjects within the major, or equivalent, within the last 10 years. In computing the weighted average, the average of the third year Psychology subjects is assigned twice the weight of the average of the second year Psychology subjects.",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required.",
            "Notes",
            "For applicants with results from the University of Melbourne for subjects undertaken in Semester 1, Winter Term and/or Semester 2, 2020, the following will apply:",
            "A Psychology Benchmark will be established based on all psychology subjects completed any time other than Semester 1, Winter Term and Semester 2, 2020.",
            "Subjects undertaken in Semester 1, Winter Term and/or Semester 2, 2020, for which results are lower than the Psychology Benchmark will be excluded from the entry score calculation.",
            "The above changes do not apply to yearlong subjects undertaken in 2020; such results will be included in the entry score calculation.",
            "In the case that applying this rule results in no eligible Level 2 and Level 3 marks for inclusion, then the Psychology Benchmark will be used as the entry score.",
            "For external applicants, the benchmark will not apply and we will use numerical scores for all available level 2 and level 3 psychology subjects in the selection formula.",
            "Pass/fail grades will be excluded from the selection formula.",
            "In the case that excluding pass/fail subjects from the selection formula leaves either the Level 2 or Level 3 terms in the formula empty, the entry score will be the non-empty term (i.e., average of eligible Level 2 subjects if no Level 3 marks are eligible for inclusion; average of eligible Level 3 subjects if no Level 2 marks are eligible for inclusion).",
            "For the avoidance of doubt, the exclusion of results based on the Psychology Benchmark does not apply to any study periods other than those listed above."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne School of Psychological Sciences welcomes applications from students with disabilities. It is University and Faculty policy to take all reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student's participation in the Department's programs.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "The inherent academic requirements for study in Psychology are:",
            "The ability to comprehend complex disciplinary and interdisciplinary information related to the courses taught in the Faculty.",
            "The ability to clearly and independently communicate a knowledge and application of behavioural and social sciences principles and practices during assessment tasks.",
            "The ability to actively and safely contribute to laboratory-based learning activities.",
            "Students who feel their disability will prevent them from participating in tasks involving these inherent academic requirements are encouraged to contact the Student Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "The Graduate Diploma in Psychology (Advanced) is accredited by the Australian Psychological Accreditation Council as the fourth-year of a professionally accredited six-year sequence."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Diploma in Psychology (Advanced) program involves the completion of four advanced coursework subjects and a research project subject.",
                "Each advanced coursework subject entails 400-level lectures and seminars, literature reviews, oral presentations, and other activities. The research project subject comprises two asignment components: Literature review and empirical thesis in the format of a journal article completed under the guidance of an academic who specialises in your area of interest.",
                "Students' academic transcripts will record a separate result for each advanced coursework subject they undertake as part of the Graduate Diploma in Psychology (Advanced), and the research project subject.",
                "This course is normally undertaken on a full-time basis, and is completed within a year. There is, however, provision for part-time enrolment over two years. In this case, students must complete the entire coursework component in the first year and the research project in the second year. Transfer from full-time enrolment to part-time enrolment will not be permitted after the commencement of the first semester.",
                "Course Requirements",
                "To qualify for the Graduate Diploma in Psychology (Advanced) students must:",
                [
                    "pass 100 points at the fourth-year level; and",
                    "achieve an overall weighted average of at least 50 percent for their honours studies."
                ],
                "Some subjects have hurdle requirements that must also be met."
            ]
        },
        "Subject options": {
            "overview": [
                "Graduate Diploma in Psychology (Advanced)"
            ]
        },
        "Compulsory Subjects": {
            "overview": [
                [
                    "PSYC40005",
                    "PSYC40006",
                    "PSYC40010"
                ]
            ]
        },
        "Elective Subjects (Select Two)": {
            "overview": [
                [
                    "PSYC40001",
                    "PSYC40002",
                    "PSYC40004",
                    "PSYC40012"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates of the Graduate Diploma in psychology who achieve a grade average of 75% over the third-year of their undergraduate psychology studies and the Graduate Diploma in Psychology (Advanced) are eligible to apply for entry to the University of Melbourne's Master of Psychology program."
    ]
}