{
    "Course name": "Graduate Certificate in Aboriginal Health in Rural Communities",
    "Course code": "GC-AHRC",
    "Overview text": [
        "The Graduate Certificate in Aboriginal Health in Rural Communities is designed to develop students understanding of health‐related knowledges, their applications in Aboriginal communities, and the broadly social factors that influence experiences of health in Aboriginal community settings. Specifically, the course examines the integration, overlap, and disjuncture of Aboriginal knowledges and Western knowledges of health in which Aboriginal health services operate (the first compulsory subject), and how historical, social and cultural processes as well as processes of power impact upon the health experiences of Aboriginal and/or Torres Strait Islander Australians. It also includes undertaking a community‐based project within an Aboriginal health setting (the second compulsory subject). In undertaking this course, students will gain advanced understanding of how both Aboriginal and Western knowledges can be applied to the field of health in rural Aboriginal communities. It will provide students with strong analytical and critical thinking skills as well as skills in community development, project management and basic research that, in consultation with community and academic mentors, will assist individual students to achieve their academic and professional career objectives.",
        "The course requires completion of two compulsory subjects delivered in a blended mode through the Department of Rural Health, and two elective subjects from the Master of Public Health program. For the two compulsory subjects, students attend short teaching intensive days on campus (Shepparton) totalling no more than two weeks per semester in at least two time blocks, allowing for the majority of time to be spent in community with online tutorials and other individualised supports. The Department of Rural Health will then support students to complete two additional electives chosen from a selection of subjects delivered through the School of Population and Global Health as part of the Master of Public Health that focus on further developing students understanding of how historical, social and cultural processes as well as processes of power impact upon health experiences and outcomes.",
        "Graduates of the graduate certificate are given advanced standing in the Master of Public Health (representing 50 credit points towards that degree).",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Aboriginal Health in Rural Communities",
        "Year & campus": "2024— Shepparton",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a bachelor degree, or",
            "seven years of documented, relevant (in a field related to Aboriginal health or Aboriginal community development) work experience; and",
            "demonstrated evidence of written and analytical skills appropriate for postgraduate study; or",
            "completion of the Specialist Certificate in Empowering Health in Aboriginal Communities",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applicants, the Selection Committee will consider:",
            "prior academic performance; or",
            "work experience in Aboriginal health or Aboriginal community settings; and",
            "demonstrated evidence of written and analytical skills appropriate for postgraduate study",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university'sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Notes.",
            "In accordance with the Selection and Admission Policy (MPF1295), Indigenous applicants with two years of documented work experience in a field related to Aboriginal health and/or Aboriginal community development will be considered for selection.",
            "Appropriate access to, and relationships within an Aboriginal community is needed to conduct a community-based project as part of this course. This will be discussed with potential students wishing to enrol in this course and assessed by course staff on a case-by-case basis.",
            "Graduates of this course may be granted up to 50 credit points of advanced standing in the Master of Public Health."
        ],
        "Inherent requirements (core participation requirements)": [
            "Student attendance at the intensive sessions for both compulsory subjects is required for 100% of the time unless written agreement from the course coordinator is attained. Failure to attend 100% of the intensive sessions will result in failure of the relevant subject.",
            "Each student will receive a participation mark for each intensive session for each compulsory subject that is assessed by the instructor at that time. An average score (weighted for the time interval) will provide a participation mark worth 10% of the assessment in the first core subject and 20% of the assessment in the second core subject.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Student Support and Engagement Policy, academic requirements for this subject are articulated in the Subject Overview, Learning Outcomes, Assessment and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support:http://services.unimelb.edu.au/disability",
            "As Aboriginal and Torres Strait Islander Australian students will be part of the student cohort, cultural issues will be accounted for where reasonably practical. In addition, travel to attend the course will also be considered.",
            "The University of Melbourne is committed to providing students with reasonable adjustments to assessment and participation under the Disability Standards for Education (2005), and the Assessment and Results Policy (MPF1326). Students are expected to meet the core participation requirements for their course. These can be viewed under Entry and Participation Requirements for the course outlines in the Handbook. Further details on how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Aboriginal Health in Rural Communities requires the successful completion of 50 credit points.",
                "Applicants must complete the course’s compulsory subjects in order (first subject, ‘Using Knowledge in Aboriginal health’ before commencing the second compulsory subject).",
                "In relation to the course’s two compulsory subjects, applicants are required to travel to the Department of Rural Health’s Shepparton campus for short intensive teaching. On-campus attendance for these short teaching intensives is compulsory. Students must attend 100% of the on-campus study days in order to pass the relevant subject. Alternative arrangements may be considered by the course coordinator under exceptional circumstances. In order to participate in the off-campus components of the course, students must have access to reliable internet connection/s. Further, applicants must be able to accommodate a minimum time commitment of 15 hours per week for each of these compulsory subjects.",
                "In relation to the additional two elective subjects undertaken through the School of Population Health, students must be able to accommodate the specific requirements of the subjects they select.",
                "The Graduate Certificate in Aboriginal Health in Rural Communities is comprised of four subjects - two compulsory 12.5 credit point subjects at AQF Level 8 taken part-time over two semesters (one subject per semester), and two additional 12.5 credit point elective subjects on offer through the Master of Public Health. These subjects can also be undertaken as a progression towards a Master in Public Health."
            ],
            "Core": {
                "overview": [
                    [
                        "RURA90008",
                        "RURA90009"
                    ]
                ]
            },
            "Electives": {
                "overview": [
                    [
                        "POPH90199",
                        "POPH90290",
                        "POPH90291",
                        "POPH90205",
                        "POPH90231",
                        "POPH90217",
                        "POPH90296",
                        "POPH90300",
                        "SOCI90018"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}