{
    "Course name": "Graduate Certificate in International Education (IB)",
    "Course code": "GC-INTEDIB",
    "Overview text": [
        "The Graduate Certificate in International Education (IB) is a fully online program. It offers a specialist degree for teachers and administrators in education for all stages of education. It is designed for those wanting to broaden their understanding and skills in relation to the philosophy and concepts underlying the International Baccalaureate (IB) Programmes and to assist those wanting to work internationally. The course investigates the IB from a range of theoretical perspectives with focused inquiry into policy and practice.",
        "Please note that this program will not provide graduates with initial teacher education qualifications to teach in Australia."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in International Education (IB)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. \nIn order to be considered for entry, applicants must have completed: \n",
            "a four-year education degree, or equivalent; or",
            "an undergraduate degree in any discipline and at least 50 credit points, or equivalent, of graduate study in education.",
            "Meeting these entry requirements does not guarantee selection.",
            "1. In ranking applications, the Selection Committee will consider:",
            "\nperformance\n",
            "1. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments",
            "1. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne Graduate School of Education welcomes applications from students with disabilities. It is University and Graduate School policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Graduate School’s programs.",
            "The core participation requirements for study in the Melbourne Graduate School of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching.",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "International Baccalaureate Organisation",
            "The course is accredited by the International Baccalaureate®"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in International Education (IB) is a 50 credit point degree normally taken over six months of full time study or one year of part time study. The degree requires completion of a specialisation consisting of 4 core subjects.",
                "The specialisations are:",
                [
                    "Primary Years Programme",
                    "Middle Years Programme",
                    "Diploma Programme"
                ],
                "Subject Options:",
                [
                    "EDUC90333",
                    "EDUC90261",
                    "EDUC90331",
                    "EDUC90260"
                ],
                [
                    "EDUC90333",
                    "EDUC90968",
                    "EDUC90331",
                    "EDUC90969"
                ],
                [
                    "EDUC90333",
                    "EDUC90332",
                    "EDUC90331",
                    "EDUC90330"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates from this program are eligible to apply for entry to the Master of International Education (International Baccalaureate) course subject to achievement of an H2A grade average."
    ]
}