{
    "Course name": "Graduate Diploma in Disaster and Terror Medicine",
    "Course code": "GD-DTM",
    "Overview text": [
        "The Graduate Diploma in Disaster and Terror Medicine is designed to equip clinicians, first responders, health service managers, relevant agency staff and policy makers with an overview of the principles of disaster management, the skills required to prepare their health service to respond and recover from disasters and terror events, leadership skills for crisis situations and more advanced management of complex disasters such as chemical or biological events.",
        "Studying Disaster and Terror Medicine at the University of Melbourne will develop your problem-solving skills and expertise in this specialist area, including logistics, prevention, planning, responses, recovery and policy development through a clinical and health care management framework. Disaster and Terror Medicine is a system orientated specialty that is inclusive of unique aspects of clinical care and health management and, relevant to a diverse group of responding agencies. Health practitioners and service managers are dealing with natural and man-made disaster and terror events with increasing frequency and our communities expect our leaders to be prepared to respond quickly, decisively and effectively.",
        "What you will learn",
        "Students will learn a structured approach to disaster and terror management in clinical and health service settings and learn to apply this skill in complex scenarios. Students will learn about the roles and accountabilities of responders and managers with particular focus on clinical leadership and managing complex disasters in their health service including chemical, biological, radiological, nuclear and explosive events. The course will also provide students with an ethical framework for effective decision making for complex disasters and strategies for managing media and activity with multiple agencies. Students will develop an understanding of the principles of toxicology as related to exposures commonly associated with terror and mass casualty events, and will explore the role of human factors in crises and tools to redesign safer care.",
        "Who is the course for?",
        "Our program is targeted towards clinicians, hospital administrators, staff from emergency services, government and the military. The course will equip participants with an understanding of domestic and international factors involved in the management of these events.",
        "Who will you learn from?",
        "The Department of Critical Care in the Melbourne Medical School is the hub for world-leading critical care research, learning and teaching and engagement across the 20+ University-affiliated hospitals and beyond, with close associations with the specialty Colleges, clinical trials networks and other key organisations such as Safer Care Victoria and Ambulance Victoria.",
        "",
        "Pathways",
        "Credit obtained in some of these subjects can be used towards completion of the Master of Advanced Nursing Practice, Master of Public Health and Graduate Certificate in Climate Change and Health.",
        "Last updated: 9 August 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Disaster and Terror Medicine",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.  In order to be considered for entry, applicants must have completed:",
            "a medical degree or, ",
            "an undergraduate degree in any discipline and at least three years of documented relevant work experience in a health management, paramedicine, nursing or equivalent role; and",
            "demonstrated evidence of written and analytical skills appropriate for postgraduate study as evidenced by a 500 word expression of interest detailing the applicant's motivations for undertaking the course.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "area of speciality practice and clinical experience",
            "3.  The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4.  Applicants are required to satisfy the University's English language requirements for graduate courses.  For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Diploma in Disaster and Terror Medicine is comprised of eight subjects (100 credit points). Students must complete all of:",
                "• Six compulsory subjects (75 points)",
                "• Two elective subjects (25 points)",
                "Full Time",
                "Year 1 (100 Credit Points)",
                "Compulsory subjects (75 credit points)",
                [
                    "MEDI90107",
                    "MEDI90108",
                    "MEDI90110",
                    "MEDI90111",
                    "PADM90024",
                    "MEDI90109"
                ],
                "Elective subjects (25 credit points)",
                "Part Time",
                "Year 1 (50 credit points)",
                "Compulsory subjects (50 credit points)",
                [
                    "MEDI90107",
                    "MEDI90108",
                    "PADM90024",
                    "MEDI90109"
                ],
                "Year 2 (50 credit points)",
                "Compulsory subjects (25 credit points)",
                [
                    "MEDI90110",
                    "MEDI90111"
                ],
                "Elective subjects (25 credit points) by selecting two of:",
                [
                    "POPH90217",
                    "POPH90206",
                    "POPH90058",
                    "POPH90209",
                    "POPH90230",
                    "PADM90014",
                    "POPH90301",
                    "DEVT90058"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of other graduate coursework programs."
    ]
}