{
    "Course name": "Graduate Diploma in Clinical Education",
    "Course code": "GD-CLINED",
    "Overview text": [
        "The Graduate Diploma in Clinical Education takes the Graduate Certificate of Clinical Teaching’s learner-centred approach and adds levels of flexibility and complexity intended to extend participants beyond their current level of competence. Deeper understanding of the principles of education and assessment is necessary for those who develop clinical examinations rather than just participate in them, and a focus on ensuring that participants are research-driven in their clinical education activities brings a level of opportunity to deepen their knowledge in areas that most apply to their current roles, or to broaden their skills and interests in order to take on new challenges. The Graduate Diploma in Clinical Education is designed as the next step for those who not only do the teaching but are involved in the planning and development of clinical education."
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Clinical Education",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• either– an entry-to-practice degree or equivalent in a health discipline, or– an undergraduate degree or equivalent in another area and at least three years of documented experience of clinical teaching;and• current involvement in the delivery of clinical teaching.Meeting this requirement does not guarantee selection.2. In ranking and/or assessing applications, the Selection Committee will consider:• prior academic qualification and performance; and• the professional experience.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Semester 1, Year 1EDUC90741 - Effective Clinical Teaching, Compulsory, 12.5 pointsEDUC90742 – Effective Clinical Supervision, Compulsory, 12.5 points",
                "Semester 2, Year 1EDUC90744 – Assessing Clinical Learners, Compulsory, 12.5 pointsEDUC90743 – Clinical Education in Practice, Compulsory, 12.5 points",
                "Semester 1, Year 2EDUC90803 - Pedagogy into Practice, Compulsory, 12.5pointsEDUC90804 - Clinical Assessment & Course Evaluation, Compulsory, 12.5 points",
                "Semester 2, Year 2EDUC90805 - Clinical Simulation, Compulsory, 6.5 pointsEDUC90802 - Research in Clinical Education, Compulsory, 6.5 pointsEDUC90801 - Clinical Education Modules, Compulsory, 12.5 points"
            ]
        },
        "Subject options": {
            "overview": [
                "Core subjects"
            ]
        },
        "Year 1 subjects": {
            "overview": [
                [
                    "EDUC90741",
                    "EDUC90742",
                    "EDUC90743",
                    "EDUC90744"
                ]
            ]
        },
        "Year 2 subjects": {
            "overview": [
                [
                    "EDUC90801",
                    "EDUC90802",
                    "EDUC90803",
                    "EDUC90804",
                    "EDUC90805"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}