{
    "Course name": "Graduate Certificate in Advanced Veterinary Practice",
    "Course code": "GC-AVETPR",
    "Overview text": [
        "This course is not currently offered.",
        "Veterinary General Practitioners are the main health care providers to a wide range of animals. They are expected to ensure quality of care is delivered to all their patients via strategies that include disease prevention advice as well as medical and surgical interventions. To achieve this, they require a broad understanding of many health areas that allows them to give holistic and balanced patient care.",
        "This practical and immersive Graduate Certificate is designed to broaden and increase the general practitioner’s depth of knowledge and understanding of the common problems encountered in small animal veterinary practice, thus making practice more efficient, enjoyable and effective.",
        "Last updated: 9 April 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Advanced Veterinary Practice",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a degree in Veterinary Science, or an equivalent qualification from a Veterinary School listed in the World Health Organisation Directory of Veterinary Schools; and",
            "a minimum of 2 years of professional experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the professional experience;",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic BoardRuleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band6.5is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": []
        },
        "Subject options": {
            "overview": [
                "All subjects are compulsory:",
                [
                    "VETS90111",
                    "VETS90112",
                    "VETS90113",
                    "VETS90114"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}