{
    "Course name": "Graduate Certificate in Health Informatics and Digital Health",
    "Course code": "GC-HINFDH",
    "Overview text": [
        "The increasing use of information and communication technologies in healthcare – including the rise of Digital Health, eHealth, Mobile Health and Telehealth – means that new Health Informatics knowledge and skills are needed in the health workforce around the world.*",
        "At the same time as technology is improving and even disrupting healthcare, there is a shortage of people working in the health sector who have advanced qualifications in Health Informatics. There is national and international recognition of the need for the health workforce to build capabilities to work in increasingly technologised environments.",
        "The Graduate Certificate in Health Informatics and Digital Health is designed for people working or planning to work in the health sector, who aspire to management and leadership roles in this rapidly expanding aspect of healthcare. The course offers the opportunity to earn a graduate qualification from the Melbourne School of Population and Global Health in this important discipline.",
        "The Graduate Certificate in Health Informatics and Digital Health will enable you to:",
        "In the Graduate Certificate in Health Informatics and Digital Health students work with teaching staff who are nationally and internationally recognised health informatics researchers and highly regarded digital health industry experts. The course offers engagement with senior specialists in healthcare IT from public and private sector organisations, and insights into leadership, innovation and research.",
        "The Graduate Certificate in Health Informatics and Digital Health is offered for full-time or part-time study. It may be completed part-time over 1 or 2 years, starting in semester 1 or 2 each year. Or it can be taken full-time during the second half of each year. All subjects are available for fully online study. Some subjects also offer campus-based classes; nevertheless it is possible to complete the required learning and assessment remotely - accessing instructions and resources, and participating in discussions and webinars, in the online learning management system. Class sizes between 20 and 60 encourage workshop / seminar modes of group interaction, whether you are online or on-campus.",
        "Students enrolled in the Graduate Certificate in Health Informatics and Digital Health become part of an interprofessional group of graduate students from different health workforce backgrounds, biosciences, information systems and information technology, and other fields. Within this group it is possible for students to pursue more clinical or more technical interests during their studies, depending on their backgrounds and career plans.",
        "The Graduate Certificate in Health Informatics and Digital Health can be a pathway to a Masters degree in Public Health (244CW), a Masters degree in Clinical Research (N01AA), or a Masters degree in Information Systems with a Professional specialisation (MC-IS).",
        "*In Australia as elsewhere ‘health informatics’ is the preferred term for the field of scientific knowledge, which has a long established history. Digital health, ehealth, mobile health and telehealth are commonly used to describe the application of this knowledge in the Internet age.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Health Informatics and Digital Health",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "In order to be considered for entry, applicants must have completed a health related degree, or equivalent; or an undergraduate degree in a cognate discipline or equivalent.Meeting this requirement does not guarantee selection.Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.The Selection Committee will evaluate the applicant’s ability to pursue successfully thecourse using the following criteria:",
            "academic performance in their most recent degree",
            "academic performance in any prior academic qualification",
            "workplace experience in the health sector",
            "The Selection Committee may conduct interviews and tests and may call for referee reports or employer references to elucidate any of the matters referred to above."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Four subjects may taken part-time over one or two years (one or two subjects per semester); or taken full-time over 4 to 6 months between July and December each year (choosing subjects offered during that period)."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core": {
            "overview": [
                [
                    "INFO90001"
                ],
                "Andoneof the following:",
                [
                    "POPH90013",
                    "MAST90130"
                ]
            ]
        },
        "Electives": {
            "overview": [
                "Students MUST complete the Group A elective and Chooseoneelective from Group B:"
            ],
            "Group A": {
                "overview": [
                    [
                        "ISYS90069"
                    ]
                ]
            },
            "Group B": {
                "overview": [
                    [
                        "ISYS90076",
                        "ISYS90078",
                        "POPH90263",
                        "ISYS90077",
                        "POPH90294"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}