{
    "Course name": "Graduate Diploma in Business Analytics",
    "Course code": "GD-BUSANA",
    "Overview text": [
        "The goal of this course is to equip its graduates with specialised data analytic techniques. It includes eight core subjects that cover foundation and advanced data analytics in various specialised disciplinary area, as well as frameworks for applying those techniques to its business contexts.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Business Analytics",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have:",
            "Completed an undergraduate degree of 3 or 4 years minimum in one of the relevant areas listed below, taken at a third year university level from a recognised institution, with a minimum weighted average mark (WAM) of 65% or equivalent.",
            "- Commerce",
            "- Mathematics and/or Physics",
            "- Computer Science or Information Systems",
            "- Engineering and/or Science",
            "Two years of professional working experiences",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Professional working experiences; and",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.0 is required. International students must demonstrate proficiency in English either through IELTS score (minimum score requirement of 7.0 overall with no individual score less than 7) or TOEFL IBT score (minimum of 94, and a written score minimum of 27 and no band less than 24).",
            "Note:GMAT scores may be required if a University of Melbourne credit average equivalence is difficult to obtain."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Core subjects:",
                [
                    "BUSA90536",
                    "BUSA90540"
                ],
                "Selective Core subjects Group 1:",
                "50 credit points from the following subjects:",
                [
                    "BUSA90539",
                    "BUSA90537",
                    "BUSA90538",
                    "BUSA90542",
                    "BUSA90541",
                    "BUSA90543"
                ],
                "Selective Core subjects Group 2:",
                "25 credit points from the following subjects:",
                [
                    "BUSA90546",
                    "BUSA90544",
                    "BUSA90545"
                ],
                "(Note: BUSA90545 Supply Chain Analytics's prerequisite subject is BUSA90538 Decision Making and Optimisation.)"
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}