{
    "Course name": "Graduate Certificate in Small Animal Emergency and Critical Care",
    "Course code": "GC-SAECC",
    "Overview text": [
        "Covering the fundamental pathophysiological and clinical aspects of emergency and critical care (ECC) of the dog and cat, this is an in-depth professional development program taught by international experts. It incorporates most of the theory required for preparation for the Australian and New Zealand College of Veterinary Science ECC membership examinations.",
        "The Graduate Certificate in Small Animal Emergency and Critical Care covers the techniques necessary to perform emergency and critical care procedures, and the essential knowledge for monitoring of these patients. This includes identifying and addressing life threatening conditions such as:",
        "The course contains didactic course work, use of realistic case studies and assessments that provide immediate feedback. By completing this course, you will gain understanding and confidence when dealing with ECC patients.",
        "",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Small Animal Emergency and Critical Care",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "In order to be considered for entry, applicants must have completed;",
            "1. \nAn entry-to-practice veterinary degree that is recognised by the University of Melbourne\n",
            "2. An entry-to-practice veterinary degree that is recognised by the University of Melbourne",
            "An entry-to-practice veterinary degree that is recognised by the University of Melbourne",
            "Meeting these requirements does not guarantee selection.",
            "In ranking applications, the Selection Committee will consider:",
            "Prior academic performance",
            "The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "The minimum English language requirements for this course areBand 6.5."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Graduate Certificate in Small Animal Emergency and Critical Care welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the degree.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Commonwealth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with the Student Equity and Disability Support Team:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Small Animal Emergency and Critical Care will comprise of four mandatory 12.5 credit point subjects:"
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "VETS90036",
                    "VETS90037",
                    "VETS90038",
                    "VETS90039"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "This course will provide the theory required for preparation of the ANZCVS ECC membership examinations. Passing of ANZCVS ECC membership examinations are a mandatory requirement before a veterinarian is able to sit specialty veterinary examinations within Australia and thus the course will be of assistance to those entering into a residency position in this area.",
        "This course will form a large part of the requirements that allows register as Advanced Practitioners with RCVS."
    ]
}