{
    "Course name": "Graduate Diploma in Built Environments (Advanced)",
    "Course code": "GDA-BLTENV",
    "Overview text": [
        "The Graduate Diploma in Built Environments (Advanced) is generic and allows students to create an individual course of study by selecting subjects, with the approval of the Course Coordinator, from across the disciplines of the Melbourne School of Design.",
        "The flexibility this course offers is of great benefit to students who:"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Built Environments (Advanced)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "080610M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in a relevant discipline, with a weighted average mark of at least H3 (65%), or equivalent.",
            "Meeting this requirement does not guarantee selection.2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theStudent Application and Selection Procedure.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 6.5is required.",
            "For information about how to applyclick here."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne School of Design is the graduate school of the Faculty of Architecture, Building and Planning. It offers professional entry programs in Architecture, Construction Management, Landscape Architecture, Property and Urban Planning. It offers specialist development programs in Property Valuation, Planning and Design and in Urban Design.",
            "The Melbourne School of Design welcomes applications from students with disabilities. It is the University and Faculty (Architecture, Building and Planning) policy to take reasonable steps to make reasonable adjustments so as to enable students’ participation in degrees offered by the Melbourne School of Design (MSD).",
            "A candidate for degrees offered in the MSD must have abilities and skills which include the following: observation; communication; motor; conceptual, integrative, and quantitative; andbehavioural and social. Adjustments can be provided to minimise the impact of a disability, however, particularly at Masters level, students need to be able to participate in programs in an independent manner and with regard to their safety and the safety of others.",
            "(i)Observation:Candidates must be able to read text, diagrams, maps, drawings and numerical data. Candidates should be able to observe details at a number of scales and to record useful observations of environmental contexts.",
            "(ii)Communication:Candidates should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. Candidates must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.",
            "(iii)Motor:Candidates should have sufficient motor function to elicit information from environmental contexts. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments. Candidates should have sufficient motor ability to prepare documentation of analytic texts, drawings and models of findings and for the preparation of proposals for environmental interventions via digital or other means. Candidates should have the ability to actively participate in appropriate site and/or design studio-based activities.",
            "(iv)Intellectual-Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, synthesis and, importantly, the ability to interpret results of such work. Problem resolution, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, given the disciplines pursued in the MSD, candidates should be able to comprehend three-dimensional relationships and to understand the spatial relationships in environmental structures of a wide range of scales – from smaller than the individual through individual buildings and urban spaces to large geographic areas. Further, graduate study entails learning to master one’s own abilities and skills and to deploy them strategically. This requires further developing skills in both reflective and reflexive thinking and being able to practice these skills.",
            "(v)Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "All students must complete:",
                "100 credit points of graduate-level subjects.",
                "Students must complete 100 points of study, of which 75 points must be fourth year level or above. Should undergraduate subjects be included they must be taken from the later years of the undergraduate course, and would normally be taken as background studies to specialisations within the course."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}