{
    "Course name": "Graduate Diploma in Marketing",
    "Course code": "GD-MKTG",
    "Overview text": [
        "The Graduate Diploma in Marketing aims to equip managers from any functional area or industry with an in-depth understanding of markets, marketing decision variables, and the market-oriented organisation.",
        "Last updated: 24 May 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Marketing",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "112.5 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree; and",
            "two years of full-time work experience;",
            "Or",
            "six years of documented full-time work experience; and",
            "a personal statement outlining why they wish to be considered for the course.",
            "Applicants are also required to nominate two referees.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the professional experience; and",
            "the personal statement; and",
            "the referee reports.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 [link] is required.",
            "Note.",
            "These programs are only available part-time. Student needs to complete Business Essentials as the first subject. ",
            "Students who discontinue from the Master of Marketing but have successfully completed the requirements of the Graduate Diploma in Marketing will be eligible to receive the Graduate Diploma in Marketing as an exit award."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The course comprises nine subjects, three of which are compulsory General Management subjects (two units plus two full subjects). Three are compulsory Marketing subjects and the remainder are Marketing elective subjects. The program must be completed within two years, that is, within eight consecutive terms."
            ]
        },
        "Compulsory Subjects": {
            "overview": [
                [
                    "BUSA90552",
                    "BUSA90480",
                    "BUSA90481",
                    "BUSA90243",
                    "BUSA90224",
                    "BUSA90042",
                    "BUSA90261"
                ]
            ]
        },
        "Elective Subjects": {
            "overview": [
                "The remaining three subjects must be chosen from a range of marketing electives and might include existing subjects such as:",
                [
                    "BUSA90248",
                    "BUSA90013",
                    "BUSA90527",
                    "BUSA90172",
                    "BUSA90273",
                    "BUSA90299"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}