{
    "Course name": "Graduate Diploma in Early Childhood Teaching",
    "Course code": "GD-ECTCH",
    "Overview text": [
        "The Graduate Diploma in Early Childhood Teaching focuses on learning and teaching for children aged birth to eight years and intends to provide a qualification for registration to teach in early childhood settings. This course is delivered completely online and has a specific focus on foregrounding Indigenous Worldviews and sustainability. The course may be completed in one year full time, two years part time, or in nine months of accelerated study. The course includes 60 days of placement in multiple settings."
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Early Childhood Teaching",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "9 months intensive or 12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "Either",
            "An undergraduate degree in any discipline;",
            "Or",
            "A diploma and a minimum of five years of documented, relevant work experience in a leadership position in an early childhood setting; and a professional portfolio; and an interview (shortlisted candidates);",
            "And (all applicants)",
            "A selection test* as determined by the Selection Committee.",
            "Meeting these requirements does not guarantee selection.",
            "2. In assessing applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "The results of the selection test*; and",
            "For applicants without an undergraduate degree: review of 5 years relevant work experience in a leadership position in an early childhood setting, the professional portfolio; and the interview (if relevant).",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAcademic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7+is required.",
            "Note.",
            "(a) All applicants must have a valid Working with Children Check prior to the commencement of the practicum subjects, and for the duration of the program.",
            "(b) Higher English standards than those normally required for admission to graduate study at the University of Melbourne may be needed for eligibility for Australian teacher registration on graduation. The Selection Committee may require applicants who have not recently completed a full undergraduate degree in Australia or New Zealand to demonstrate English language ability using one of the standard tests approved by the Academic Board at performance band 7+, even if their prior study of the English language, or their prior education and assessment in an English language university, would normally exempt them from standard testing.",
            "(c) *All applicants must complete the Teacher Capability Assessment Tool (TCAT) selection test and meet all TCAT benchmarks. Details of the selection test are available on the Faculty of Education’sTeacher Capability Assessment Tool (TCAT)website."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home",
            "The core participation requirements for study in the Faculty of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching.",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "In courses requiring students to undertake practicum placements",
            "4. The ability to undertake professional practice placements independently, including:",
            "a. the ability based on personal maturity to establish a professional relationship with students and interact with them appropriately;",
            "b. the ability to communicate to students the subject matter being taught with clarity and in a way that is age-sensitive;",
            "c. the ability to model literacy and numeracy skills independently for students and in all their interactions meet community expectations of the literacy and numeracy skills teachers should have;",
            "d. the ability to demonstrate skilfully and safely activities required in particular discipline areas being taught (e.g. physical education activities, science laboratory techniques);",
            "e. the ability to create, monitor and maintain a safe physical environment, a stable and supportive psychological environment, and a productive learning environment in their classroom;",
            "f. the ability to establish effective relationships with all members of the school community, including colleagues, students, and caregivers;",
            "g. the ability based on mental and physical health to exercise sound judgment and respond promptly to the demands of classroom situations, and the personal resilience to cope and maintain their wellbeing under stress."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Children's Education and Care Quality Authority (ACECQA)",
            "The Graduate Diploma in Early Childhood Teaching is externally accredited by the Australian Children's Education & Care Quality Authority (ACECQA). Graduates may apply for registration and work in Australian early childhood education and care settings with children aged birth to five years. Graduates are also eligible to apply for registration as an early childhood teacher with the Victorian Institute of Teaching (VIT)."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Diploma in Early Childhood Teaching requires completion of 100-credit points of study, which may be completed over:",
                [
                    "9 months of accelerated study; or",
                    "1 year of full time study; or",
                    "2 years of part time study."
                ],
                "Students must complete:",
                [
                    "7 compulsory subjects; and",
                    "60 days of professional practice, which is incorporated into the subject Professional Pedagogical Practices (P3)."
                ]
            ]
        },
        "Subject Options": {
            "overview": [
                "All students complete the following 7 compulsory subjects. Please find notes on enrolment for the Full Time, Part Time, and Accelerated options further below.",
                [
                    "EDUC91022",
                    "EDUC91023",
                    "EDUC91024",
                    "EDUC91025",
                    "EDUC91026",
                    "EDUC91027",
                    "EDUC91028"
                ],
                "Accelerated, full time and part time options",
                "FULL TIME (1 year)",
                "To complete the course over 1 year of full-time study, students:",
                [
                    "Commence in Term 1 or Term 4; and",
                    "Enrol in 2 subjects per Term."
                ],
                "PART TIME (2 years)",
                "To complete the course over 2 years of part time study, students:",
                [
                    "Commence in Term 1 or Term 4; and",
                    "Enrol in 1 subject per Term."
                ],
                "ACCELERATED (9 months)",
                "To complete the course over 9 months of accelerated study, students:",
                [
                    "Commence in Term 2; and",
                    "Enrol per the accelerated course plan below."
                ],
                "Term 2 (accelerated)",
                [
                    "EDUC91024",
                    "EDUC91025"
                ],
                "Term 3 (accelerated)",
                [
                    "Continue EDUC91024 Professional Pedagogical Practices (P3), and take:"
                ],
                [
                    "EDUC91022",
                    "EDUC91026"
                ],
                "Term 4 (accelerated)",
                [
                    "EDUC91023",
                    "EDUC91027",
                    "EDUC91028"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of graduate coursework programs."
    ]
}