{
    "Course name": "Graduate Certificate in Bushfire Planning and Management",
    "Course code": "GC-BFIREPM",
    "Overview text": [
        "The GC-BFIREPM Graduate Certificate in Bushfire Planning and Management provides specialized bushfire science, planning, design and management subjects. The course meets the urgent need to equip existing professionals with world's best practice skills in planning, design and managing for fire risk in semi-urban and rural environments. Students are provided with the opportunity to participate in case studies of best practice and to develop professional networks in the fire risk management arena.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Bushfire Planning and Management",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree in a cognate discipline with at least an H3 (65%) weighted average, or equivalent; or",
            "An undergraduate degree in any area including at least 25 points in one or more of Chemistry, Biology, Mathematics or Statistics, or equivalent, and with at least an H3 (65%) weighted average, or equivalent; or",
            "An undergraduate degree in any area and a Graduate Certificate in a relevant discipline with at least an H3 (65%) weighted average in the Certificate, or equivalent; or",
            "A two-year associate degree or diploma in a relevant discipline, or equivalent; and five years documented, relevant professional experience; and",
            "An appropriate level of performance on a test conducted by the Selection Committee to confirm generic skills necessary for successful study in the program or the completion of a relevant Melbourne MicroCert.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Professional experience; and",
            "The score on the test conducted by the Selection Committee.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Admission and Selection into Course Policy.",
            "4. Applicants are required to satisfy theEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note:",
            "The requirement for at least H3 (65%) weighted average in each case may be waived where the applicant can demonstrate significant professional development in a relevant area since graduation.",
            "The assessment test will be conducted in a single period of two-hour duration where students will be required to demonstrate the following abilities to gain entry to graduate study:",
            "Analyze and interpret scientific or technical data;",
            "Comprehend and use scientific literature; and",
            "Conceptualise a problem."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Science (Science) welcomes applications from students with disabilities. It is University and School policy to take reasonable steps to make reasonable adjustments so as to enable the student’s participation in the Faculty's programs. Science contributes to the New Generation degrees and offers a broad range of programs across undergraduate and post-graduate levels many of which adopt a multi-disciplinary approach. Students of the Faculty's courses must possess intellectual, ethical, and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the Faculty. Candidates must have abilities and skills in observation; motor in relevant areas; communication; in conceptual, integrative, and quantitative dimensions; and in behavioural and social dimensions. Adjustments can be provided to minimise the impact of a disability, however students need to be able to participate in the program in an independent manner and with regard to their safety and the safety of others. I. Observation: In some contexts, the student must be able to observe demonstrations and experiments in the basic and applied sciences. More broadly, observation requires reading text, diagrams, maps, drawings and numerical data. The candidate should be able to observe details at a number of scales and record useful observations in discipline dependant contexts. II. Communication: A candidate should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. A candidate must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing. III. Motor: Candidates should have sufficient motor function necessary for participation in the inherent discipline-related activities. The practical work, design work, field work, diagnostic procedures, laboratory tests, require varying motor movement abilities. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments. IV. Intellectual-Conceptual, Integrative and Quantitative Abilities: These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving, the critical skill demanded of professionals in land and environment industries, requires all of these intellectual abilities. In addition, the candidate should be able to comprehend three-dimensional relationships and to understand the spatial relationships of structures. V. Behavioural and Social Attributes: A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. Students who feel their disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Students completing the GC-BFIREPM (Bushfire Planning Stream) will be eligible to apply for accreditation under the Bushfire Planning and Design (BPAD) scheme administered by FPA Australia (Fire Protection Authority Australia)"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The GC-BFIREPM Graduate Certificate of Bushfire Planning and Management (50 points) consists of the core subjects Patterns and Processes of Landscape Fire (FRST90025) and Bushfire Planning and Management (FRST90017), plus two further 12.5 point subjects according to stream (Planning or Management)."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                [
                    "FRST90017",
                    "FRST90025"
                ],
                "There are two streams within this course. Students should select either the Bushfire Planning Stream or the Bushfire Management Stream."
            ]
        },
        "Bushfire Planning": {
            "overview": [
                "Students to complete the following subjects;",
                [
                    "EVSC90022",
                    "EVSC90023"
                ]
            ]
        },
        "Bushfire Management": {
            "overview": [
                "Students to complete two of the following;",
                [
                    "FRST90015",
                    "NRMT90007",
                    "ENST90043",
                    "ENST90045"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}