{
    "Course name": "Graduate Certificate in Education",
    "Course code": "GC-EDGEN",
    "Overview text": [
        "THIS COURSE IS NOT CURRENTLY AVAILABLE FOR ADMISSION.",
        "The Graduate Certificate in Education has been developed for qualified teachers who are wanting to deepen their teaching practice, and develop a wider range of support strategies for different student cohorts. This degree will meet the needs of practising teachers. It provides specialised knowledge and skills in educational theories, policies, and approaches at the graduate level.",
        "Please note that this course will not provide you with registration to teach in Australia.",
        "The Graduate Certificate in Education is also an early exit award option for the Master of Education, Master of TESOL, and Master of Modern Languages Education.",
        "",
        "Last updated: 10 February 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Education",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "075300A",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed",
            "either",
            "a four-year education degree, or equivalent; or",
            "an undergraduate degree in any discipline and at least 100 credit points, or equivalent, of graduate study in education.",
            "Meeting these requirements does not guarantee selection.",
            "2. In assessing applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university's English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student's participation in the Faculty's programs.The core participation requirements for study in the Faculty of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching;2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines;3. Behavioural and social attributes that enable a student to participate in a complex learning environment.",
            "Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "In courses requiring students to undertake practicum placements",
            "4. The ability to undertake professional practice placements independently, including:a. the ability based on personal maturity to establish a professional relationship with students and interact with them appropriately;b. the ability to communicate to students the subject matter being taught with clarity and in a way that is age-sensitive;c. the ability to model literacy and numeracy skills independently for students and in all their interactions meet community expectations of the literacy and numeracy skills teachers should have;d. the ability to demonstrate skilfully and safely activities required in particular discipline areas being taught (e.g. physical education activities, science laboratory techniques);e. the ability to create, monitor and maintain a safe physical environment, a stable and supportive psychological environment, and a productive learning environment in their classroom;f. the ability to establish effective relationships with all members of the school community, including colleagues, students, and caregivers;g. the ability based on mental and physical health to exercise sound judgment and respond promptly to the demands of classroom situations, and the personal resilience to cope and maintain their wellbeing under stress.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact Student Equity and Disability Supporthttp://services.unimelb.edu.au/student-equity"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "THIS COURSE IS NOT CURRENTLY AVAILABLE FOR ADMISSION.",
                "The Graduate Certificate in Education requires completion of 50 credit points of study over six months full time.",
                "Students must complete 4 x elective subjects from the prescribed list (50 credit points)."
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "EDUC90828",
                    "EDUC90862",
                    "EDUC90728",
                    "EDUC90941",
                    "EDUC90832",
                    "EDUC90942",
                    "EDUC90938",
                    "EDUC90628",
                    "EDUC90258",
                    "EDUC90830"
                ]
            ],
            "Exit Award": {
                "overview": [
                    "Information for students admitted to other Melbourne Graduate School of Education courses:",
                    [
                        "Students in the Master of Education, Master of TESOL, or Master of Modern Languages Education may exit their course early and apply to graduate with the Graduate Certificate in Education, after successful completion of 50 credit points of study. Students in those courses should refer to their course’s Handbook entry for subject options.",
                        "Alternatively, students who have successfully completed 50 credit points of graduate subjects in another Master’s degree or Graduate Diploma offered by the Melbourne Graduate School of Education may be eligible to exit early and apply to be awarded the Graduate Certificate in Education; with permission of the relevant course coordinator and the Master of Education course coordinator."
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates of this course may progress to the University of Melbourne Master of Education with a guaranteed pathway. They may also progress to a range of other education graduate coursework programs."
    ]
}