{
    "Course name": "Graduate Certificate in Translation",
    "Course code": "GC-TRANS",
    "Overview text": [
        "A Graduate Certificate in Translation will enable you to build your translation skills, whether for personal development or for professional work. In particular, you will become proficient in the use of new translation technologies.",
        "You will also be able to prepare for certification by the National Accreditation Authority for Translators and Interpreters (NAATI).",
        "Your translation skills will be an asset in many professions such as international relations, marketing, language teaching or health communication.",
        "Last updated: 20 June 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Translation",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "114388E",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree, or equivalent in terms of years of university study or professional translation practice.",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Relevance of previous studies with respect to language skills (a degree in a modern language), translation (studies on translation) or teaching (studies in education). ",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "The English Language Requirement must be satisfied and for particular language subjects, the applicant must be at native competency or near-native competency in that language.",
            "Please note: Credentials for language competence will be determined by the course coordinator/selection committee, and may include prior study, tests and interviews. Native speaker is broadly defined here as a person who has spoken the language from birth and has had the majority of their education in the medium of that language."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Translation requires the successful completion of 50 credit points."
            ],
            "Course requirements": {
                "overview": [
                    "50 credit points consisting of:",
                    [
                        "25 credit points of compulsory subjects",
                        "25 credit points of elective subjects"
                    ],
                    "Note: All subjects will be offered in Semester 2"
                ]
            },
            "Compulsory subjects": {
                "overview": [
                    [
                        "TRAN90023",
                        "TRAN90011"
                    ]
                ]
            },
            "Elective subjects": {
                "overview": [
                    [
                        "ARTS30002",
                        "TRAN90024",
                        "CHIN30005",
                        "FREN20004",
                        "FREN30006",
                        "INDO20016",
                        "INDO30019"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students with native or near native speaker competence in English and Chinese may apply for the Master of Translation and Interpreting."
    ]
}