{
    "Course name": "Graduate Certificate in Modern Languages Education",
    "Course code": "GC-MLED",
    "Overview text": [
        "The Graduate Certificate in Modern Languages Education is designed for designed for teachers* wishing to add Languages Other Than English (LOTE) as a specialist area to teach in schools. It focuses on the curriculum, pedagogy, and language as they apply to classroom instruction and the provision of Languages education within school systems.",
        "",
        "*Please note that current teacher registration with the Victorian Institute of Teaching (VIT) or eligibility for VIT registration is required to undertake this course. Non-registered teachers are encouraged to contact theVITdirectly to determine eligibility."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Modern Languages Education",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "095991C",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• a four-year education degree, or equivalent; or• an undergraduate degree in any discipline and at least 100 credit points, or equivalent, of graduate study in education.AND• a major in a language other than English, or provide a statement of equivalence.AND• be eligible for registration with the Victorian Institute of Teaching*",
            "Meeting these entry requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:• prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7is required.",
            "Notes:a) *Applicants who do not hold teacher registration with the Victorian Institute of Teaching (VIT) are advised to contact theVITto determine eligibility."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.",
            "The core participation requirements for study in the Faculty of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching;",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines;",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "In courses requiring students to undertake practicum placements",
            "1. The ability to undertake professional practice placements independently, including:a. the ability based on personal maturity to establish a professional relationship with students and interact with them appropriately;b. the ability to communicate to students the subject matter being taught with clarity and in a way that is age-sensitive;c. the ability to model literacy and numeracy skills independently for students and in all their interactions meet community expectations of the literacy and numeracy skills teachers should have;d. the ability to demonstrate skilfully and safely activities required in particular discipline areas being taught (e.g. physical education activities, science laboratory techniques);e. the ability to create, monitor and maintain a safe physical environment, a stable and supportive psychological environment, and a productive learning environment in their classroom;f. the ability to establish effective relationships with all members of the school community, including colleagues, students, and caregivers;g. the ability based on mental and physical health to exercise sound judgment and respond promptly to the demands of classroom situations, and the personal resilience to cope and maintain their wellbeing under stress.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact Student Equity and Disability Supporthttp://services.unimelb.edu.au/student-equity"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "There are four compulsory subjects."
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "EDUC90587",
                    "EDUC90048",
                    "EDUC90050",
                    "EDUC90631"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of other graduate coursework programs including the Master of Modern Languages Education."
    ]
}