{
    "Course name": "Graduate Diploma in Science (Advanced)",
    "Course code": "GDA-SCI",
    "Overview text": [
        "The Graduate Diploma in Science (Advanced) is a one-year program (12 months full-time or 24 months part-time) designed to extend students' knowledge and skills through either a supervised research project together with advanced coursework subjects, or alternatively, advanced coursework only option (100-point coursework option).",
        "Areas of study:"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Science (Advanced)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "023188D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree with a major in an appropriate discipline, or equivalent; and",
            " a weighted average mark of at least H3 (65%) in the best 25 points of appropriate discipline studies at level 2 or above.",
            "2. In ranking applications, the Selection Committee will consider prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "BioSciences:Appropriate discipline - Biological Sciences or equivalent.",
            "Earth Science:Appropriate disciplines –Atmospheric and Ocean Sciences, Chemistry, Engineering, Environmental Science, Geography, Geology, Mathematics or Physics.",
            "Mathematics and Statistics:Appropriate disciplines – Mathematics, Statistics, Mathematical Physics, Physics, Engineering, Computer Science or equivalent.",
            "Physics:Appropriate disciplines – Physics, Mathematical Physics, Chemical Physics or equivalent.",
            "Meeting these requirements does not guarantee selection."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Graduate Diploma in Science (Advanced) welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree.",
            "The Graduate Diploma in Science (Advanced) requires all students to enrol in subjects where they will require: (1) the ability to comprehend complex science and technology related information; (2) the ability to clearly and independently communicate a knowledge and application of science, and technology principles and practices during assessment tasks; (3) the ability to actively and safely contribute in clinical, laboratory, and fieldwork/excursion activities.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "There may be additional inherent academic requirements for some subjects, and these requirements are listed within the description of the requirements for each of these subjects.",
            "Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the relevant Subject Coordinator and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Diploma in Science (Advanced) course requires the completion of 100 points (100 points = one year of full-time study).",
                "Coursework and Research",
                "The 100 points is comprised of two components:",
                [
                    "a coursework component; and",
                    "a minor thesis research project component (normally 10 000 - 12 000 words)."
                ],
                "The weight of each component varies between departments.",
                "To be eligible for the award of the Graduate Diploma in Science (Advanced), students must successfully complete both the research and the coursework components of the course.",
                "Coursework Only",
                "The coursework-only option is comprised of 100 points of advanced coursework subjects.",
                "Students have the option to complete the Graduate Diploma in Science (Advanced) by coursework only in areas of study: BioSciences, Mathematics and Statistics, Physics.",
                "Students also have the option to use the Graduate Diploma in Science (Advanced) by coursework in BioSciences, Mathematics and Statistics or Physics as an early exit point from the relevant Master of Science stream– i.e. Master of Science in BioSciences, Mathematics and Statistics, or Physics – where appropriate and subject to the approval of the stream Coordinator."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who successfully complete the coursework and research Graduate Diploma in Science (Advanced) specialisations with an H2A (75%) average are eligible to apply for M.Phil - Science and PhD-Science candidature.",
        "Students who successfully complete the coursework (100%) Graduate Diploma in Science (Advanced) courses are not eligible to apply for M.Phil - Science and PhD-Science candidature."
    ]
}