{
    "Course name": "Graduate Diploma in Youth Mental Health",
    "Course code": "GD-YOUTHMH",
    "Overview text": [
        "The Graduate Diploma in Youth Mental Health has been developed by the University of Melbourne’s Centre for Youth Mental Health in collaboration with Orygen, a global leader in youth mental health research and knowledge translation, to strengthen the capacity of the youth mental health workforce both nationally and internationally. The course is designed for education and health-care professionals working in a range of clinical and community contexts, and draws on contributions by world-leading experts in the field to provide students with the latest theory, research and evidence-based approaches in this specialised area of mental health.",
        "The course is delivered wholly online and is offered as a nested program, allowing students to exit with a Graduate Certificate after 1 year of part-time study. Upon completing the Graduate Diploma, students can also choose to progress to the Master of Youth Mental Health."
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Youth Mental Health",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "either",
            "an undergraduate degree in a cognate discipline such as Health Sciences, Social Work, Psychology, Medicine, Teaching, Education, Nursing, Occupational Therapy, or related discipline; or",
            "an undergraduate degree or equivalent in any discipline, and at least two years of documented relevant professional work experience; or",
            "at least six years of documented relevant professional work experience, including clear evidence of career development, professional writing, and professional achievement or practice comparable to that expected of undergraduate degree holders in cognate disciplines.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and, if relevant",
            "professional experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband6.5 is required.",
            "Notes:",
            "In considering students under special entry access schemes, the Selection Committee will consider aspects of disadvantage as set out from time to time in the University of Melbourne Graduate Access policy, evidence of rurality for rural applicants, and confirmation of Aboriginality for Indigenous applicants.",
            "Applicants who have completed theGraduate Certificate in Managing Youth Self-Harm and Suicidemay be granted advanced standing for the following subjects of the Graduate Diploma in Youth Mental Health:",
            "PSYT90096",
            "PSYT90097",
            "Plus, one elective subject",
            "Applicants who have completed the Professional Certificate in Youth Psychiatry, offered by Orygen within four years prior to course commencement may be granted advanced standing for the following subjects of the Master of Youth Mental Health:",
            "PSYT90096",
            "PSYT90097",
            "Applicants who have completed the EPPIC National Support Program (ENSP), offered by Orygen within four years prior to course commencement may be granted advanced standing for the following subjects of the Master of Youth Mental Health:",
            "PSYT90096",
            "PSYT90097",
            "PSYT90102",
            "One elective in second or third year of the program",
            "You will need to provide proof of completion with your application.",
            "Quotas may be applied."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Overview, Objectives, Assessment and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support:http://services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Year 1: 50 credit points",
                "Semester 1:",
                [
                    "PSYT90096",
                    "PSYT90097"
                ],
                "Semester 2:",
                [
                    "PSYT90098",
                    "PSYT90099"
                ],
                "Year 2: 50 credit points",
                "Semester 1:",
                [
                    "PSYT90100",
                    "PSYT90101"
                ],
                "Semester 2:",
                [
                    "PSYT90102"
                ],
                "One of the following four elective subjects",
                [
                    "PSYT90103",
                    "PSYT90104",
                    "PSYT90110",
                    "PSYT90112"
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Compulsory subjects": {
            "overview": [
                [
                    "PSYT90096",
                    "PSYT90097",
                    "PSYT90098",
                    "PSYT90099",
                    "PSYT90100",
                    "PSYT90101",
                    "PSYT90102"
                ]
            ]
        },
        "Elective subjects": {
            "overview": [
                [
                    "PSYT90103",
                    "PSYT90104",
                    "PSYT90107",
                    "PSYT90110",
                    "PSYT90112"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to the Master of Youth Mental Health and a range of other graduate coursework programs.",
        "Applicants who complete the Graduate Diploma in Youth Mental Health will be awarded up to 100 points of credit towards the Master of Youth Mental Health.",
        "Applicants who have completed the Graduate Diploma within four years prior to course commencement, may be granted advanced standing for the following subjects of the Graduate Certificate in Managing Youth Self-Harm and Suicide:",
        "PSYT90096",
        "PSYT90097"
    ]
}