{
    "Course name": "Graduate Diploma in Clinical Psychology",
    "Course code": "GD-CLINPSY",
    "Overview text": [
        "This 'bridging course' will allow non-Clinical Psychology graduates training in the skills required to meet the core competencies outlined by the Psychology Board of Australia (PsyBA) as necessary for specialist endorsement as a Clinical Psychologist. The two-year, part-time program includes coursework subjects addressing psychological assessment and diagnosis, child psychopathology, biological psychology and pharmacology and advanced skills in clinical psychology along with practical placement experience. Upon completion, graduates will be eligible to undertake two years of supervised practice – enabling them to progress to specialist endorsement as a Clinical Psychologist. The University of Melbourne is seeking to have this program accredited by Australian Psychology Accreditation Council.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Clinical Psychology",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An accredited Master of Clinical Neuropsychology, or an accredited Master of Professional Psychology or an equivalent qualification, and",
            "A 500 word personal statement outlining why the applicant wishes to be considered for the course , and",
            "Two referee reports, and",
            "Documented relevant clinical work experience, and",
            "Demonstrated proof of registration as a psychologist with the Psychology Board of Australia and,",
            "Attend a selection interview (short-listed applicants only).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee may consider:",
            "Prior academic performance, including additional education or prizes; and",
            "Professional experience, including additional education or prizes; and",
            "Suitability for clinical training as determined by the interview, personal statement and referee reports.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the University’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Psychological Accreditation Council (APAC)",
            "The University of Melbourne will seek to have this program accredited by Australian Psychology Accreditation Council. Full accreditation is not possible until at least one cohort of students has successfully graduated."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Diploma in Professional Psychology (Clinical Psychology) requires the successful completion of 100 credit points. Successful completion of all nine subjects is required for successful completion of the course.",
                "All subjects are compulsory for successful completion of the course.",
                "Year 1 (37.5 credit points)",
                [
                    "PSYC90011",
                    "PSYC90030",
                    "PSYC90023",
                    "PSYC90009",
                    "PSYC90015",
                    "PSYC90016"
                ],
                "Year 2 (62.5 credit points)",
                [
                    "PSYC90017",
                    "PSYC90121",
                    "PSYC90122"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}