{
    "Course name": "Graduate Diploma in Music",
    "Course code": "GD-MUS",
    "Overview text": [
        "The Graduate Diploma in Music is designed for university graduates in any field who wish to undertake university-level study in music. The program draws together subjects from the Melbourne Conservatorium of Music's existing degree programs, and may be taken part-time or full-time.",
        "Specialisations are offered in Practical Music, Composition, Musicology and Ethnomusicology. A Tailored Program is also available.",
        "Last updated: 13 September 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Music",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "056297D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree with a weighted average mark of at least H3 (65%) or equivalent; or",
            "at least five years of documented professional experience relevant to the specialisation.",
            "2. Applicants for Practical Music, Musicology, Ethnomusicology and Composition specialisations must also successfully complete an audition, composition folio or piece of academic writing as appropriate for the specialisation that the applicant seeks to enter. Meeting these requirements does not guarantee selection.",
            "3. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and, as appropriate to the specialisation,",
            "the audition, composition folio or piece of academic writing",
            "4. The Selection Committee may seek further information to clarify any aspect of an application in accordance with Academic Board rules on the use of selection instruments.",
            "5. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "100-point program",
                "The Graduate Diploma in Music requires the successful completion of 100 credit points of Music subjects."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of other graduate coursework programs, as well as research higher degree programs including the Doctor of Philosophy."
    ]
}