{
    "Course name": "Graduate Certificate in Design for Health and Wellbeing",
    "Course code": "GC-DHW",
    "Overview text": [
        "The Graduate Certificate in Design for Health and Wellbeing introduces concepts including why space matters, spatial research methods and how users’ health and wellbeing are impacted by their environments. Design practice will enable learners to put theory into practice guided by evidence-based insights. Students will be equipped with the skills needed to brief and critically evaluate the spaces that we inhabit and impact our health and wellbeing; and interpret and critique visual communication techniques in various forms, including plans, sketch models, and 3D digital renderings. Students will be encouraged to develop strong written, oral and visual communication skills within the core subjects.",
        "This course is intended for both designers and non-designers. For many students, including design professionals, the specific approaches used in designing for health and wellbeing will be new and or possibly misunderstood. This course will introduce the principles and processes of user-experience (UX), design thinking and evidence-based design to enable students to correctly and creatively apply these concepts to design problems within their own contexts. The collaborative nature of this course, will allow students to work in interdisciplinary design teams of designers and non-designers, drawing on their diverse skills, knowledge and interests to enrichen the design process and enhance the end design product.",
        "Last updated: 29 August 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Design for Health and Wellbeing",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed either:",
            "an undergraduate degree, or equivalent: or",
            "a minimum of five years documented relevant work experience, including two referee reports.",
            "Meeting these requirements does not guarantee selection.",
            "2. In assessing applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the work experience as demonstrated by a CV: and",
            "referee reports",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the University's English language requirements for post graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, a performance band of6.5is required.",
            "Note:",
            "Relevant work experience includes human factors, design and built environment fields, health settings, local or state government roles, education, industry management roles."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students will complete 3 core subjects:",
                [
                    "ABPL90428",
                    "ABPL90426",
                    "ABPL90427"
                ],
                "Students will select one of the following electives:",
                "Online:",
                [
                    "ABPL90377"
                ],
                "On-campus:",
                [
                    "ABPL90321",
                    "HORT90011",
                    "POPH90299"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}