{
    "Course name": "Graduate Certificate in Mathematics Education (Years 7-10)",
    "Course code": "GC-MTHED10",
    "Overview text": [
        "THIS COURSE IS NOT CURRENTLY AVAILABLE FOR ADMISSIONS",
        "",
        "The Graduate Certificate in Mathematics Education (Years 7-10) is structured around four subjects which encompass the content strands in the Victorian Curriculum for Mathematics:",
        "The audience for this Graduate Certificate is qualified secondary teachers who would be called upon to teach mathematics across Grades 7-10 ‘out-of-field’, without having a background in mathematics pedagogy.",
        "Concepts and skills from the areas of Algebra and Number are used extensively across the mathematics curriculum, so these are offered as separate subjects, to acknowledge the importance of these content areas in their own right and also the critical role they play in supporting learning in Measurement, Geometry, Probability and Statistics.",
        "The mathematics proficiencies ofFluency,Understanding,ReasoningandProblem Solvingwill be addressed in each of the four subjects to highlight the interconnected nature of Mathematics and the need for students to develop these proficiencies across the curriculum.",
        "Participants will consider important pedagogical decisions in teaching Years 7-10 mathematics, including selection of good examples and explanations, representations and models for mathematical ideas, teacher questions, assessment, selection and use of resources and the role of digital technology and pen-and-paper in developing understanding. Participants will develop their capacity to plan effective lessons, design and interpret classroom assessment and plan a balanced curriculum.",
        "This course has been designed to satisfy the professional learning needs of mathematics out-of-field teachers in secondary schools.",
        "Last updated: 10 February 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Mathematics Education (Years 7-10)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "Either",
            "a four-year education degree, or equivalent;",
            "Or",
            "an undergraduate degree in any discipline and at least 100 credit points, or equivalent, of graduate study in education.",
            "Meeting these requirements does not guarantee selection.",
            "2. In assessing applications, the Selection Committee will consider:",
            "Prior academic performance;",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7+is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The inherent requirements for study in the Faculty of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching.",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Mathematics Education (Years 7-10) requires completion of 50-credit points of study over one year part time.",
                "Students must complete 4 compulsory subjects."
            ],
            "Compulsory Subjects": {
                "overview": [
                    [
                        "EDUC91033",
                        "EDUC91034",
                        "EDUC91035",
                        "EDUC91036"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of graduate coursework programs including the University of Melbourne Master of Education."
    ]
}