{
    "Course name": "Graduate Certificate in Entrepreneurship",
    "Course code": "GC-ENTR",
    "Overview text": [
        "The Graduate Certificate in Entrepreneurship is a graduate degree providing students with knowledge and skills to engage in entrepreneurial thought and action. It will provide the foundations for students to be an agent of change, either within a new venture or an established organization.",
        "The course will provide the latest knowledge on entrepreneurship and innovation. However, the course will also adopt a practical focus. Students will learn from benchmarked companies and visiting speakers with entrepreneurial backgrounds about the key dilemmas encountered in the entrepreneurial process and the solutions that they can put into practice. A significant part of the course is designed around hands-on experience in a simulated entrepreneurial environment, where ideas are generated and refined through collaboration and iteration amongst peers.",
        "This course is designed as a pathway to the Master of Entrepreneurship (100pts).",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Entrepreneurship",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "107113B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completedeither:",
            "An undergraduate degree or equivalent with a University of Melbourne equivalent weighted average mark of least 65% or equivalent, \n",
            "or",
            "At least five years of documented relevant professional work experience and a portfolio of work that demonstrates the applicant’s written and analytical skills, \n",
            "and",
            "A personal statement outlining why they wish to be considered for the course.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance and/or professional experience; and",
            "The personal statement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7.0is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students with reasonable adjustments to assessment and participation under the Disability Standards for Education (2005), and the Assessment and Results Policy (MPF1326). Students are expected to meet the core participation requirements for their course. These can be viewed under Entry and Participation Requirements for the course outlines in the Handbook. Further details on how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Entrepreneurship consists of 4 compulsory 12.5-point subjects (50 points) including an intensive winter subject. Subjects can be taken in any order.",
                [
                    "MGMT90201",
                    "MGMT90227",
                    "MGMT90030",
                    "BUSA90529"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}