{
    "Course name": "Graduate Certificate in Clinical Ultrasound",
    "Course code": "GC-CLINUS",
    "Overview text": [
        "This online program will be offered to practicing medical, surgical and other health-care professionals who wish to obtain further expertise in clinical ultrasound for clinical practice.",
        "The course is designed to provide the knowledge-base necessary for diagnostic-level performance and interpretation of a range of clinical ultrasound applications as well as a range of ultrasound guided procedures. The aim is to provide knowledge to facilitate use of ultrasound relevant to a large range of health-care providers.",
        "The Graduate Certificate in Clinical Ultrasound is part of a nested program of courses related to the use of clinical ultrasound. The program includes the Specialist Certificate in Clinical Ultrasound, which is the entry-level course. The  Graduate Certificate in Clinical Ultrasound provides the opportunity to advance skills in transthoracic echocardiography. The Graduate Diploma in Clinical Ultrasound provides more advanced skills in both transthoracic and transoesophageal echocardiography or other surface ultrasound uses. Students completing the Masters in Clinical Ultrasound will acquire expertise and confidence to perform and interpret complex medical ultrasound cases within their clinical practice."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Clinical Ultrasound",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a Doctor of Medicine or a Bachelor of Medicine/Bachelor of Surgery (MBBS) or equivalent, or\n",
            "an undergraduate degree or equivalent in allied health, nursing, physiotherapy, or science.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic qualification and performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "To satisfy the requirements of the Graduate Certificate in Clinical Ultrasound, students must successfully complete a total of 50 points, comprising:",
                [
                    "12.5 credit points of core subjects",
                    "37.5 credit points of elective subjects"
                ]
            ]
        },
        "Subject options": {
            "overview": [
                "To satisfy the requirements of the Graduate Certificate in Clinical Ultrasound, students must successfully complete a total of 50 points, comprising:",
                [
                    "12.5 credit points of core subjects",
                    "37.5 credit points of elective subjects"
                ]
            ]
        },
        "12.5 Credit Points of Core SubjectsOption 1": {
            "overview": [
                [
                    "MEDI90049"
                ]
            ]
        },
        "Option 2": {
            "overview": [
                [
                    "MEDI90112",
                    "MEDI90125"
                ]
            ]
        },
        "37.5 Credit Points of Elective Subjects": {
            "overview": [
                [
                    "MEDI90050",
                    "MEDI90051",
                    "MEDI90054",
                    "MEDI90100",
                    "MEDI90101",
                    "MEDI90102",
                    "MEDI90113",
                    "MEDI90114",
                    "MEDI90115",
                    "MEDI90116",
                    "MEDI90117",
                    "MEDI90118",
                    "MEDI90119",
                    "MEDI90120",
                    "MEDI90121",
                    "MEDI90122",
                    "MEDI90123",
                    "MEDI90124",
                    "MEDI90126",
                    "MEDI90127",
                    "MEDI90128"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students can articulate to the Graduate Diploma in Clinical Ultrasound and the Master of Clinical Ultrasound by undertaking the following subjects:",
        "Graduate Diploma of Clinical Ultrasound (100 points)",
        "Completion of the Graduate Certificate in Clinical Ultrasound (50 points) with the following:",
        [
            "MEDI90049 Principles of Ultrasound Heart Scan (12.5 points, CORE)",
            "AND any other elective subjects in the Graduate Certificate which total 37.5 points"
        ],
        "",
        "Master of Clinical Ultrasound (150 points)",
        "For students applying for credit, a total of50 pointsfrom the following:",
        "Completion of the Graduate Certificate in Clinical Ultrasound (50 points) with the following:",
        [
            "MEDI90049 Principles of Ultrasound Heart Scan (12.5 points, CORE)",
            "AND any other elective subjects in the Graduate Certificate which total 37.5 points"
        ],
        "",
        "For students applying for credit, a total of100 pointsfrom the following:",
        "Completion of the Graduate Diploma in Clinical Ultrasound (100 points)"
    ]
}