{
    "Course name": "Graduate Certificate in Green Infrastructure",
    "Course code": "GC-GRINFRA",
    "Overview text": [
        "This Graduate Certificate will provide students seeking vocational specific skills, or professionals seeking skills development or new knowledge, with a deep understanding of the realistic functional benefits that urban green infrastructure can provide to many of the challenges in urban society. The suite of core and elective intensive subjects rely heavily on real life, problem-based learning to develop an applied science approach throughout the Graduate Certificate. This will better position recent graduates in the workplace, and better resonate with industry professionals through a case-study approach to the designed learning outcomes. The recommended subjects all build from a theoretical basis to the practical knowledge required to successfully develop green infrastructure strategies or plans, as well as practically manage the technical aspects of green infrastructure projects as well as local community participation, education and engagement.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Green Infrastructure",
        "Year & campus": "2024— Burnley",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "(1) To be considered for entry the applicant must have completed:",
            "an undergraduate degree; and",
            "documented relevant work experience (equivalent to two years of employment in a green infrastructure field)",
            "Meeting these requirements does not guarantee selection.",
            "(2) In ranking applications, the Selection Committee will consider",
            "prior academic performance, and",
            "the work experience",
            "(3) The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "(4) Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Student Equityand Disability Liaison Unit website.http://services.unimelb.edu.au/student-equity"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Compulsory core (12.5 points):",
                [
                    "HORT90039"
                ],
                "Two or more electives (25 - 37.5 points) from:",
                [
                    "HORT90046",
                    "EVSC90025",
                    "SCIE90017"
                ],
                "Other optional electives from (12.5 points, if required):",
                [
                    "HORT90042",
                    "FRST90034",
                    "HORT90011",
                    "ABPL90315",
                    "ABPL90320"
                ],
                "HORT90039 must be one of the first two subjects completed."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}