{
    "Course name": "Graduate Diploma in Science",
    "Course code": "GD-SC",
    "Overview text": [
        "The Graduate Diploma is designed for students who have completed an undergraduate degree, who wish to refocus or extend their knowledge and skills by completing the requirement of one of the undergraduate majors (or equivalent) in the Bachelor of Science not already completed. The Graduate Diploma provides a pathway into the Master of Science Streams.",
        "The following areas of study are available:",
        "Last updated: 6 September 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Science",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "125 credit points",
        "Duration": "18 months full-time or 30 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree, or equivalent; and",
            "appropriate prerequisite studies for the stream into which entry is sought. For stream specific requirements please see below:",
            "Prerequisite requirements:",
            "Applied Mathematics: Subject prerequisites – both of MAST10006 Calculus 2 and MAST10007 Linear Algebra, or both of MAST10008 Accelerated Mathematics 1 and MAST10009 Accelerated Mathematics 2, or equivalents.",
            "Chemistry:Subject prerequisites – CHEM10004 Chemistry 2 or CHEM10006 for Biomedicine, or equivalents and a further 12.5 points of level 1 science.",
            "Discrete Mathematics / Operations Research:Subject prerequisites – both of MAST10006 Calculus 2 and MAST10007 Linear Algebra, or both of MAST10008 Accelerated Mathematics 1 and MAST10009 Accelerated Mathematics 2, or equivalents.",
            "Genetics:Subject prerequisites – at least 25 points of level 1 or above biological sciences subjects.",
            "Geology: Subject prerequisites – ERTH10002 Understanding Planet Earth, or EVSC100001 The Global Environment plus one other level 1 or above subject in Geology or Chemistry.",
            "Human Geography:Subject prerequisites – GEOG10001 Famine in the Modern World, Global Youth GEOG10003, or equivalents.",
            "Integrated Geography:Subject prerequisites – any one of EVSC10001 The Global Environment, ENVS10001 Natural Environments, UNIB10007 Introduction to Climate Change, or UNIB10003 An Ecological History of Humanity, or equivalents; plus any one of GEOG10001 Famine in the Modern World, Global Youth GEOG10003, or equivalents.",
            "Medicinal Chemistry:Subject prerequisites – CHEM10004 Chemistry 2 or CHEM10006 for Biomedicine, or equivalents and a further 12.5 points of level 1 biological science subjects.",
            "Plant Science:Subject prerequisites – at least 25 points of level 1 or above biological sciences subjects.",
            "Physical Geography:Subject prerequisites – any two of EVSC10001 The Global Environment, ENVS10001 Natural Environments, GEOG10001 Famine in the Modern World, UNIB10007 Introduction to Climate Change, or UNIB10003 An Ecological History of Humanity, or equivalents.",
            "Physics:Subject prerequisites – 25 points of level 1 Physics and 25 points of level 1 Mathematics which must include: MAST10006 Calculus 2 or MAST10009 Accelerated Mathematics 2 equivalent and MAST10007 Linear Algebra or equivalents and one of: PHYC20012 Quantum and Thermal Physics, PHYC20013 Laboratory and Computational Physics 2, PHYC20015 Special Relativity and Electromagnetism, MAST20009 Vector Calculus, MAST20026 Real Analysis, MAST20030 Differential Equations, PHYC20014 Theoretical Physics 2 or equivalents,ifMAST10009 Accelerated Mathematics 2 hasn’t been completed.",
            "Pure Mathematics:Subject prerequisites – both of MAST10006 Calculus 2 and MAST10007 Linear Algebra, or both of MAST10008 Accelerated Mathematics 1 and MAST10009 Accelerated Mathematics 2, or equivalents.",
            "Statistics / Stochastic Processes:Subject prerequisites – both of MAST10006 Calculus 2 and MAST10007 Linear Algebra, or both of MAST10008 Accelerated Mathematics 1 and MAST10009 Accelerated Mathematics 2, or equivalents.",
            "Zoology:Subject prerequisites – at least 25 points of level 1 or above biological sciences subjects",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Graduate Diploma in Science welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree.",
            "The Graduate Diploma in Science requires all students to enrol in subjects where they will require:",
            "1. the ability to comprehend complex science, technology and/or engineering systems related information;",
            "2. the ability to clearly and independently communicate a knowledge and application of science, technology and engineering systems principles and practices during assessment tasks; and in some areas of study",
            "3. the ability to actively and safely contribute in clinical, laboratory, and fieldwork/excursion activities.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. There are additional inherent academic requirements for some major studies and subjects, and these requirements are listed within the description of the requirements for each of these majors and subjects. Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the relevant Subject Coordinator and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/",
            "Discipline-specific Core Participation Requirements",
            "ChemistryCore Participation requirements: Laboratory experiments This discipline requires students to actively, independently and safely participate in all practical classes, utilising a range of observational, communication, motor, intellectual, and behavioural and social skills. Visual acuity, muscle coordination and balance are essential for participation. Assessment is reliant on careful observation and visual interpretation of results.",
            "GeologyCore Participation requirements: Fieldwork The sites essential to this fieldwork are not wheelchair accessible and require students to traverse broken ground. Visual observation and interpretation of the sites is also an essential component, as is specimen and microscope work.",
            "Plant ScienceCore Participation requirements: Fieldwork, practicals and laboratory experiments This discipline requires all students to actively, independently and safely participate in all practical classes, utilising a range of observational, communication, motor, intellectual, and behavioural and social skills. Visual acuity, muscle coordination and balance are essential for participation. Details of the participation requirements can be found athttp://www.vet.unimelb.edu.au/docs/CoreParticipationReqsBSc.pdfThe sites essential to this fieldwork are not wheel chair accessible and may require students to traverse broken ground. Students are also required to undertake experiments including specimen and microscope work with assessment reliant on careful observation and visual interpretation of results. Practicals may also involve handling and working with animals.",
            "ZoologyCore Participation requirements: Fieldwork, practicals and laboratory experiments This major requires all students to actively, independently and safely participate in all practical classes, utilising a range of observational, communication, motor, intellectual, and behavioural and social skills. Visual acuity, muscle coordination and balance are essential for participation. Details of the participation requirements can be found athttp://www.vet.unimelb.edu.au/docs/CoreParticipationReqsBSc.pdfThe sites essential to this fieldwork are not wheel chair accessible and may require students to traverse broken ground. Students are also required to undertake experiments including specimen and microscope work with assessment reliant on careful observation and visual interpretation of results. Practicals may also involve handling and working with animals."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Completion of 125 points:",
                [
                    "50 points of study at Level 2 or above.",
                    "50 points of study at level 3",
                    "25 points of study a level 9"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students will be allowed to apply for entry into the associated Master of Science program after completing the undergraduate component (100 points) of the Graduate Diploma. Students who then enter the Master of Science will be able to have two level 9 subjects cross-credited from their Master of Science back to their Graduate Diploma in Science in order to complete the Diploma."
    ]
}