{
    "Course name": "Graduate Diploma in Arts and Cultural Management (Advanced)",
    "Course code": "GDA-ACM",
    "Overview text": [
        "The Graduate Diploma in Arts and Cultural Management (Advanced) aims to prepare graduates to work in a diversity of arts industry environments, ranging from large organisations and government departments to self-employment in the arts, by developing in postgraduate students an understanding and appreciation of the arts, and the range of skills necessary to manage cultural resources, both human and material."
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Arts and Cultural Management (Advanced)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "075125M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "Graduate Diploma in Arts and Cultural Management (Advanced)",
            "(100 credit points)",
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in a cognate discipline with a weighted average mark of at least H2B (70%) in appropriate subjects or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "relevance of previous studies.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.0 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Duration:1 year full-time / 2 years part-time",
                [
                    "Five compulsory subjects (62.5 points)",
                    "Elective subjects (37.5 points)."
                ],
                "Total 100 points",
                "For policies that govern this degree, seeAcademic Services Policyin theUniversity Melbourne Policy Framework."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Compulsory Subjects": {
            "overview": [
                "62.5 points",
                [
                    "AMGT90001",
                    "AMGT90004",
                    "AMGT90006",
                    "AMGT90013",
                    "PUBL90014"
                ]
            ]
        },
        "Elective Subjects": {
            "overview": [
                "37.5 points",
                [
                    "ACUR90005",
                    "ACUR90008",
                    "AHIS40013",
                    "AHIS40016",
                    "AHIS40022",
                    "AMGT90032",
                    "AMGT90007",
                    "AMGT90012",
                    "AMGT90017",
                    "AMGT90024",
                    "AHIS90005",
                    "AHIS90007",
                    "CWRI40017",
                    "ENGL40020",
                    "MECM90007",
                    "MECM90037",
                    "MULT90059",
                    "SCRN90006",
                    "SCRN90002"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}