{
    "Course name": "Graduate Diploma in Genomics and Health",
    "Course code": "GD-GENOHLT",
    "Overview text": [
        "The Graduate Diploma in Genomics and Health is a nested award within the Master of Genomics and Health course.",
        "The Graduate Diploma in Genomics and Health will take a blended learning approach to delivery, combining online and face-to-face interactions. It requires completion of a total of 100 points of study and is structured to suit individual needs and study preferences. Students also have the option of enrolling in the Master of Genomics and Health course (200 points) and exiting with the Graduate Diploma (100 points), enrolling in the Graduate Diploma and exiting with the Graduate Certificate (50 points), or enrolling in the Graduate Certificate and subsequently articulating to the Graduate Diploma or Master.",
        "The rapid advances in genomics in the last decade are expected to bring about benefits in health care but are not without their challenges in terms of upskilling a workforce that is able to incorporate new ways of thinking about and applying genomics, as well as consideration of ethical and social issues.",
        "This Graduate Diploma in Genomics and Health course is the first course of its kind in Australia and students will engage in discourse around the current and potential impact on health and medicine brought about by these advances in genomics and genomic technologies.",
        "This course is designed to be available to students at different stages in their careers, including career starters and those who currently work and wish to further their knowledge, skills and qualifications. The coursework includes 75 points of compulsory subjects and allows some individual tailoring by offering students the choice of 2 elective subjects (25 points).",
        "Students who wish to transfer at any stage into the Master of Genetic Counselling must meet the course eligibility rules and successfully complete all of the compulsory subjects required for that stage of the Master of Genetic Counselling. This will only occur after approval from the Master of Genetic Counselling Curriculum Committee.",
        "Last updated: 24 July 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Genomics and Health",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "096348M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must provide evidence of having completed:",
            "a) an undergraduate degree, in a cognate discipline such as Science, Health Sciences, Social Work, Psychology, Medicine, or related discipline, with a weighted average mark of at least H3 (65%) or equivalentandpre-requisite studies with subject marks of at least 65% (H3) in: biology to first year undergraduate level, or equivalent and genetics to second year undergraduate level or equivalentORb) six years of documented relevant work experience in a cognate disciplineandpre-requisite studies with subject marks of at least 65% (H3)  in biology to first year undergraduate level, or equivalent and genetics to second year undergraduate level, or equivalentORc) an undergraduate degree in any discipline, or equivalent, with a weighted average mark of at least H3 (65%), or equivalent,andpre-requisite studies with subject marks of at least 65% (H3) in: biology to first year undergraduate level, or equivalent and genetics to second year undergraduate level or equivalentandat least two years of documented relevant work experience in a cognate discipline",
            "AND",
            "All applicants must include a statement of no more than 400 words that explains",
            "Reason(s) for applying for the Master of Genomics and Health including known or proposed career objectives",
            "How their education/background addresses the entry requirements",
            "Applicants must attach relevant biology and genetics subject descriptions to this statement (not included in the word count).",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "relevant work experience; and",
            "the personal statement",
            "3. Short listed applicants will be contacted for interview. The Selection Committee may conduct tests and may call for referee reports or employer references to elucidate any of the matters referred to above. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required.",
            "Notes",
            "Students may choose to exit the course with a Graduate Certificate in Genomics and Health following successful completion of the first 50 credit points."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Student and Disability Liaison Unit website.http://services.unimelb.edu.au/student-equity"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Diploma in Genomics and Health consists of 75 points of compulsory subjects and 25 points of elective subjects.",
                "GENE90001 - Human Genetics and Genomics in Healthcare, with a result of at least H2A (75%), is a pre-requisite for GENE90002 - Clinical Genomics for students enrolled in the Grad Dip in Genomics and Health.WELF90004 - Principles of Counselling 1 is a pre-requisite for WELF90005 - Principles of Counselling 2.",
                "Compulsory subjects:",
                [
                    "GENE90001",
                    "POPH90226",
                    "WELF90004",
                    "HLTH90014",
                    "GENE90002",
                    "WELF90005",
                    "GENE90025",
                    "GENE90026"
                ],
                "Elective Subjects (Semester 2):",
                [
                    "HLTH90001",
                    "HLTH90006",
                    "POPH90093",
                    "POPH90209",
                    "POPH90231",
                    "POPH90245",
                    "SCIE90012",
                    "SCIE90006"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}