{
    "Course name": "Graduate Certificate in Critical Care Nursing (Emergency)",
    "Course code": "GC-CCNEM",
    "Overview text": [
        "The Graduate Certificate in Critical Care Nursing (Emergency) is a 50 credit-point, part-time, clinical coursework program of one year's duration. Students typically undertake four 12.5 credit point subjects across the year.",
        "The course provides students with a sound understanding of the theoretical knowledge and scientific advances that underpin care management of patients requiring specialist emergency care.",
        "Students will gain essential knowledge and the clinical skills required to understand core concepts relating to acute illnesses, diseases and trauma in critical care services, as well as gain skills in critiquing evidence-based guidelines for the care management of patients and their families in this specialist areas.",
        "The Graduate Certificate in Critical Care Nursing (Emergency) is a blended delivery model of online and work integrated learning delivered by emergency nursing clinical experts and educators. During the course students will apply emergency nursing knowledge in clinical practice demonstrating their ability to competently care for patients with complex care requirements using evidence-based and scientific approaches.",
        "On successful completion of this course, students may be eligible for entry to the Master of Advanced Nursing Practice.",
        "Last updated: 26 July 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Critical Care Nursing (Emergency)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• A Bachelor of Nursing, Master of Nursing Science or equivalent entry-to practice nursing qualification;• Documented evidence of clinical practice within the preceding five years of applying for the course;• Current unrestricted registration  as a Division 1 Registered Nurse with AHPRA or equivalent registration with an international health practitioner regulation agency; and• Clinical support from a partnering health service and be employed a minimum of three (3) days or 24 hours per week for the standard course duration in a clinical setting that will provide the relevant clinical experience to meet course learning outcomes",
            "Meeting these requirements does not guarantee entry.",
            "2. In ranking applications, the Selection Committee will consider:• Prior academic performance; and• Area of specialty practice and clinical experience.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university's English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry. The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Four or Five compulsory subjects - depending on intake and duration",
                "Students will commence the course with a pre-requisite subject:",
                [
                    "NURS90076"
                ],
                "On successful completion of Applied Pathophysiology, students undertake:",
                [
                    "NURS90122"
                ],
                "Students then complete the following subjects",
                [
                    "NURS90148",
                    "NURS90149"
                ],
                "Students undertakingWinter Intake (12-month duration)will enrol in the below two subjects in place of NURS90148:",
                [
                    "NURS90159",
                    "NURS90160"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students may progress to the Masters of Advanced Nursing Practice."
    ]
}