{
    "Course name": "Graduate Diploma in Physiotherapy (Paediatrics)",
    "Course code": "GD-PHTYPAE",
    "Overview text": [
        "The Graduate Diploma in Physiotherapy (Paediatrics) is designed to produce graduates with advanced knowledge and skills for professional practice in Paediatrics. It is targeted toward early and mid-career physiotherapists who wish to further their careers within this clinical interest stream of physiotherapy practice. The curriculum is designed for practicing clinicians, is internationally relevant, and can be studied part or full time. Students studying the Graduate Diploma in Physiotherapy (Paediatrics) have the opportunity to progress to the 150 credit point Masters of Physiotherapy (Paediatrics).",
        "The course is a blended program that combines two intensive face-to-face subjects and six fully online subjects. Graduate attributes are aligned with those of The Melbourne Graduate; and further distinguished by established discipline-specific professional competency and standards frameworks in the domain of clinical paediatric physiotherapy. The curriculum is designed around three elements which will be covered explicitly within learning outcomes in each subject throughout the program: 1) Paediatric Physiotherapy Theory and Practice, 2) Evidence and Innovation and 3) Paediatric Physiotherapy Clinical Practice in Context.",
        "In this course, linking theory, research evidence and practice is emphasised, utilising scientific evidence to underpin paediatric physiotherapy clinical practice and decision making. The core subjects explore paediatric professional and clinical content in diverse contexts, as well as principles of evidence-based practice and research methodology, including research ethics. These subjects all require analysis, synthesis and creative problem solving within a range of practice contexts. Subjects extend knowledge and understanding, and introduce research principles and new innovations that are necessary to undertake clinical practice in different environments.",
        "Last updated: 6 July 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Physiotherapy (Paediatrics)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must:• Have completed an undergraduate degree or equivalent; and• Be qualified as a physiotherapist and registered to practice as a physiotherapist; and• Have at least 2 years of relevant post-entry to practice professional experience in the area of paediatric physiotherapy.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:• Prior academic performance; and• Professional work experience",
            "3. The Selection Committee may seek further information to clarify any aspect of anapplication in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements forgraduate courses. For those applicants seeking to meet these requirements by one of thestandard tests approved by the Academic Board, performance band 7 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Diploma in Physiotherapy (Paediatrics) requires the successful completion of 100 credit points."
            ]
        },
        "Subject options": {
            "overview": [
                "100-point program:• Four compulsory subjects (50 credit points)• Four elective subjects (50 credit points)"
            ],
            "Compulsory subjects (50 credit points)": {
                "overview": [
                    [
                        "PHTY90013",
                        "PHTY90030",
                        "REHB90005",
                        "REHB90010"
                    ]
                ]
            },
            "Elective subjects (50 credit points) by selecting four of:": {
                "overview": [
                    [
                        "HLTH90001",
                        "REHB90001",
                        "REHB90002",
                        "REHB90006",
                        "REHB90009",
                        "MEDI90092",
                        "RADI90024",
                        "REHB90004",
                        "REHB90007",
                        "HLTH90018"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}