{
    "Course name": "Graduate Certificate in Indigenous Business Leadership",
    "Course code": "GC-IBL",
    "Overview text": [
        "The Graduate Certificate in Indigenous Business Leadership is designed to graduate Indigenous business sector practitioners with a considered understanding of their own leadership and business practices. The subjects in this course adopt an interdisciplinary, international, and evidence-based approach to respond to the complex and growing challenges faced by Indigenous business leaders working in a range of fields/industries.",
        "Subjects are taught by leading academics in the fields of Indigenous philosophy of business, Indigenous business ecosystems, Indigenous business leadership, analytics, accounting, economics, research, finance, and marketing. Students will be provided with opportunities to work together to address the increasing challenges and opportunities in the Indigenous business sector with a key focus on the practice of Indigenous leadership.",
        "The course requires completion of 50 credit points of study focusing on Indigenous business leadership. This is an on-line program providing flexibility to design study times around other work and family commitments and study preferences.",
        "This course is designed to be available to Indigenous business owners, professionals and managers at different stages in their careers, including recent graduates, established practitioners and those seeking to move in new directions.",
        "Last updated: 27 February 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Indigenous Business Leadership",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree, or equivalent; and/or",
            "a minimum of five years documented, relevant work experience; and",
            "be an Indigenous person who identifies and is recognised as an Indigenous person.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and/or",
            "relevant work experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Indigenous Business Leadership is comprised of four subjects. Students will complete three 12.5 credit point online core subjects and one 12.5 credit point online elective subject.",
                "Subjects have no prerequisites or corequisites and can be taken in any order. However, the core subjects are only offered once a year in specified terms; Indigenous Philosophy of Business, Term 2 (April), Indigenous Business Ecosystems, Term 3 (July) and Indigenous Business Leadership, Term 4 (October).",
                "If students have graduated the MURRA Indigenous Business Master Class program or the Meereeng50 program (2020-2021) they are eligible for 12.5 credit points. Students who haven’t already completed the MURRA program can opt to complete it as an alternate elective if selected to participate in the program. The MURRA program is offered in semester one and two each year.",
                "Students who complete the Graduate Certificate in Indigenous Business Leadership with a 70% average may be eligible to apply to the Master of Management suite of programs, the Master of International Business, the Master of Professional Management or the Master of Entrepreneurship."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Compulsory subjects": {
            "overview": [
                "37.5 credit points",
                [
                    "MGMT90288",
                    "MGMT90287",
                    "MGMT90254"
                ]
            ]
        },
        "Elective subjects": {
            "overview": [
                "12.5 credit points selected from this list:",
                [
                    "ACCT90040",
                    "MGMT90239",
                    "ECON90077",
                    "ECON90076",
                    "FNCE90075",
                    "MKTG90038"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}