{
    "Course name": "Graduate Certificate in Dental Therapy (Advanced Clinical Practice)",
    "Course code": "GC-DTACP",
    "Overview text": [
        "Dental Therapists and Oral Health Therapists are registered dental practitioners who provide a range of diagnostic, preventive. maintenance and restorative dental services as part of a dental team. Both Dental Therapists and Oral Health Therapists provide dental therapy services. Dental therapy practice has traditionally been limited to people of under 26 years of age. Legislation governing the practice of dental therapy has removed that age limit enabling dental therapy practice with people of all ages. There is significant demand for the provision of dental therapy services for adults, particularly in the public sector.",
        "The Dental Board of Australia (responsible for registration of dental practitioners in Australia) has determined that completion of a university-based educational program would qualify practising dental therapists and oral health therapists to expand service provision to patients of all ages within the scope of dental therapy practice.",
        "This course is accredited by the Dental Council of New Zealand to enable all age practice for Dental Therapists and Oral Health Therapists.",
        "The Graduate Certificate in Dental Therapy (Advanced Clinical Practice) offers an entry limited to Australian and New Zealand registered, currently practicing dental and oral health therapists.",
        ""
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Dental Therapy (Advanced Clinical Practice)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have:• current registration with the Dental Board of Australia as a dental therapist or oral health therapist; and• two years of practice experience.Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:• prior academic performance, across all undergraduate or postgraduate study.• the work experience, with preference given to applicants with evidence of recentrestorativepractice.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required.",
            "Note - The Graduate Certificate in Dental Therapy has a quota and offers are sent out on a rolling basis. The quota may be reached before the application closing date, and applicants are encouraged to apply early to ensure they can be considered for the course."
        ],
        "Inherent requirements (core participation requirements)": [
            "A candidate for the Melbourne GRADUATE CERTIFICATE IN DENTAL THERAPY (ADVANCED CLINICAL PRACTICE) must have abilities and skills in the following five categories:",
            "The student must be able to observe mandatory demonstrations and experiments in the designated subjects.",
            "The student must be able to observe a patient accurately at a distance and close at hand. Observation necessitates the functional use of the senses of vision, hearing and somatic sensation. It is enhanced by the functional use of the sense of smell.",
            "The student must be able to hear and comprehend instructions in laboratories and practical sessions and be able to clearly and independently communicate knowledge and application of the principles and practices of the subject during assessment tasks.",
            "A student must be able to hear, to speak, and to observe patients in order to elicit information, describe changes in mood, activity, and posture and perceive nonverbal communications. A student must be able to communicate effectively and sensitively with patients in both oral and written modalities. The student must also be able to communicate effectively and efficiently in both oral and written modes with all members of the health care team, including using telephones and computers.",
            "A student must be able to undertake the motor requirements for any mandatory practical sessions. Such actions require coordination of both gross and fine muscular movements, equilibrium, and functional use of the senses of touch and vision.",
            "Students should have good motor function to elicit information from patients by physical examination; for example, palpation, percussion, and other diagnostic manoeuvres. Students should possess sufficient manual dexterity to be able to perform procedures required as a dental practitioner. The student should be able to execute motor movements reasonably required to provide general dental care and emergency treatment to patients. Such actions require coordination of both gross and fine muscular movements, equilibrium, hand eye coordination and functional use of the senses of touch and vision.",
            "The student is expected to have the ability to develop problem-solving skills and demonstrate this ability in practical sessions. These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving requires all of these intellectual abilities.",
            "The student is expected to have the ability to develop problem-solving skills and demonstrate the ability to establish oral health care plans and priorities. These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving requires all of these intellectual abilities.",
            "A student must possess the emotional health required for full utilization of his/her intellectual abilities, the exercise of good judgement, the prompt completion of all required tasks, and display professional behaviour at all times.",
            "A student must possess the emotional health required for full utilization of his/her intellectual abilities, the exercise of good judgement, the prompt completion of all responsibilities attendant to the diagnosis and care of patients. A student must display professional behaviour at all times and develop mature, sensitive, and effective relationships with patients and colleagues.",
            "It is a requirement of the course that students will be expected to physically examine their peers (of all genders) and be examined in return in teaching settings and patients (of all genders) in clinics.",
            "The University is dedicated to providing support to those with special requirements. Further details can be found at theStudent Equity and Disability Support website.",
            "The Melbourne Dental School policy outlining requirements in relation to student disability for entry to and progression within the program are outlined below.",
            "The curriculum of the GRADUATE CERTIFICATE IN DENTAL THERAPY (ADVANCED CLINICAL PRACTICE) has been developed using graduate attribute statements in six domains (professionalism, scientific knowledge, patient care, dental profession, systems of health care and the society). Students entering the Melbourne GRADUATE CERTIFICATE IN DENTAL THERAPY (ADVANCED CLINICAL PRACTICE) must therefore have the aptitude to achieve these attributes during the course in readiness for progression to independent practice.",
            "The Melbourne Dental School welcomes applications from students with disabilities. It is University and Faculty policy to take all reasonable steps to minimise the impact of disability upon academic study. Appropriate adjustments will be made to enhance the participation of students with a disability in the dental course. A prospective student with a disability is advised to discuss with Student Equity and Disability Support any issues related to his or her ability to successfully meet all the course and subsequent registration requirements.",
            "All students of the GRADUATE CERTIFICATE IN DENTAL THERAPY (ADVANCED CLINICAL PRACTICE) must possess the intellectual, ethical, physical and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence at completion required by the faculty and the Australian Health Practitioner Regulation agency.",
            "A student with a disability may be asked to provide independent medical or other clinical assessments of the disability and its possible impact on the ability of the student to successfully complete the course, before being accepted into the course. This statement would be treated in confidence with only those on the admissions committee and the Student Equity and Disability Support having access to the document.",
            "Deliberate misinformation about the student’s ability to successfully complete the course will be regarded as unprofessional practice and treated as such.",
            "While the Melbourne Dental School will make reasonable adjustments to minimise the impact of a disability, all students must be able to participate in the program in an independent manner. It is not reasonable for students to use an intermediary as an adjustment to compensate for a disability impacting on any of the five categories. In the clinical environment there is a primary duty of care to the patients and the needs of students cannot compromise this. It is expected that all students will be able to participate fully in all classroom-based learning activities and to successfully fulfil the self-study requirements of the course. The presence of a disability will not automatically entitle the student to preferential treatment in clinical place allocation."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The course comprises three subjects: 2 x 12.5 points and 1 x 25 points. Delivery mode will be via intensive coursework and clinical training. Some coursework delivery will be presented on-line.",
                "All subjects are required to be attempted in the same semester as the course is only offered full-time. The integration of clinical and didactic elements are important to skill development for the participants.",
                "The structure of the program is in blocks and concentrated weekly commitments on site to enable participation by people are maintaining existing employment."
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "ORAL90001",
                    "ORAL90002",
                    "ORAL90003"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}