{
    "Course name": "Graduate Diploma in Government Law",
    "Course code": "178AA",
    "Overview text": [
        "Government operates within a framework of law and practice, consistently with the rule of law. This framework includes constitutional law and administrative law but extends well beyond both to a host of particular legal regimes that apply to government actors.",
        "This is a dynamic branch of law, constantly changing in response to new pressures and government responses. It lends itself to comparison between countries, enabling students to understand different ways of tackling problems and to draw lessons from them. In an age of globalisation, it has a large and growing interface with international law, requiring a grasp of both areas.",
        "The specialisation in government law reflects the changing nature and complexity of the field. The subjects offer students expertise in matters that lie at the cutting-edge of government law in Australia and elsewhere."
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Government Law",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "075330F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "Start Year Intake 2024",
            "1. In order to be considered for entry, applicants must have completed:",
            "• a degree in Law (LLB, JD or equivalent) at honours standard or equivalent leading to admission to legal practice; or",
            "• a degree in Law (LLB, JD or equivalent) or equivalent leading to admission to legal practice and at least one year of documented, relevant professional experience; or",
            "• an undergraduate degree in a relevant discipline and at least one year of documented, relevant professional work experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "• prior academic performance; and if necessary",
            "• the professional experience.",
            "3.  The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Mid-year Intake 2024",
            "1. In order to be considered for entry, applicants must have completed:",
            "• a degree in Law (LLB, JD or equivalent) at honours standard or equivalent leading to admission to legal practice; or",
            "• a degree in Law (LLB, JD or equivalent) or equivalent leading to admission to legal practice and at least one year of documented, relevant professional experience; or",
            "• an undergraduate degree in a relevant discipline and at least one year of documented, relevant professional work experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "• prior academic performance; and if necessary",
            "• the professional experience.",
            "3.  The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.0 with no band less than 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne Law Masters welcomes applications from students with disabilities. The inherent academic requirements for study in the Melbourne Law Masters are:",
            "The ability to attend a minimum of 75% of classes and actively engage in the analysis and critique of complex materials and debate;",
            "The ability to read, analyse and comprehend complex written legal materials and complex interdisciplinary materials;",
            "The ability to clearly and independently communicate in writing a knowledge and application of legal principles and interdisciplinary materials and to critically evaluate these;",
            "The ability to clearly and independently communicate orally a knowledge and application of legal principles and interdisciplinary materials and critically evaluate these;",
            "The ability to work independently and as a part of a group;",
            "The ability to present orally and in writing legal analysis to a professional standard.",
            "Students who feel their disability will inhibit them from meeting these inherent academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete 50 credit points from the prescribed lists.",
                "Students who do not have a law degree from a common law jurisdiction or any prior legal studies or experience are also expected to complete the two-day preliminary subjectAustralian Legal Process and Legal Institutions.",
                "Note: Most subjects in the MLM program are 12.5 credit points each. Check individual subject handbook entries for confirmation."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Government Law subjects": {
            "overview": [
                [
                    "LAWS70334",
                    "LAWS90170",
                    "LAWS90011",
                    "LAWS90056",
                    "LAWS70269",
                    "LAWS70222",
                    "LAWS70411",
                    "LAWS90013",
                    "LAWS90255",
                    "LAWS90218",
                    "LAWS90149",
                    "LAWS70201",
                    "LAWS70417",
                    "LAWS70447",
                    "LAWS90117",
                    "LAWS70372",
                    "LAWS70390",
                    "LAWS90091",
                    "LAWS70448",
                    "LAWS90118",
                    "LAWS90217",
                    "LAWS70379",
                    "LAWS70397",
                    "LAWS90119",
                    "LAWS70367",
                    "LAWS70368",
                    "LAWS90024",
                    "LAWS70425",
                    "LAWS90106",
                    "LAWS90180",
                    "LAWS90103",
                    "LAWS70460",
                    "LAWS70037",
                    "LAWS70424",
                    "LAWS90150",
                    "LAWS70404",
                    "LAWS90151",
                    "LAWS90082",
                    "LAWS90284",
                    "LAWS90276",
                    "LAWS90277",
                    "LAWS90282",
                    "LAWS90281"
                ]
            ]
        },
        "Other subjects": {
            "overview": [
                [
                    "LAWS90167",
                    "LAWS70407",
                    "LAWS90250",
                    "LAWS90084",
                    "LAWS90058",
                    "LAWS90127",
                    "LAWS70016",
                    "LAWS90142",
                    "LAWS90041",
                    "LAWS90018",
                    "LAWS90019",
                    "LAWS70415",
                    "LAWS90121",
                    "LAWS70100",
                    "LAWS70386",
                    "LAWS70186",
                    "LAWS70422",
                    "LAWS70091",
                    "LAWS70391",
                    "LAWS70360",
                    "LAWS90174",
                    "LAWS70454",
                    "LAWS90175",
                    "LAWS90153",
                    "LAWS70446",
                    "LAWS70264",
                    "LAWS70120",
                    "LAWS90023",
                    "LAWS70365",
                    "LAWS70366",
                    "LAWS70184",
                    "LAWS90026",
                    "LAWS70349",
                    "LAWS70313",
                    "LAWS70430",
                    "LAWS70082",
                    "LAWS90120",
                    "LAWS70433",
                    "LAWS70401",
                    "LAWS90049",
                    "LAWS70462",
                    "LAWS90130",
                    "LAWS70319",
                    "LAWS90253",
                    "LAWS70185",
                    "LAWS90181",
                    "LAWS90292",
                    "LAWS90302"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}