{
    "Course name": "Graduate Certificate in Environmental Design",
    "Course code": "GC-ENVDES",
    "Overview text": [
        "Upgrade your skills to improve the environmental performance of buildings, neighbourhoods and cities",
        "The Graduate Certificate in Environmental Design (GCED) is a flexible course that will equip you with skills and knowledge to assess and improve environmental performance in the built environment. The course offers multiple streams across all disciplines of the built environment, which allow you to tailor the course to your specific needs. The Australian Sustainable Built Environment Council and the Green Building Council of Australia support the GCED and its interdisciplinary and comprehensive approach to environmental performance in the built environment. They provide data for assignments and course content, potential guest lectures and opportunities for research.",
        "Career Outcomes",
        "Depending on your stream and background, you may work in any of the following sector:",
        "Green building accreditor",
        "Environmentally Sustainable Design (ESD) consultant",
        "Environmental planning",
        "Ecological landscape architecture",
        "Environmental architect",
        "Last updated: 20 June 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Environmental Design",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in a cognate discipline (e.g. Architecture, Engineering, Design, Science, Environment), with a weighted average mark of at least an H3 (65%), or equivalent;",
            "OR",
            "an undergraduate degree in any discipline with a weighted average mark of at least an H3 (65%), or equivalent; and two years of documented relevant professional experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and, if relevant",
            "the professional experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required"
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne School of Design is the graduate school of the Faculty of Architecture, Building and Planning. It offers professional entry programs in Architecture, Construction Management, Landscape Architecture, Property and Urban Planning. It offers specialist development programs in Property Valuation, Planning and Design, Urban Design, and in Environmental Design.",
            "The Melbourne School of Design welcomes applications from students with disabilities. It is the University and Faculty (Architecture, Building and Planning) policy to take reasonable steps to make reasonable adjustments so as to enable students’ participation in degrees offered by the Melbourne School of Design (MSD).",
            "A candidate for degrees offered in the MSD must have abilities and skills which include the following: observation; communication; motor; conceptual, integrative, and quantitative; and behavioural and social. Adjustments can be provided to minimise the impact of a disability, however, particularly at a Graduate level, students need to be able to participate in programs in an independent manner and with regard to their safety and the safety of others.",
            "(i) Observation: Candidates must be able to read text, diagrams, maps, drawings and numerical data. Candidates should be able to observe details at a number of scales and to record useful observations of environmental contexts.",
            "(ii) Communication: Candidates should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. Candidates must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing, presenting one's own work in front of a large group, receiving and responding to feedback about one's own work in a public setting.",
            "(iii) Motor: Candidates should have sufficient motor function to elicit information from environmental contexts. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments. Candidates should have sufficient motor ability to prepare documentation of analytic texts, drawings and models of findings and for the reparation of proposals for environmental interventions via digital or other means. Candidates should have the ability to actively participate in appropriate site and/or design studio-based activities.",
            "(iv) Intellectual-Conceptual, Integrative and Quantitative Abilities: These abilities include measurement, calculation, reasoning, analysis, synthesis and, importantly, the ability to interpret results of such work. Problem resolution, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, given the disciplines pursued in the SD, candidates should be able to comprehend three-dimensional relationships and to understand the spatial relationships in environmental structures of a wide range of scales – from smaller than the individual through individual buildings and urban spaces to large geographic areas. Further, graduate study entails learning to master one’s own abilities and skills and to deploy them strategically. This requires further developing skills in both reflective and reflexive thinking and being able to practice these skills.",
            "(v) Behavioural and Social Attributes: A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "All students must complete 50 points, consisting of one core subject and three elective subjects."
            ]
        },
        "Core subject (12.5 points)": {
            "overview": [
                [
                    "ABPL90405"
                ]
            ]
        },
        "Elective subjects and Streams (37.5 points)": {
            "overview": [
                "The required 37.5 points of electives can be made up from any the subjects on the following list. These subjects are packaged in streams which reflect research and industry interests within Environmental Design. It is not necessary to limit choice to any one stream: electives can be taken in any combination. The streams are designed to help tailor your skills and knowledge towards a particular area you would like to work in.",
                [
                    "ABPL90032",
                    "ABPL90064",
                    "ABPL90086",
                    "ABPL90120",
                    "ABPL90268",
                    "ABPL90272",
                    "ABPL90320",
                    "ABPL90325",
                    "ABPL90341",
                    "ABPL90394",
                    "ABPL90153",
                    "ABPL90359",
                    "ABPL90320",
                    "ABPL90358",
                    "ENEN90014"
                ]
            ]
        },
        "STREAMS:": {
            "overview": [],
            "Green building accreditor*": {
                "overview": [
                    "Both of the following subjects:",
                    [
                        "ABPL90086",
                        "ABPL90120"
                    ],
                    "and one of the following subjects",
                    [
                        "ABPL90272",
                        "ABPL90325"
                    ]
                ]
            },
            "Advanced Building Systems": {
                "overview": [
                    [
                        "ABPL90153",
                        "ABPL90268",
                        "ABPL90032"
                    ]
                ]
            },
            "Environmental Planning": {
                "overview": [
                    [
                        "ABPL90064",
                        "ABPL90341",
                        "ABPL90320"
                    ]
                ]
            },
            "Environmentally Sustainable Design": {
                "overview": [
                    [
                        "ABPL90086",
                        "ABPL90325",
                        "ABPL90268"
                    ]
                ]
            },
            "Research": {
                "overview": [
                    "Any elective from the list and",
                    [
                        "ABPL90358",
                        "ABPL90359"
                    ],
                    "*Note:Green building accreditor — Formally endorsed by the Green Building Council of Australia"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}