{
    "Course name": "Graduate Diploma in Publishing and Communications (Advanced)",
    "Course code": "GDA-PUBCOM",
    "Overview text": [
        "The Graduate Diploma in Publishing and Communications (Advanced) is designed to combine instruction and practical experience in editing and publishing with analysis of publishing in its cultural, technological and commercial contexts. The program is suitable for graduates seeking careers in publishing and communications, and for people currently working in these fields who wish to consolidate their skills and broaden their industry knowledge."
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Publishing and Communications (Advanced)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "085952D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in a cognate discipline with a weighted average mark of at least H2B (70%) in appropriate subjects or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "relevance of previous studies.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.0 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Diploma in Publishing and Communications (Advanced) requires:",
                [
                    "two compulsory subjects (25 points)",
                    "minimum of four elective subjects (50 points)",
                    "maximum of two additional subjects (25 points)"
                ],
                "Total 100 points",
                "For policies that govern this degree, seeAcademic Services Policyin theUniversity Melbourne Policy Framework."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Compulsory Subjects": {
            "overview": [
                "25 points",
                [
                    "PUBL90001",
                    "PUBL90002"
                ]
            ]
        },
        "Elective Subjects": {
            "overview": [
                "minimum 50 points",
                [
                    "MULT90019",
                    "PUBL90003",
                    "PUBL90004",
                    "PUBL90006",
                    "PUBL90010",
                    "PUBL90014",
                    "PUBL90015",
                    "PUBL90016",
                    "PUBL90019",
                    "PUBL90027"
                ]
            ]
        },
        "Additional Elective Subjects": {
            "overview": [
                "maximum 25 points",
                [
                    "MECM40003",
                    "MECM40006",
                    "MECM40007"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who successfully complete the Graduate Diploma in Publishing and Communication (Advanced) may be eligible to enter the Master of Publishing and Communications (100 point program)."
    ]
}