{
    "Course name": "Graduate Diploma in Surgical Anatomy",
    "Course code": "GD-SURGANT",
    "Overview text": [
        "The Graduate Diploma in Surgical Anatomy is a qualification offered by the University of Melbourne's Department of Anatomy and Neuroscience, and accredited by the Royal Australasian College Of Surgeons (RACS).",
        "This course is specifically designed to assist participants intending to take the SET Surgical Sciences Examination of the Royal Australasian College of Surgeons. It also provides an opportunity to perform a comprehensive and supervised dissection (and surgical procedures) on a cadaver.",
        "The course is quality assured by the University of Melbourne and conducted by expert academic staff from the Department of Anatomy and Neuroscience at the University of Melbourne."
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Surgical Anatomy",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• an undergraduate or graduate medical degree recognised by the AMA, such as MBBS or its equivalent qualification.Meeting this requirement does not guarantee selection.2. In ranking applications, the Selection Committee will consider:• prior academic performance, and• any post-degree clinical experience.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university's English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Graduate Diploma in Surgical Anatomy welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the degree.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Commonwealth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with the Student Equity and Disability Support Team :http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Royal Australasian College of Surgeons (RACS)"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "To satisfy the requirements of the Graduate Diploma in Surgical Anatomy, students must complete 1 subject worth 100 credit points."
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "ANAT90008"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}