{
    "Course name": "Graduate Certificate in Arboriculture",
    "Course code": "GC-ARBCULT",
    "Overview text": [
        "The Graduate Certificate in Arboriculture is a 4 subject (50 point) graduate award of the University of Melbourne, designed for professionals currently managing, or planning to learn how to manage, urban trees.",
        "The course investigates a wide range of tree management issues and emphasizes the need to promote a strategic approach to tree management and the contribution trees can make to urban life. It aims to increase understanding of current issues in urban tree management through studies in growth and function, identification and selection, pests and diseases and environmental stresses including planning in a changing climate. Writing management plans for urban trees is a strong focus of the course.",
        "At the completion of this course participants are expected to be able to conduct tree risk assessments and have the ability to be engaged as an expert witness for local government or consumer and trade tribunal proceedings."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Arboriculture",
        "Year & campus": "2024— Burnley",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• either– an undergraduate degree, or– a relevant TAFE or Higher Education Advanced Diploma or equivalent and three years documented relevant work experience or equivalent, or– a relevant TAFE Diploma and four and a half years relevant, documented work experience, or equivalent, or– at least six years of documented relevant work experience, including at least three years in a demonstrated supervisory role.Meeting these requirements does not guarantee selection.2. In ranking and/or assessing applications, the Selection Committee will consider:• prior academic qualification and performance; and/or• the professional experience.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "To satisfy the requirements of the Graduate Certificate in Arboriculture students must successfully complete four core subjects (each 12.5 credit points) a total of 50 credit points.",
                "The core subjects are:",
                [
                    "HORT90041",
                    "HORT90042",
                    "HORT90043",
                    "HORT90044"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who successfully complete the course may be eligible for credit into Masters courses offered by theMelbourne Graduate School of Science"
    ]
}