{
    "Course name": "Graduate Diploma in Property Valuation",
    "Course code": "702PA",
    "Overview text": [
        "This exceptional program provides a professional qualification in valuation to those who hold an undergraduate degree in a semi-cognate discipline such as Commerce, Business, Planning, Architecture, Building, Quantity Surveying, Law or Engineering and at least one year of documented relevant work experience, or equivalent.",
        ""
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Property Valuation",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "052669B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree with a weighted average mark of at last H3 (65%) in a cognate discipline, such as Commerce, Business, Planning, Architecture, Building, Quantity Surveying, Law or Engineering; and",
            "one year of documented relevant work experience, or equivalent.",
            "Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the work experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 6.5is required.",
            "For information about how to applyclick here."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne School of Design is the graduate school of the Faculty of Architecture, Building and Planning. It offers professional entry programs in Architecture, Construction Management, Landscape Architecture, Property and Urban Planning. It offers specialist development programs in Property Valuation, Planning and Design and in Urban Design.",
            "The Melbourne School of Design welcomes applications from students with disabilities. It is the University and Faculty (Architecture, Building and Planning) policy to take reasonable steps to make reasonable adjustments so as to enable students’ participation in degrees offered by the Melbourne School of Design (MSD).",
            "A candidate for degrees offered in the MSD must have abilities and skills which include the following: observation; communication; motor; conceptual, integrative, and quantitative; andbehavioural and social. Adjustments can be provided to minimise the impact of a disability, however, particularly at Masters level, students need to be able to participate in programs in an independent manner and with regard to their safety and the safety of others.",
            "(i)Observation:Candidates must be able to read text, diagrams, maps, drawings and numerical data. Candidates should be able to observe details at a number of scales and to record useful observations of environmental contexts.",
            "(ii)Communication:Candidates should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. Candidatesmust be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.",
            "(iii)Motor:Candidates should have sufficient motor function to elicit information from environmental contexts. Off campus investigations may include visits to construction sites,urban, rural and/or remote environments. Candidates should have sufficient motor ability to prepare documentation of analytic texts, drawings and models of findings and for thepreparation of proposals for environmental interventions via digital or other means. Candidates should have the ability to actively participate in appropriate site and/or designstudio-based activities.",
            "(iv)Intellectual-Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, synthesis and, importantly, the ability tointerpret results of such work. Problem resolution, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, given the disciplines pursued in theMSD, candidates should be able to comprehend three-dimensional relationships and to understand the spatial relationships in environmental structures of a wide range of scales –from smaller than the individual through individual buildings and urban spaces to large geographic areas. Further, graduate study entails learning to master one’s own abilities andskills and to deploy them strategically. This requires further developing skills in both reflective and reflexive thinking and being able to practice these skills.",
            "(v)Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students arerequired to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstratinginterpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Completion of the Graduate Diploma in Property Valuation will meet all the valuation requirements of Certified Practising Valuer (CPV) certification with the Australian Property Insititute. However students will need to be evaluated on a case by case basis to check whether their prior studies (together with the Graduate Diploma in Property Valuation) meet the Australian Property Institute's requirements."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete 100 points of core subjects as detailed below."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core subjects": {
            "overview": [
                "Students must complete the following subjects:",
                [
                    "ABPL90045",
                    "ABPL90041",
                    "ABPL90026",
                    "ABPL90274",
                    "ABPL90011",
                    "ABPL90029",
                    "ABPL90275",
                    "ABPL90246"
                ]
            ]
        },
        "For a sample course plan please visit:": {
            "overview": [
                "http://edsc.unimelb.edu.au/graduate/course-planning/sample-course-plans-melbourne-school-of-design/property-valuation"
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}