{
    "Course name": "Graduate Certificate in Digital Engineering (Infrastructure)",
    "Course code": "GC-DIENGIN",
    "Overview text": [
        "The course is a post-graduate degree (Level 8 of the Australian Qualifications Framework) equipping professionals in the architecture, engineering and construction (AEC), facilities management (FM), and similar industries with solid foundations in creating, capturing and integrating data in a digitised work environment, and supporting them to contribute to the transformation of the industry.",
        "Participants will advance their knowledge of digital engineering, including Building Information Modelling (BIM), sensor systems and Internet of Things (IoT), reality capture and information visualisation. They will use digital methods during asset creation, management, and operations, capturing facilities by multisource imaging techniques, building information modelling, and information visualisation. They will critically analyse and evaluate digital engineering alternatives for addressing complex problems in architecture, engineering, construction, and infrastructure and facilities management, and generate digital engineering solutions to improve and transform industry practices.",
        "The course may be taken entirely online, however several subjects are also delivered on campus (in a dual delivery mode).",
        "Please Note:This course is not listed on the Commonwealth Register of Institutions and Courses for Overseas Students (CRICOS) and therefore is not available to international students who require a student visa to study in Australia. International students who are located offshore, or who do not otherwise require a student visa to study in Australia are encouraged to contactFuture Studentsto discuss their eligibility to enrol in this course.",
        "",
        "Last updated: 29 February 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Digital Engineering (Infrastructure)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "A 4-year degree in civil engineering, construction, architecture, or a related field of engineering with at least 50 points of tertiary level science or mathematics, with a weighted average mark of at least H3 (65%) or equivalent, or",
            "A 3-year degree in civil engineering, construction, architecture, or a related field of engineering with at least 50 points of tertiary level science or mathematics, with a weighted average mark of at least H3 (65%) or equivalent, and at least two years documented, relevant work experience since graduation.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and where relevant",
            "The professional experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry. The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Student Equity and Disability Liaison Unit website:http://services.unimelb.edu.au/studentequity"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Digital Engineering is a graduate degree consisting of 4 units, normally taking two semesters of part‐time studies. It is taught in English and is located at Level 8 of the Australian Qualifications Framework.",
                "The degree structure requires the completion of four (core) subjects:",
                [
                    "MCEN90032",
                    "GEOM90038",
                    "CVEN90062",
                    "GEOM90007"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}