{
    "Course name": "Graduate Certificate in Dental Public Health",
    "Course code": "GC-DPHLTH",
    "Overview text": [
        "Oral health is an integral part of health and yet oral diseases are amongst the most prevalent in the community. Dental public health seeks to improve the oral health of the population through population-level approaches and with focus on areas such as social determinants, prevention, oral health policy and promotion. This Graduate Certificate provides an overview of the fundamentals of public health, and applies these to oral health. This program is delivered in collaboration with a range of key public health organisations to provide insight and experience in the practical application of principles of public dental health. This course will be suitable for people in a wide variety of areas including clinical dental services, policy and government, and international dental health.",
        "Last updated: 28 May 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Dental Public Health",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree in any discipline, with a weighted average mark of at least 65%, or equivalent OR",
            "A completed Bachelor of Oral Health or Doctor of Dental Surgery",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance, including additional education or prizes; and",
            "Professional experience, including additional education or prizes ; and",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005) and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Course and Subject Descriptions, Course and Subject Objectives, Generic Skills and Assessment Requirements of this entry. The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Student Equity and Disability Support (SEDS) website:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Dental Public Health is comprised of four subjects (total 50 credit points) and is delivered jointly by the Melbourne Dental School and the Melbourne School of Global and Population Health. Students must complete all of:",
                [
                    "Three compulsory subjects (total 37.5 credit points)",
                    "One elective subject (12.5 credit points)"
                ],
                "This 50-credit point, year-long course comprises four 12.5 credit point subjects: three compulsory and one elective.",
                "Semester 1 (minimum 25.0 credit points, maximum 37.5)",
                "Compulsory subjects (25.0credit points)",
                [
                    "POPH90014"
                ],
                "* Offered by Melbourne School of Global and Population Health",
                [
                    "POPH90305"
                ],
                "* Offered by Melbourne Dental School",
                "Optional Elective subject (12.5 credit points) by selecting one of:",
                [
                    "POPH90013",
                    "POPH90218",
                    "POPH90231",
                    "POPH90274",
                    "POPH90094"
                ],
                "Semester 2 (minimum 12.5 credit points*, maximum 25.0 credit points):",
                "Compulsory subjects (12.5 credit points)",
                [
                    "POPH90306"
                ],
                "* Offered by Melbourne Dental School",
                "Elective subject (12.5 credit points) if elective not undertaken in Semester 1. Students can select one of:",
                [
                    "POPH90013",
                    "POPH90218",
                    "POPH90231",
                    "POPH90274",
                    "POPH90094"
                ],
                "*If an elective has been undertaken in addition to the two compulsory subjects in Semester 1, students will only undertake the final compulsory subject (12.5 credit points) in Semester 2."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}