{
    "Course name": "Graduate Certificate in Business Administration",
    "Course code": "GC-BAOL",
    "Overview text": [
        "The main aim of the Graduate Certificate of Business Administration is to help students to develop their capacity for effective management of organisations, from a unit or departmental level through to the whole-of-organisation level.",
        "The program will provide a grounding in selected aspects of business management to enable students to gain an understanding of the nature of general management and the role of the manager.",
        "This program is offered online and students need to complete Business Foundations for Managers (12.5 credit points) and other 37.5 credit points from a list of subjects to complete the course.",
        "Last updated: 25 May 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Business Administration",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree; and at least two years of documented work experience; or",
            "At least six years of documented work experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "The work experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applications are required to satisfy the University'sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note: students need to complete Business Essentials as the first subject. Students who successfully complete 25 credit points will be eligible to receive the Professional Certificate in Business Administration."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students need to complete 50 credit points to complete the course.",
                "Students who successfully complete 25 credit points can exit the course with Professional Certificate in Business Administration.",
                "Graduate Certificate in Business Administration (50 credit pts)",
                "Core subjects:",
                [
                    "BUSA90556"
                ],
                "Plus 37.5 credit points from the following subjects",
                [
                    "BUSA90557",
                    "BUSA90558",
                    "BUSA90059",
                    "BUSA90225",
                    "BUSA90003",
                    "BUSA90195",
                    "BUSA90246",
                    "BUSA90095"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}