{
    "Course name": "Graduate Certificate in Professional Skills for Scientists",
    "Course code": "GC-PROFSC",
    "Overview text": [
        "This program provides Science graduate students with specialist training in organisational management, communication and leadership, across a broad range of settings. Students study coursework subjects which have been designed to provide the broad, transferable, and practical skills and learning outcomes that the market demands and are appropriate for enhancing employability in any business or organisation that requires the expertise of science graduates. These subjects develop the theoretical and practical knowledge required to become a successful manager, communicator and leader, such as: decision-making, motivating and leading people, and developing communication strategies."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Professional Skills for Scientists",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "093590C",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "(1) In order to be considered for entry, applicants must meet one of the following requirements:",
            "Completion of any undergraduate science degree",
            "Concurrently enrolled in, or successfully completed, a graduate degree in any scientific discipline.",
            "Meeting these requirements does not guarantee selection.",
            "(2) In ranking applications, the Selection Committee will consider prior academic performance.",
            "(3) The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "(4) Applicants are required to satisfy the university’sEnglish language requirements for postgraduatecourses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must choose at least one subject from each the three specialisations listed below. The final subject can be chosen from any of the specialisations:"
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Management Skills": {
            "overview": [
                [
                    "MKTG90022",
                    "SKIL90004",
                    "MGMT90171",
                    "SCIE90005",
                    "BUSA90403",
                    "BUSA90471",
                    "SCIE90017",
                    "SCIE90018"
                ]
            ]
        },
        "Quantitative Skills": {
            "overview": [
                [
                    "MAST90072",
                    "MAST90045",
                    "MAST90044",
                    "MAST90007"
                ]
            ]
        },
        "Communication Skills": {
            "overview": [
                [
                    "SCIE90012",
                    "SCIE90013",
                    "EDUC90839",
                    "MULT20011"
                ],
                "**Please note**",
                "SCIE90012 Science Communication is only to be undertaken by students who are concurrently admitted into a Masters by Coursework degree",
                "SCIE90013 Communication for Research is only to be undertaken by students who are concurrently admitted into PhD program or are enrolled in Research Project subject"
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}