{
    "Course name": "Graduate Certificate in Paediatric Intensive Care Nursing",
    "Course code": "GC-PAEICN",
    "Overview text": [
        "The Graduate Certificate in Paediatric Intensive Care Nursing is a 50 credit-point course, delivered in blended model of online and work integrated learning. The course provides students with a sound understanding of the theoretical knowledge and scientific advances that underpin the management of paediatric patients requiring specialist critical care. During the course students will apply paediatric and critical care nursing knowledge in clinical practice, demonstrating their competence in caring for patients with complex care requirements.",
        "With clinical support from a health service employer, students will gain the knowledge and clinical skills required to understand core concepts relating to acute illnesses, diseases, and trauma in paediatric critical care services. They will also develop skills in the critical analysis of evidence to inform nursing care and management of patients and their families."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Paediatric Intensive Care Nursing",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• either– a Master of Nursing Science, or– a Bachelor of Nursing (or equivalent qualification);",
            "and- at least one year of documented clinical experience as a Registered Nurse working in an acute or sub-acute healthcare service within the preceding five years from the time of application; and- current unrestricted registration with the Nursing and Midwifery Board of Australia (courses with clinical components only); and- current employment and evidence of clinical support in your specialty area (courses with clinical components only); and- evidence of clinical support from a partnering health service and be employed a minimum of three (3) days or 24 hours per week for the standard course duration in a clinical setting that will provide the relevant clinical experience to meet course learning outcomes.",
            "Meeting these requirements does not guarantee entry.",
            "2. In ranking applications, the Selection Committee will consider:• prior academic performance; and• relevance of speciality practice and clinical experience3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of its subjects. The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate comprises of 50 credit points mandated specialty subjects."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                [
                    "NURS90076",
                    "NURS90096",
                    "NURS90085",
                    "NURS90087"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students may progress to the Masters of Advanced Nursing Practice."
    ]
}