{
    "Course name": "Graduate Certificate in Supply Chain and Operations Management",
    "Course code": "GC-SCOM",
    "Overview text": [
        "The Graduate Certificate in Supply Chain and Operations Management is a specialist program designed to equip students with deeper knowledge and training in supply chain and operations management. The subjects in this course adopt a practice-based approach with a focus on the application of supply chain and operations management theories, frameworks and tools in the daily operation of a supply chain. Another feature of this course is its focus on the latest developments and ‘best practices’ of contemporary topics, including sustainable supply chain and operations management, supply chain risk management, and emerging supply chain technologies (e.g., Blockchain, Internet of Things, and Artificial Intelligence).",
        "Subjects are taught by the leading faculty in the Department of Management and Marketing. Through real-world examples and case studies, students in this course will be offered ample opportunities to learn the best supply chain and operations practices in a broad range of industries. The knowledge gained in this course will not only prepare students in pursuing an exciting career in supply chain and operations management but also assist them in addressing complex supply chain and operations challenges in today’s uncertain, interconnected business environments.",
        "The course requires completion of 50 credit points of study, comprising four subjects in areas of supply chain management, operations and process management, project management, and global value chains. These subjects are offered through traditional classroom teaching during normal semesters.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Supply Chain and Operations Management",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline, or equivalent;",
            "a 500 word personal statement outlining why they wish to be considered for the course.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the personal statement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band6.5 is required.",
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline, or equivalent;",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required (with no individual band less than 6.5)."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "50 point program.",
                "Students must complete four x 12.5 point compulsory subjects.",
                [
                    "MGMT90026",
                    "MGMT90031",
                    "MGMT90032",
                    "IBUS90008"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}