{
    "Course name": "Graduate Certificate in Sports Medicine",
    "Course code": "GC-SPMED",
    "Overview text": [
        "The Graduate Certificate in Sports Medicine is online and interdisciplinary, designed to extend knowledge and skills for professional practice in the area of sports medicine and exercise prescription. The curriculum is internationally relevant, fosters interdisciplinary communication and embraces the specialised requirements of different health professionals. It is designed for practicing clinicians as it can be studied part time or full time and has a Specialist Certificate exit point within its nested structure. Graduate attributes are aligned with those of The Melbourne Graduate.",
        "This interdisciplinary, wholly online Graduate Certificate in Sports Medicine includes subjects which:",
        "This approach is pedagogically robust and embraces the progressing international climate of flexible, sustainable, distance learning models. Assessment tasks can be completed at a distance and submitted electronically, encompassing a variety of written and presentation formats relevant to clinicians in demonstrating knowledge, clinical reasoning, communication and reflective skills in academic and practice contexts.",
        "The Graduate Certificate in Sports Medicine pitches to professionals across degree-qualified clinical health and exercise disciplines, throughout career stages and internationally. In doing so, it meets the needs of post-graduates striving to achieve best practice professionally in Sports Medicine; embracing community health through working with the recreational athletes to the elite athlete. The program challenges and extends practitioners to anticipate, enhance and advance best practice internationally.",
        "The curriculum is designed around three elements which will be covered explicitly within learning outcomes in each subject: 1) Theory and Practice, 2) Evidence and Innovation and 3) Clinical practice in Context. Linking theory, research and practice is emphasised, utilising scientific evidence to underpin clinical practice and decisions. The 2 core subjects explore professional and clinical practice relating to sport, exercise and injury. The 2 elective subjects enable students to scaffold their learning according to their interest areas and practice context. These subjects all require analysis, synthesis and creative problem solving within a range of practice contexts; extended knowledge and understanding, research principles and new innovations that are necessary to working in different sporting environments.",
        "Last updated: 4 July 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Sports Medicine",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a bachelor degree or equivalent in the discipline of Physiotherapy, Medicine, Exercise Science, Podiatry; and",
            "at least 2 years of relevant post-entry to practice professional experience in clinical, sport or health.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applicants, the Selection Committee will consider:",
            "prior academic performance; and",
            "professional experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.0 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "In order to qualify for the Graduate Certificate of Sports Medicine students must successfully complete two core subjects (25 points) and two elective subjects (25 points). There are no pre-requisites and co-requisites and students can complete the subjects in any order (according to scheduling and availability).",
                "Subjects constituting Graduate Certificate of Sports Medicine can be undertaken singly as ‘stand-alone’ continuing professional development (CPD) Units or as a progression towards a Graduate Diploma or Master Degree."
            ],
            "Compulsory subjects": {
                "overview": [
                    [
                        "MEDI90092",
                        "REHB90007"
                    ]
                ]
            },
            "Elective subjects": {
                "overview": [
                    [
                        "REHB90001",
                        "HLTH90001",
                        "REHB90003",
                        "REHB90006",
                        "REHB90005",
                        "REHB90002",
                        "REHB90009",
                        "RADI90024",
                        "SMED90001",
                        "PSYC90108",
                        "PHRM90022",
                        "HLTH90017"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}