{
    "Course name": "Graduate Certificate in Wellbeing Science",
    "Course code": "GC-WBSCI",
    "Overview text": [
        "The Graduate Certificate in Wellbeing Science explores the science of wellbeing with an evidence-based approach, using science based methods of building wellbeing in varied contexts. Students gain a scientific understanding of how humans flourish and communities and institutions can be strengthened through a wellbeing science lens. The course will equip students to apply positive psychology and wellbeing science principles in their professional and personal life; valuable transferrable skills and the practical know-how to strategically apply wellbeing science in various settings.",
        "The course provides a rich and solid foundation of the historical developments of the field of Positive Psychology; explores key elements, theories, and perspectives from a range of scholars and practitioners; and introduces innovations within the field along with the frontiers of wellbeing research. Through experiential learning approaches, students explore applications of the positive psychology perspective and wellbeing science with individuals, organisations, and communities.",
        "As part of the learning and assessment processes, students engage in a range of conceptual, applied and research-informed tasks. The program draws on a variety of pedagogical approaches to promote deep learning, connection with others, and critical scholarship, providing students with skills to confidently apply their knowledge in the future."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Wellbeing Science",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 6 months full-time or 12 months part-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "either",
            "A bachelor honours degree or equivalent in a cognate area*; or",
            "A three-year undergraduate qualification and at least 50 credit points, or equivalent, of graduate study in a cognate area*; or",
            "A three-year undergraduate qualification in a cognate area*, and at least two years of documented relevant work experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Relevant work experience, where applicable.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAcademic Board ruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance Band 7is required.",
            "Note:",
            "*Cognate area: psychology, education, sociology, business, management, political science, medicine, public health, and economics."
        ],
        "Inherent requirements (core participation requirements)": [
            "This course welcomes applications from students with disabilities.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Commonwealth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the degree. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with the Student Equity and Disability Support Team:https://students.unimelb.edu.au/student-support/student-equity-and-disability-support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Wellbeing Science requires the completion of 50 credit points of study, usually over six months full time, or one to two years part time.",
                "Students must complete:",
                [
                    "Two compulsory subjects (25 points); and",
                    "Two elective subjects (25 points)."
                ],
                "Note that:",
                [
                    "The two compulsory subjects must be completed in the first semester of study.",
                    "Online course mode students may only enrol in Online mode subject availabilities."
                ],
                "Alternative Exit Point",
                "An early exit point is available for students who commence the Graduate Certificate, but later decide to not complete the whole course. These students may exit the Graduate Certificate in Wellbeing Science early*, and apply to graduate with one of the following awards:",
                [
                    "\n, if they have satisfied the completion requirements for that award during their enrolment in this graduate certificate course (i.e., successfully completed the prescribed 25 credit points of study).",
                    "\n, if they have satisfied the completion requirements for that award during their enrolment in this graduate certificate course (i.e., successfully completed the prescribed 25 credit points of study)."
                ],
                "*Students must discontinue their enrolment in the GC-WELLSCI without completing the award, to be conferred the exit award."
            ]
        },
        "Subject Options": {
            "overview": [
                "Note: Subject availability modes (i.e., On Campus / Online) can be found via the subject links."
            ],
            "Compulsory Subjects": {
                "overview": [
                    "Complete both subjects in the first semester of study.",
                    [
                        "EDUC91041",
                        "EDUC91042"
                    ]
                ]
            },
            "Elective Subjects": {
                "overview": [
                    "Select and complete two subjects.",
                    [
                        "EDUC91046",
                        "EDUC91043",
                        "EDUC91044",
                        "EDUC91045"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Professional and Continuing Education Degrees",
        "The University of Melbourne's Faculty of Education is widely recognised as a leader in continuing professional education.",
        "Graduate Certificate in Wellbeing Science graduates who wish to further their studies in wellbeing science may apply to theMaster of Applied Positive Psychologywith advanced standing.",
        "For more information about continuing professional study in Education, see theFaculty of Education Coursespage."
    ]
}