{
    "Course name": "Graduate Diploma in Arts",
    "Course code": "GD-ARTS",
    "Overview text": [
        "The Graduate Diploma in Arts is similar to an undergraduate major and ideally suited as an introduction to a new discipline. This course is suitable for professional development, and also as a preparatory program if you intend to study at a higher level in an area you have not studied previously."
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Arts",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "023190K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree, or equivalent.",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students are required to complete the program requirements/structure from the year that they commenced their program.  All compulsory, core and capstone subjects must be completed to be eligible to graduate from the program.",
                "Students cannot request to vary the Graduate level subjects (Levels 4 and above) offered in their specialisation or request to increase the volume of graduate subjects that are offered in their specialisation.",
                "No Specialisation:",
                "Students are required to complete subjects totalling 100 points chosen from any of the areas below, including:",
                [
                    "Two 12.5 point subjects at fourth-year level or above",
                    "Maximum of one 12.5 point subject at first-year level",
                    "Remaining points from subjects at second or third-year level."
                ],
                "With Specialisation:",
                "Subjects from each area of specialisation totalling 100 points (see each specialisation for details).",
                "Total 100 points",
                "For policies that govern this degree, see theCourses, Subjects, Awards and Programs Policyin theUniversity Melbourne Policy Library. Students also should also refer to information in theEnrolment and Timetabling Policy."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Successful completion of a Graduate Diploma in Arts may allow admission to some Masters by Coursework programs.",
        ""
    ]
}