{
    "Course name": "Graduate Diploma in Sports Medicine",
    "Course code": "GD-SPMED",
    "Overview text": [
        "The Graduate Diploma in Sports Medicine is online and interdisciplinary, designed to produce graduates with extended knowledge and skills for professional practice in the area of clinical sports medicine. The curriculum is internationally relevant, fosters interdisciplinary communication and embraces the specialised requirements of different health professionals. It is designed for practicing clinicians as it can be studied part time or full time and has several exit points within its nested structure. It provides a pathway through a specialist certificate and graduate certificate, with opportunity to progress to the 150 credit point Masters of Sports Medicine. Graduate attributes are aligned with those of The Melbourne Graduate; and further distinguished by established discipline-specific professional Masters level competency and standards frameworks in the domain of clinical sports medicine.",
        "A clinical, interdisciplinary, wholly online Graduate Diploma in Sports Medicine mapped to accredited professional specialisation with three overlapping foundational pillars incorporated within learning, teaching and assessment tasks. This course offers:",
        "This approach is pedagogically robust and embraces the progressing international climate of flexible, sustainable, distance learning models. Assessment tasks can be completed at a distance and submitted electronically, encompassing a variety of written and presentation formats relevant to clinicians in demonstrating knowledge, clinical reasoning, communication and reflective skills in academic and practice contexts.",
        "The Graduate Diploma in Sports Medicine is designed for professionals across degree-qualified clinical health disciplines, throughout career stages and internationally. In doing so, it pitches to post-graduates striving to achieve best practice professionally and clinically in Sports Medicine; embracing community health through working with a range of abilities, from recreational athletes to the elite athlete across the lifespan, from adolescent to senior athletes. The program challenges and extends clinicians to anticipate, enhance and advance best practice internationally.",
        "The curriculum is designed around three elements which will be covered explicitly within learning outcomes in each subject throughout the program: 1) Theory and Practice, 2) Evidence and Innovation and 3) Clinical Practice in Context. Linking theory, research and practice is emphasised, utilising scientific evidence to underpin clinical practice and decisions. The Graduate Diploma core subjects explore professional and clinical practice relating to sport, exercise and injury in areas including athlete physiology, biomechanics & performance; sports injury prevention, diagnosis & management and athlete case management. Alongside 6 core subjects, the course includes 2 selective subjects enabling students to scaffold their learning according to their interest areas and practice context. These subjects all require analysis, synthesis and creative problem solving within a range of practice contexts; extended knowledge and understanding, research principles and new innovations that are necessary to undertake sports medicine practice in different environments.",
        "Last updated: 4 July 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Sports Medicine",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must:",
            "a bachelor degree or equivalent in the discipline of Physiotherapy, Medicine, Podiatry; and",
            "have at least 2 years of relevant post-entry to practice professional experience in clinical sport or health.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applicants, the Selection Committee will consider:",
            "prior academic performance; and",
            "professional work experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.0 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "In order to qualify for the Graduate Diploma of Sports Medicine students must successfully complete six core subjects (75 points) and 2 elective subjects (25 points).",
                "Subjects constituting the Graduate Diploma can be undertaken singly as ‘stand-alone’ continuing professional development (CPD) Units or as a progression towards the Master of Sports Medicine. Subjects may be undertaken simultaneously with approval from the program director and in any order (according to scheduling and availability).",
                "Students may apply for recognition of prior learning in these subjects (RPL) of up to 25 credit points for any course with 50 or more credit points."
            ],
            "Compulsory subjects": {
                "overview": [
                    [
                        "MEDI90092",
                        "REHB90007",
                        "MEDI90089",
                        "SMED90002",
                        "SMED90001",
                        "PSYC90108"
                    ]
                ]
            },
            "Elective subjects": {
                "overview": [
                    [
                        "REHB90001",
                        "HLTH90001",
                        "REHB90003",
                        "REHB90006",
                        "REHB90005",
                        "REHB90002",
                        "REHB90009",
                        "RADI90024",
                        "REHB90010",
                        "HLTH90017",
                        "PHRM90022",
                        "PHTY90114",
                        "PHTY90126"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}