{
    "Course name": "Graduate Certificate in Climate Change and Health",
    "Course code": "GC-CCHLTH",
    "Overview text": [
        "The Graduate Certificate in Climate Change and Health provides foundational knowledge and skills that address one of the greatest global challenges to health and wellbeing in the 21stcentury. The course presents evidence on the wide-ranging and complex interactions between climate and the health of humans and the natural environment. Students will gain skills in assessing and measuring climate change impacts on health in diverse settings in Australia and globally and will identify and analyse mitigation and adaptation strategies and policy frameworks focused on reduction of climate change effects on health, including impacts on vulnerable populations. Students completing the Graduate Certificate will be well prepared for leadership roles in climate change related health policy, healthcare and community programs focused on sustainability, resilience, environmental protection and climate change mitigation and adaptation. Students interested in further study at the completion of the Graduate Certificate will be well placed to undertake a Master of Public Health (MPH) and will receive full credit for the subjects taken in the Graduate Certificate.",
        "Last updated: 4 August 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Climate Change and Health",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "A pass-level undergraduate degree in any discipline",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Notes:",
            "This Certificate is used as a pathway to the Master of Public Health only. Students will not be able to take this Certificate concurrently with the Master of Public Health."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": []
        },
        "Subject options": {
            "overview": [
                "Course Structure: Four subjects taken over six months full time or one year part time",
                "Students must complete the followingtwoCore subjects:",
                [
                    "POPH90230",
                    "POPH90303"
                ],
                "Students must choosetwoElectives from the following list:",
                [
                    "POPH90206",
                    "POPH90201",
                    "MEDI90107",
                    "POPH90304",
                    "POPH90309"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Subjects completed within this degree from the University of Melbourne may receive advanced standing (with credit) within the Master of Public Health.",
        "This Graduate Certificate cannot be taken concurrently with the Master of Public Health. The Graduate Certificate cannot be claimed retrospectively when the relevant subjects are taken as part of a completed Master of Public Health."
    ]
}