{
    "Course name": "Graduate Certificate in Primary Care Nursing",
    "Course code": "GC-PCN",
    "Overview text": [
        "The Graduate Certificate in Primary Care Nursing is a boutique course for nurses working or hoping to work in a primary care setting.  The course delivers comprehensive and evidence-based education in chronic disease and preventive health.  Students choose an elective subject in an area of clinical or academic interest.",
        "Educating the Nurse of the Future an independent review commissioned by the Australian Government (2020) recognised the importance of primary health care and recommended that Nurse Practitioner Masters courses should be redesigned with primary care in mind.   This course meets the qualification entry requirement for the Masters of Advanced Nursing Practice (Nurse Practitioner) program at the University of Melbourne.",
        "This course can be completed full time over 6 months or part time over 12 months. The course is four subjects in total; and consists of the three core subjects that are completed on-line and one elective. Students can choose from a range of elective subjects which may be on-line, blended or face to face.",
        "Last updated: 10 November 2023"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Primary Care Nursing",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in nursing or a three-year diploma of nursing or equivalent; and",
            "at least one year of documented relevant professional experience in a clinical setting; and",
            "National Division 1 registration.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "professional experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required.",
            "Other supporting documents such as a police check, Working With Children Check and CPR (HTLAID001) is required for the elective subject Immunisation and Travel Health.",
            "https://mdhs.unimelb.edu.au/study/current-students/placements"
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Primary Care Nursing is a 50-credit-point, part-time or full-time, coursework program comprising three (3) core subjects and one (1) elective subject."
            ]
        },
        "Subject options": {
            "overview": [
                "Subject Requirements"
            ]
        },
        "Core Subjects": {
            "overview": [
                "Students must complete all core subjects listed below: (37.5 credit points)",
                [
                    "NURS90104",
                    "NURS90105",
                    "GENP90021"
                ]
            ]
        },
        "Elective subjects": {
            "overview": [
                "Students must select one 12.5 credit point subject from the list below:",
                [
                    "GENP90017",
                    "POPH90070",
                    "POPH90169",
                    "POPH90167",
                    "NURS90077",
                    "NURS90078",
                    "NURS90086",
                    "NURS90013",
                    "NURS90106",
                    "POPH90069",
                    "POPH90068"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of other graduate coursework programs, such as:",
        "Master of Advanced Nursing Practice",
        "Master of Advanced Nursing Practice (Nurse Practitioner)",
        "Master of Advanced Nursing/Master of Public Health"
    ]
}