{
    "Course name": "Graduate Certificate in Neonatal Intensive Care",
    "Course code": "GC-NIC",
    "Overview text": [
        "The Graduate Certificate in Neonatal Intensive Care (GC-NIC) consists of 4 subjects, Applied Pathophysiology (NURS90076) and 3 neonatal subjects which provide a combination of evidenced based theory and actual experience in the service provider’s Neonatal Intensive Care Unit (NICU)",
        "Nurses and midwives completing the “Foundations in Neonatal Care” subject will receive a solid basis in the care of preterm and sick newborns in a Special Care Nursery or high dependency setting. The second subject  “Neonatal Intensive Care” builds on the previous foundational knowledge and encompasses the complex physiology  and care related to illness in the extremely preterm and sick neonate in an Intensive Care setting. Subjects include online learning, webinars and study days in partnership with the service provider. Students complete 50 credit points of study part-time.",
        "Nurses/midwives who wish to further advance their career after completing the GC-NIC will be eligible for the Master of Advanced Nursing Practice, Master of Advanced Nursing Practice (Nurse Practitioner) or Master of Advanced Nursing Practice/Master of Public Health."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Neonatal Intensive Care",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "either",
            "– a Master of Nursing Science, or",
            "– a Bachelor of Nursing (or equivalent qualification); or",
            "- a Bachelor of Midwifery (or equivalent qualification); or",
            "- a double degree in Bachelor of Nursing, Bachelor of Midwifery (BNBMID)",
            "and",
            "• at least one year of documented clinical experience as a Registered Nurse or Midwife working in an acute or sub-acute healthcare service within the preceding five years from the time of application; and",
            "• current unrestricted registration with the Nursing and Midwifery Board of Australia (courses with clinical components only); and",
            "• clinical support from a partnering health service and be employed a minimum of three (3) days or 24 hours per week for the standard course duration in a clinical setting that will provide the relevant clinical experience to meet course learning outcomes",
            "Meeting these requirements does not guarantee entry.",
            "2. In ranking applications, the Selection Committee will consider:",
            "• prior academic performance; and",
            "• the clinical experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university's English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry. The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The course is a 50 credit point program which follows the structure below with mandated subject options."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                [
                    "NURS90076",
                    "NURS90079",
                    "NURS90094",
                    "NURS90102"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students may progress to the Masters of Advanced Nursing Practice"
    ]
}