{
    "Course name": "Graduate Certificate in Educational Research",
    "Course code": "GC-EDRES",
    "Overview text": [
        "The Graduate Certificate in Educational Research a coursework program designed for individuals wanting to develop an understanding of educational research methodology and to design and undertake a research project in education. This coursework program prepares individuals for a graduate research degree."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Educational Research",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "070381B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "A four year degree in a cognate area, or equivalent; or",
            "An undergraduate degree in any discipline and at least 50 credit points, or equivalent, of graduate study in a cognate area;",
            "AND",
            "A weighted average mark of at least H2A (75%), or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAcademic Board ruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.",
            "The core participation requirements for study in the Faculty of Education are:1. The ability to comprehend complex information related to education.2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Educational Research requires the successful completion of 50 credit points of study over 6 months full time or 1 year part time.",
                "Students must complete two compulsory subjects:",
                [
                    "Education Research Methodology (12.5 credit points) ",
                    "Research Project in Education (37.5 credit points) "
                ]
            ]
        },
        "Subject options": {
            "overview": [
                "Education Research Methodology Subject",
                [
                    "EDUC90419"
                ],
                "Research Project in Education Subject",
                "This subject can be taken via full-time or part-time study.",
                "Full-time students complete EDUC91197 Research Project in Education in either Semester 1 or 2.",
                "Part time students can complete the subject:",
                [
                    "Over Semester 1 and Semester 2 by taking the Year Long study period of EDUC91197; or ",
                    "Over Semester 2 of one year, and Semester 1 of the following year, by taking EDUC91198 and EDUC91199 in sequence (Part 1 and Part 2 in combination comprise the one academic subject. The final subject grade will be issued after the completion of Part 2)."
                ],
                [
                    "EDUC91197",
                    "EDUC91198",
                    "EDUC91199"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduate Research Degrees",
        "The University of Melbourne's Faculty of Education (FOE) is widely recognised as a leader in Australian and international education research. ​",
        "Graduates interested in further study in one of Faculty of Education’s suite of graduate research degrees​ may have several options, depending on their prior qualifications, academic achievement, research experience and professional experience.",
        "Graduates of this course (GC-EDRES) may be eligible to apply to a graduate research degree including:",
        [
            "\n ",
            "\n (note there are professional experience requirements associated with this degree) ",
            "\n "
        ],
        "Entry to these courses is a competitive process and each course has additional entry requirements such as minimum academic entry scores which must be met. ​ Please check the Handbook course entry for details of entry requirements.",
        "For more information about graduate research study in Education see theFaculty of Education Research Degreespage."
    ]
}