{
    "Course name": "Graduate Certificate in Cancer Nursing",
    "Course code": "GC-CNCRNUR",
    "Overview text": [
        "The Graduate Certificate in Cancer Nursing is delivered wholly online by cancer nursing clinical experts and educators. This course is completed part-time over 12 months. As a student of this course, you will complete four core subjects and two selectives in a specialty area relevant to your area of practice. This course provides students with sound knowledge and understanding of the theoretical knowledge and scientific advances that underpin the comprehensive care and management of individuals affected by cancer. During the course students will apply cancer nursing knowledge into clinical practice demonstrating their ability to competently care for patients with complex care requirements using evidence-based and scientific approaches. On successful completion of this course, students may be eligible for the Master’s of Advanced Nursing Practice.",
        "Last updated: 13 February 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Cancer Nursing",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have:",
            "Completed a Bachelor of Nursing degree or higher-level degree (e.g. Master’s of Nursing Science – entry-to-practice); and",
            "Current and unrestricted registration as a Division 1 Registered Nurse with the Australian Health Practitioner Regulation Agency; and",
            "Documented evidence of a minimum of one year post-registration clinical experience; and",
            "Clinical support from a partnering health service and be employed a minimum of three (3) days or 24 hours per week for the standard course duration in a clinical setting that will provide the relevant clinical experience to meet course learning outcomes",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Relevant professional experience; and",
            "Documented evidence of working in a specialty area of cancer care for the duration of the course; and",
            "Completed nomination form from the applicant’s health service.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests provided by the Academic Board, performance band of an overall 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005) and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the subject description, subject objectives, generic skills and assessment requirements of this entry. The university is dedicated to proving support to those with special requirements. Further details in the disability support scheme can be found at the Disability Liaison websitehttp://www.services.unimelb.edu.au/disability"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "To qualify for the Graduate Certificate in Cancer Nursing, students must successfully complete:",
                [
                    "Four core subjects (37.5 credit points)",
                    "Two Selective subjects (12.5 credit points)"
                ]
            ]
        },
        "Core subjects": {
            "overview": [
                "Complete all of (37.5 points):",
                [
                    "NURS90076",
                    "NURS90121",
                    "NURS90135",
                    "NURS90136"
                ]
            ]
        },
        "Selective subjects": {
            "overview": [
                "Select two of (12.5 points):",
                [
                    "NURS90137",
                    "NURS90139",
                    "NURS90138",
                    "NURS90146",
                    "NURS90147"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}