{
    "Course name": "Graduate Certificate in Small Animal Ultrasound Abdominal",
    "Course code": "GC-SAUA",
    "Overview text": [
        "THIS COURSE IS NOT TAKING APPLICATIONS IN 2024",
        "Abdominal ultrasound is a vital tool in the investigation of disease processes in small animal veterinary medicine. The ability to obtain diagnostic images and the interpretation of these images in the context of the clinical case is considered a postgraduate skill in Veterinary Education.",
        "The Graduate Certificate in Small Animal Ultrasound Abdominal provides training in abdominal ultrasound with an emphasis on image optimisation, description and interpretation of the findings.",
        "On completion of the course the candidate will be competent in description and interpretation of abdominal ultrasound findings in the general practice setting.",
        "Last updated: 26 July 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Small Animal Ultrasound Abdominal",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "In order to be considered for entry, applicants must have completed;",
            "An entry-to-practice veterinary degree that is recognised by the University of Melbourne",
            "Meeting these requirements does not guarantee selection.",
            "In ranking applications, the Selection Committee will consider:",
            "1. \nprior academic performance; and\n",
            "2. prior academic performance; and",
            "prior academic performance; and",
            "The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "The minimum English language requirements for this course areBand 6.5."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Graduate Certificate in Small Animal Ultrasound Abdominal welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Commonwealth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with the Student Equity and Disability Support Team:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Small Animal Ultrasound Abdominal requires the completion of four compulsory subjects and a minimum of 50 case logs.",
                "Additional Course Completion RequirementsStudents are required to submit a minimum of 50 case logs through the Online Learning Portal.",
                "The case logs are a non-assessed item and a minimum of 50 case logs must be submitted prior to the completion of the final subject in the course."
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "VETS90040",
                    "VETS90041",
                    "VETS90042",
                    "VETS90043"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}