{
    "Course name": "Graduate Certificate in Science Education (Years 7-10)",
    "Course code": "GC-SCIED10",
    "Overview text": [
        "THIS COURSE IS NOT CURRENTLY AVAILABLE FOR ADMISSIONS",
        "",
        "The Graduate Certificate in Science Education (Years 7-10) is structured around four subjects which encompass the content strands in the Victorian Curriculum for Science:",
        "The audience for this certificate is qualified secondary teachers who would be called upon to teach science across the Years 7-10 grades ‘out-of-field’, without having a background in science pedagogy. This certificate will develop participants’ capacity to plan effective lessons and units of work, design and interpret classroom assessment, use resources effectively, use appropriate models, integrate effective questions in lessons and plan a balanced curriculum. Through this approach, participants’ content and pedagogical content knowledge will be improved and the course will also focus on developing participants’ dispositions and confidence to be effective teachers of Years 7-10 Science.",
        "Each subject centres around one sub-strand from the Science Understanding Strand in the Victorian Curriculum, namely Years 7-10 Biological Sciences, Years 7-10 Chemical Sciences, 7 -10 Physical Sciences and 7 – 10 Earth and Space Sciences. Alongside this science content focus, each subject will have a particular pedagogical or curricula emphasis. In this way each subject has a strong focus on exposure to specific science content through the lens of important pedagogical, curricular and social concepts and issues. For example, in the subjectInquiry and literacy tools in science classrooms, participants will consider a range of literacy tools that will enhance the learning of the Chemical Sciences topic Balancing Chemical Equations.",
        "A range ofOverarching Pedagogical Principleswill be considered across the graduate certificate and will be addressed throughout the four subjects. TheseOverarching Pedagogical Principlesare considered essential to an informed teaching of science and include, for example, an understanding of identifying and addressing common science misconceptions and formative and summative assessment techniques. Also included in theseOverarching Principlesis the Science Inquiry Skills Strand and the fifth sub-strand from Science Understanding, Science as a Human Endeavour. These two aspects of the Victorian Curriculum will be integrated throughout the four subjects so that participants develop a strong understanding and appreciation of the nature of science and how science is undertaken and incorporated in everyday life.",
        "Last updated: 10 February 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Science Education (Years 7-10)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "Either",
            "a four-year education degree, or equivalent; or",
            "Or",
            "an undergraduate degree in any discipline and at least 100 credit points, or equivalent, of graduate study in education.",
            "Meeting these requirements does not guarantee selection.",
            "2. In assessing applications, the Selection Committee will consider:",
            "Prior academic performance;",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7+is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The inherent requirements for study in the Faculty of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching.",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate in Science Education (Years 7-10) requires completion of 50-credit points of study over one year part time.",
                "Students must complete 4 compulsory subjects."
            ],
            "Compulsory Subjects": {
                "overview": [
                    [
                        "EDUC91037",
                        "EDUC91038",
                        "EDUC91039",
                        "EDUC91040"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of graduate coursework programs including the University of Melbourne Master of Education."
    ]
}