{
    "Course name": "Graduate Diploma in Computer Science",
    "Course code": "GD-CS",
    "Overview text": [
        "The Graduate Diploma in Computer Science provides students with an undergraduate degree and some programming and maths background the equivalent of a major in Computer Science and thereby acts as a direct pathway to the Master of Computer Science program.",
        "The Graduate Diploma in Computer Science will provide students with considerable technical expertise in computer science, including exposure to a variety of programming paradigms, an understanding of the systematic processes underpinning the software development lifecycle, and an appreciation of advanced topics in computing.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Diploma in Computer Science",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "099421E",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline with a weighted average mark of at least H3 (65%), or equivalent and",
            "at least 25 points of level 1 or above Computer Science subjects, or equivalent; and",
            "at least 25 points of level 1 or above mathematics or statistics subjects, or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Graduate Diploma in Computer Science welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree. The Graduate Diploma in Computer Science requires all students to enrol in subjects where they will require:",
            "1. The ability to comprehend complex science and technology related information;",
            "2. The ability to clearly and independently communicate a knowledge and application of science, and technology principles and practices during assessment tasks;",
            "3. The ability to actively and safely contribute in clinical, laboratory, and fieldwork/excursion activities.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. There may be additional inherent academic requirements for some subjects, and these requirements are listed within the description of the requirements for each of these subjects. Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the relevant Subject Coordinator and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "100-point program consisting of:",
                [
                    "Four compulsory subjects (50 points)",
                    "Elective subjects (50 points)"
                ],
                "Core subject selection (50 points core)",
                "Students must complete all of the following subjects:",
                [
                    "COMP90007",
                    "COMP90038",
                    "COMP90041"
                ],
                "AND one of:",
                [
                    "INFO20003",
                    "COMP20008"
                ],
                "General Elective subjects (50 credit points) from current list:",
                [
                    "COMP30024",
                    "COMP90048",
                    "COMP30019",
                    "COMP30022",
                    "COMP30026",
                    "COMP30020",
                    "SWEN30006",
                    "COMP90015",
                    "COMP90049",
                    "COMP90087"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}