{
    "Course name": "Graduate Certificate in Managing Youth Self-Harm and Suicide",
    "Course code": "GC-MANYSHS",
    "Overview text": [
        "THIS COURSE WILL NOT BE OFFERED IN 2024",
        "",
        "Developed in close consultation withOrygen– a global leader of research in the field – the Graduate Certificate in Managing Youth Self-Harm and Suicide gives you access to expert knowledge in this rapidly-evolving area of mental health. The course covers the latest theory, research and evidence-based approaches on the detection, prevention and management of self-harm and suicide-related behaviours in young people.",
        "The course is valuable for education and healthcare professionals working in a range of clinical and community settings. You will learn alongside a diverse group of peers while gaining insights relevant to your own practice.",
        "Delivered entirely online, the Graduate Certificate in Managing Youth Self-Harm and Suicide is designed to be taken part-time over one year, providing the flexibility and support needed for busy professionals to fit study around existing work commitments.",
        "Last updated: 18 April 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Managing Youth Self-Harm and Suicide",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in a cognate discipline such as Health Science, Social Work, Psychology, Medicine, Teaching, Education, Nursing, Occupational Therapy or related discipline; or",
            "an undergraduate degree or equivalent in any discipline, and at least two years of documented relevant professional work experience; or",
            "at least five years of documented relevant professional work experience, including clear evidence of career development, professional writing, and professional achievement or practice comparable to that expected of undergraduate degree holders in cognate disciplines.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and, if relevant",
            "professional experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Notes:",
            "Applicants who have completed the Professional Certificate in Youth Psychiatry, offered byOrygen, or the Graduate Certificate in Youth Mental Health, Graduate Diploma in Youth Mental Health or the Master of Youth Mental Health offered by The University of Melbourne within four years prior to course commencement may be granted advanced standing for the following subjects:",
            "\n Foundations of Youth Mental Health",
            "\n Engaging and Assessing Young People",
            "In considering students under special entry access schemes, the Selection Committee will consider aspects of disadvantage as set out from time to time in the University of Melbourne Graduate Access policy, evidence of rurality for rural applicants, and confirmation of Aboriginality for Indigenous applicants.",
            "Quotas may be applied."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Overview, Objectives, Assessment and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support:http://services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": []
        },
        "Compulsory subjects": {
            "overview": [
                [
                    "PSYT90096",
                    "PSYT90097",
                    "PSYT90114",
                    "PSYT90115"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of other graduate coursework programs.",
        "The Graduate Certificate in Managing Youth Self-Harm and Suicide is part of a suite of related courses in youth mental health. Students who complete the Graduate Certificate in Managing Youth Self-Harm and Suicide may be eligible to gain 25 points of credit (worth two subjects) if they decide to enrol in one of the following courses at the University of Melbourne:",
        [
            "\n."
        ],
        ""
    ]
}