{
    "Course name": "Graduate Certificate in Food Science",
    "Course code": "GC-FOODSC",
    "Overview text": [
        "The Graduate Certificate in Food Science is directed at persons who are interested in focusing their further study on food science and its applications in the food and associated industries.",
        "This course consists of four subjects (50 credit points), and is equivalent to the first or second semester of the Graduate Diploma in Food Science, or the Master of Food Science degree.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Food Science",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "042903B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed: an undergraduate degree in any discipline with at least an H3 (65%) weighted average, or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "1. In ranking applications, the Selection Committee will consider: Prior academic performance",
            "2. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments.",
            "3. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,  performance band 6.5 is required.",
            "Note:",
            "Students completing the Graduate Certificate in Food Science will be eligible for 50 points of credit into the Graduate Diploma of Food Science."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Veterinary and Agricultural Sciences (FVAS) welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to make reasonable adjustments so as to enable the student’s participation in the Faculty's programs. FVAS contributes to the New Generation degrees and offers a broad range of programs across undergraduate and post-graduate levels many of which adopt a multi-disciplinary approach.",
            "Students of the Faculty's courses must possess intellectual, ethical, and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the Faculty. Candidates must have abilities and skills in observation; motor in relevant areas; communication; in conceptual, integrative, and quantitative dimensions; and in behavioural and social dimensions.",
            "Adjustments can be provided to minimise the impact of a disability, however students need to be able to participate in the program in an independent manner and with regard to their safety and the safety of others.",
            "I. Observation:In some contexts, the student must be able to observe demonstrations and experiments in the basic and applied sciences. More broadly, observation requires reading text, diagrams, maps, drawings and numerical data. The candidate should be able to observe details at a number of scales and record useful observations in discipline dependant contexts.",
            "II. Communication:A candidate should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. A candidate must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.",
            "III. Motor:Candidates should have sufficient motor function necessary for participation in the inherent discipline-related activities. The practical work, design work, field work, diagnostic procedures, laboratory tests, require varying motor movement abilities. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments.",
            "IV. Intellectual-Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving, the critical skill demanded of professionals in land and environment industries, requires all of these intellectual abilities. In addition, the candidate should be able to comprehend three-dimensional relationships and to understand the spatial relationships of structures.",
            "V. Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel their disability will prevent them from meeting the above academic requirements are encouraged to contact Student Equity and Disability Services:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "This course consists of 50 points, 25 points of core subjects and 25 points of elective subjects."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                "Students must select two of the following subjects (25 points)",
                [
                    "FOOD90007",
                    "FOOD90023",
                    "FOOD90008",
                    "FOOD90022"
                ]
            ]
        },
        "Elective Subjects": {
            "overview": [
                "Students must select a further two subjects (25 points) from either the core or elective list.",
                [
                    "FOOD90028",
                    "AGRI90089",
                    "FOOD90012",
                    "FOOD90041",
                    "AGRI90057",
                    "AGRI90012",
                    "AGRI90014",
                    "FOOD90035",
                    "FOOD90010",
                    "FOOD90040",
                    "FOOD90033",
                    "FOOD90034"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}