{
    "Course name": "Graduate Certificate in Clinical Education",
    "Course code": "GC-CLINED",
    "Overview text": [
        "The Graduate Certificate in Clinical Education has evolved from the university's successful Graduate Certificate in University Teaching (GCUT). It uses much of the same proven pedagogy while locating learning within the clinical context to ensure that it resonates with busy clinicians. In recognition of workforce demands, participants will be able to choose between monthly contact days based at the Parkville campus four times per semester, or an intensive program with four days in the one week.",
        "The Graduate Certificate in Clinical Education has four practically-orientated subjects and will be delivered in association with the Centre for the Study of Higher Education, blending learners with the CSHE's GCUT stream when appropriate. The Graduate Certificate in Clinical Education will be unique in the international marketplace for its quality, flexibility and immediate utility.",
        "Clinicians who gain the University of Melbourne Graduate Certificate in Clinical Education will be valued for their commitment to clinical teaching. Those who progress to the Graduate Diploma in Clinical Education will be recognised for their advanced knowledge and skills, and those who undertake the Masters program for their demonstrated excellence in clinical education."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Clinical Education",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• an entry-to-practice degree or equivalent in a health discipline, or• a bachelor’s degree or equivalent in another area and have at least three years’ experience of clinical teaching; and• current involvement in the delivery of clinical teaching.Meeting this requirement does not guarantee selection.2. In ranking and/or assessing applications, the Selection Committee will consider:• prior academic qualification and performance; and• the professional experience.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required.Note.Priority for entry to the course will be given to holders of FMDHS Excellence in Clinical Teaching scholarships.The Selection Committee is composed of representatives of the Faculty of Medicine Dentistry and Health Sciences. It reports to the Excellence in Clinical Teaching Project Steering Committee, which in turn reports to the Medical Courses Committee."
        ],
        "Inherent requirements (core participation requirements)": [
            "Graduate Certificate in Clinical Education welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the degree.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Commonwealth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with the Student Equity and Disability Support Team:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Graduate Certificate of Clinical Education consists of 4 subjects of equal weighting (12.5 points each) spread over two semesters:",
                "First semester:EDUC90741 - Effective Clinical TeachingEDUC90742 - Effective Clinical Supervision",
                "Second semester:EDUC90743 - Clinical Education in PracticeEDUC90744 - Assessing Clinical Learners"
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                [
                    "EDUC90741",
                    "EDUC90742",
                    "EDUC90743",
                    "EDUC90744"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of further coursework programs, including the Graduate Diploma in Clinical Education (GD-CLINED) and the Master of Clinical Education (MC-CLINED)."
    ]
}