{
    "Course name": "Graduate Certificate in English for the Global Workplace",
    "Course code": "GC-ENGGWRK",
    "Overview text": [
        "The course is aimed at improving the scope of students’ employment options and professional advancement through enhancing their ability to use English in the workplace. It is designed for non-native speakers of English, and develops students’ skills in professional writing, professional speaking, intercultural communication, and self-editing.",
        "Please note:This course is only available part-time in 2024, therefore it is not currently available to international student visa holders."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in English for the Global Workplace",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "093563F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree, or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Duration:6 months full-time / 1 year part-time",
                "Program Requirements -",
                [
                    "four compulsory subjects (50 points)"
                ],
                "Total 50 points"
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Compulsory subjects": {
            "overview": [
                "50 points",
                [
                    "ESLA90001",
                    "ESLA90002",
                    "ESLA90003",
                    "ESLA90004"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may be eligible for progression to a range of other graduate coursework programs."
    ]
}