{
    "Course name": "Graduate Certificate in University Teaching",
    "Course code": "697AA",
    "Overview text": [
        "The Graduate Certificate in University Teaching supports the development of professionalism in higher education practice. Participants engage in a range of activities designed to draw upon their own particular involvements in higher education teaching and learning. The course explores the principles of effective teaching and learning in a range of contexts and formats, covering topics including large and small group teaching, assessment, evaluation, effective use of information and communication technology, curriculum design and cultural diversity. It affords participants opportunities to work collaboratively with colleagues, and to design and undertake a small project that investigates an aspect of higher education.",
        "This course is delivered online or in a mixed attendance mode. Participants must be engaged in teaching in higher education and will normally take the course part-time, over one or two years."
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in University Teaching",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "12 months part-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "•              at least a pass-level undergraduate degree or equivalent",
            "or",
            "•              a minimum of five years documented, relevant work experience.",
            "Applicants must also be in current employment at a university or higher education institution with significant curriculum design and/or teaching responsibilities (full time, part time or sessional).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "•              prior academic performance; and",
            "•              work experience if relevant.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAcademic Board ruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "This course welcomes applications from students with disabilities. It is University policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in programs. The core participation requirements for study in the Faculty of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching.",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Services."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students complete 50 points of study, typically over two years.",
                "Students take 3 core subjects and 1 elective."
            ]
        },
        "Subject options": {
            "overview": [
                "Note:Online Mode students must enrol in all subjects as Online.",
                "Mixed Attendance Mode students are recommended to take EDUC9001 and EDUC90002 as On Campus, and the remaining subjects as Online."
            ]
        },
        "Core subjects": {
            "overview": [
                "The following subjects must be completed:",
                [
                    "EDUC90001",
                    "EDUC90002",
                    "EDUC90516"
                ]
            ]
        },
        "Elective subjects": {
            "overview": [
                "Students complete one of the following subjects:",
                [
                    "EDUC90517",
                    "EDUC90970"
                ]
            ]
        },
        "": {
            "overview": []
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Professional and Continuing Education DegreesThe University of Melbourne's Faculty of Education (FOE) is widely recognised as a leader in continuing professional education. If you wish to further your professional studies, you can consider a specialisation in the courseworkMaster of Educationor a specialist Master’s degree. Entry to these is based on prior qualifications and academic merit, and may also require professional experience. For more information about continuing professional study in Education, see theFaculty of Education coursespage."
    ]
}