{
    "Course name": "Graduate Certificate in Science (Advanced)",
    "Course code": "GCA-SCI",
    "Overview text": [
        "This course is an exit award only from the Graduate Diploma in Science (Advanced) or Master of Science.",
        "Last updated: 13 September 2024"
    ],
    "Overview table": {
        "Award title": "Graduate Certificate in Science (Advanced)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "085950F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "8",
        "Credit points": "50 credit points",
        "Duration": "6 months full-time or 12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "This course is an exit award only and not available for entry"
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students are credited 50 points of their relevant Masters level discipline subjects available in the related stream upon withdrawal from the course.",
                "No more than 12.5 points of level 3 subjects may be used.",
                "This award is only available to the specialisations of BioSciences, Chemistry, Computer Science, Earth Sciences, Mathematics and Statistics, and Physics."
            ]
        },
        "Subject options": {
            "overview": [
                "from the Graduate Diploma in Science (Advanced) or Master of Science."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}