{
    "Course name": "Juris Doctor",
    "Course code": "MC-JURISD",
    "Overview text": [
        "The Melbourne JD (Juris Doctor) is a graduate law degree that has set a benchmark for legal education in Australia. Applicants must have either an undergraduate degree in a discipline other than law or a degree in law from an overseas jurisdiction. The course leads to admission to the legal profession in all Australian jurisdictions and can be used as a basis for seeking admission in many overseas jurisdictions as well. The course equips students with the skills and knowledge to take a leading role in a range of careers including legal practice, business, international, government and community organisations.",
        "The course is characterised by a highly rigorous, integrated and comparative curriculum that enables students to develop rich and holistic understandings of laws within their broader national and international contexts.  Taught by respected academics - leaders in their fields in Australia and around the world - students learn alongside peers from a range of undergraduate backgrounds, adding new perspectives and approaches to their learning."
    ],
    "Overview table": {
        "Award title": "Juris Doctor",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "073303C",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time or 72 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:\r\na tertiary degree in a discipline other than law or a degree in law from an overseas jurisdiction.Meeting these requirements does not guarantee selection.\n",
            "2. a tertiary degree in a discipline other than law or a degree in law from an overseas jurisdiction.Meeting these requirements does not guarantee selection.",
            "3. In ranking applications, the Selection Committee will consider:\r\nprior academic performance in all tertiary studies.\n",
            "4. prior academic performance in all tertiary studies.",
            "5. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "6. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.5 is required (no band below 7.0).",
            "a tertiary degree in a discipline other than law or a degree in law from an overseas jurisdiction.Meeting these requirements does not guarantee selection.",
            "prior academic performance in all tertiary studies.",
            "Note:Graduate Degree Package for School Leavers",
            "The University of Melbourne offers Graduate Degree Packages to high achieving school leavers, allowing them to secure places (Commonwealth Supported Places for domestic students or International fee places) in the Juris Doctor provided they meet certain requirements.",
            "For a Commonwealth Supported Place or an International Fee Place, the applicant must:",
            "complete an Australian Year 12 or the International Baccalaureate (IB) in 2018 or later either:\r\n\n",
            [
                [
                    "in Australia; or",
                    "outside Australia and be an Australian citizen;"
                ]
            ],
            "achieve an ATAR (or notional ATAR) of at least 99.80;",
            "apply for a University of Melbourne Graduate Degree Package for commencement in the year following completion of Year 12 or IB via VTAC;",
            "enrol immediately or be granted deferral in the year following Year 12;",
            "successfully complete a Bachelor of Agriculture, Arts, Biomedicine, Commerce, Design, Fine Arts, Music or Science at the University of Melbourne including all the specified prerequisite subjects; and",
            "commence the Juris Doctor within 18 months of completing the undergraduate degree.",
            "in Australia; or",
            "outside Australia and be an Australian citizen;",
            "Applicants should refer to the University handbook for the additional entry requirements for the undergraduate degrees in the Graduate Degree Packages.",
            "Note:Indigenous Applicants",
            "Melbourne Law School offers an alternative entry pathway for Indigenous applicants to the JD. The pathway provides an opportunity for applicants to contextualise their prior academic performance by reference to their previous work history, personal circumstances and other relevant experiences.",
            "In order to be considered for entry via the Indigenous entry pathway, applicants must have completed:",
            "a tertiary degree in a discipline other than law or a degree in law from a different legal system; and",
            "an interview with a Sub-Committee of the JD Selection Committee",
            "To be considered, applicants must be of Aboriginal and/or Torres Strait Islander descent. Confirmation of Indigenous status will be sought for such applicants.",
            "In ranking applications, the Selection Committee will consider:",
            "prior academic performance in all tertiary studies;",
            "the interview; and,",
            "any supporting documentation supplied.",
            "Applicants should contact the Program Manager, Indigenous Law and Justice Hub for further information about the purpose and structure of the interview."
        ],
        "Inherent requirements (core participation requirements)": [
            "Melbourne Law School welcomes applications from students with disabilities. It is University and Law School policy to take all reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the School's programs.",
            "The inherent academic requirements for the study in Melbourne Law School are:",
            "1. The ability to attend classes and actively engage in the analysis of complex materials and debate;",
            "2. The ability to read, analyse and comprehend complex written legal materials and complex interdisciplinary materials;",
            "3. The ability to clearly and independently communicate in writing a knowledge and application of legal principles and interdisciplinary materials and critically evaluate these;",
            "4. The ability to clearly and independently communicate orally a knowledge and application of legal principles and interdisciplinary materials and critically evaluate these;",
            "5. The ability to work independently and as a part of a group;",
            "6. The ability to present orally and in writing legal analysis to a professional standard.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel their disability will prevent them from participating in tasks involving these inherent academic requirements are encouraged to contact the University forStudent Equity and Disability Services."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "The Juris Doctor is accredited as fulfilling the academic requirements for admission to legal practice in Victoria by the Council of Legal Education. Mutual recognition legislation generally allows lawyers admitted in Victoria to gain admission to practice in other States and Territories of Australia."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Juris Doctor requires the successful completion of 300 credit points."
            ],
            "To obtain the degree students must complete:": {
                "overview": [
                    [
                        "200 credit points of compulsory subjects",
                        "Juris Doctor (JD) students are not allowed to select a fourth subject in Semester 1, Year 1. Elective subjects can only be taken in Year 2 and 3 respectively.",
                        "100 credit points of JD (quota and enrichment) and Melbourne Law Masters (MLM) elective subjects including\n",
                        [
                            [
                                "A maximum of 100 credit points of JD quota elective subjects",
                                "A maximum of 100 credit points of JD enrichment elective subjects",
                                "A maximum of 25 credit points of MLM elective subjects"
                            ]
                        ],
                        "Melbourne Law Masters (MLM) electives: JD students can apply to take up to 25 credit points of their electives (typically two) from the list of MLM electives. Students cannot self-enrol into MLM electives. Enrolments will be confirmed after a selection process has been run."
                    ],
                    "Compulsory subjects",
                    "Sixteen subjects are compulsory, enabling the School to provide its students with cumulative learning, by integrating both subject matter and skills across and between semesters. These subjects are organised so as to ensure a balanced range in each semester, between which linkages can be made. In addition, subjects in both private and public law build progressively over the semesters, contributing to the effectiveness of the learning experience.",
                    "In the first semester of the JD students are grouped into cohorts for compulsory subjects. This enhances the collegial experience of, and learning communities forged between, students during their time in the School and establishes bonds that will continue long after graduation.",
                    "Elective subjects",
                    "The remaining eight subjects are chosen by students from a wide range of optional subjects offered by the School. These vary from year to year, enabling the School to respond to changes in the law and legal thinking and giving students access to the latest developments in research by some of the leading scholars in the School.",
                    "Standard course plan - 3 years",
                    "In its standard form, the degree is taken full time over three years. This format enables students to take advantage of other educational, professional and social opportunities during the summer and winter breaks, including seasonal clerkships, international exchanges, internships, mooting and Law Review editorial work.",
                    "Flexible course plans - 2.5, 3.5, 4-6 years",
                    "The Melbourne JD can also be accelerated by students with outstanding results with approval from the Law School, by utilising the summer and winter break periods to complete additional JD subjects. The Melbourne JD can also be extended and there are several different course structures available for both full time and part time students. This flexibility enables students to take advantage of other educational, professional and social opportunities during the summer and winter breaks, including seasonal clerkships, international exchanges, internships, mooting and Law Review editorial work. These opportunities are necessarily more limited for accelerating students."
                ]
            },
            "Subject options": {
                "overview": [
                    "Melbourne JD compulsory and elective subjects",
                    "The below subjects are structured based on the full-time three-year JD course plan. Alternative course plans can be found on the Melbourne Law School website via:",
                    "https://law.unimelb.edu.au/students/jd/studies/course-plans",
                    "Year 1 - Foundation subject",
                    [
                        "LAWS50023"
                    ],
                    "Year 1 - Compulsory subjects",
                    [
                        "LAWS50024",
                        "LAWS50026",
                        "LAWS90140",
                        "LAWS50028",
                        "LAWS50029",
                        "LAWS50025",
                        "LAWS50031"
                    ],
                    "Year 2 - Compulsory subjects",
                    [
                        "LAWS50032",
                        "LAWS50033",
                        "LAWS50030",
                        "LAWS50034",
                        "LAWS50035",
                        "LAWS50037"
                    ],
                    "Year 3 - Compulsory subjects",
                    [
                        "LAWS50039",
                        "LAWS50036"
                    ],
                    "Legal Research",
                    "Students may enrol into this subject via my.unimelb. This is handled on a first-enrolled basis during the timely re-enrolment period. During the late re-enrolment period, the Academic Support Office will offer a selection process for each of the topics on offer during 2024.",
                    "Elective subjects",
                    "During the JD, students must complete 100 credit points of elective study. Students following the full-time three-year course plan would generally complete:",
                    [
                        "Two electives in Year 2",
                        "Six electives in Year 3"
                    ],
                    "Electives in the JD fall under three broad categories:",
                    "1. JD quota electives",
                    "2. JD enrichment electives",
                    "3. Melbourne Law Masters (MLM) electives available to JD students",
                    "The timeline and process for enrolment in electives in each category are outlined in full on the Melbourne Law School website, respectively:",
                    "https://law.unimelb.edu.au/students/jd/studies/enrolment",
                    "https://law.unimelb.edu.au/students/jd/studies/enrolment/jd-electives",
                    "JD quota elective subjects",
                    "Students may enrol into these subjects via my.unimelb. This is handled on a first-enrolled basis during the timely re-enrolment period. During the late re-enrolment period, where additional seats remain, the Academic Support Office will offer a selection process.",
                    "(Sort by 'Name' to view list alphabetically)",
                    [
                        "LAWS50130",
                        "LAWS50055",
                        "LAWS90213",
                        "LAWS90059",
                        "LAWS50063",
                        "LAWS50084",
                        "LAWS90197",
                        "LAWS90074",
                        "LAWS90136",
                        "LAWS50050",
                        "LAWS50064",
                        "LAWS50078",
                        "LAWS50047",
                        "LAWS90243",
                        "LAWS50049",
                        "LAWS50128",
                        "LAWS50094",
                        "LAWS90212",
                        "LAWS90036",
                        "LAWS50096",
                        "LAWS90039",
                        "LAWS50131",
                        "LAWS90075",
                        "LAWS50127",
                        "LAWS50041",
                        "LAWS90108",
                        "LAWS50075",
                        "LAWS50109",
                        "LAWS90262",
                        "LAWS90261",
                        "LAWS50068",
                        "LAWS50046",
                        "LAWS90008",
                        "LAWS50108",
                        "LAWS50119",
                        "LAWS50101",
                        "LAWS90186",
                        "LAWS90240"
                    ],
                    "JD enrichment elective subjects",
                    "Most JD enrichment electives have an application and selection process. Students cannot self-enrol in electives with an application. Enrolments will be confirmed after a selection process has been run.",
                    "(Sort by 'Name' to view list alphabetically)",
                    [
                        "LAWS90214",
                        "LAWS90209",
                        "LAWS50042",
                        "LAWS90006",
                        "LAWS50059",
                        "LAWS50060",
                        "LAWS50058",
                        "LAWS90164",
                        "LAWS90189",
                        "LAWS50114",
                        "LAWS90107",
                        "LAWS90241",
                        "LAWS50116",
                        "LAWS50102",
                        "LAWS50126",
                        "LAWS90257",
                        "LAWS90201",
                        "LAWS90259",
                        "LAWS90198",
                        "LAWS90004",
                        "LAWS90060",
                        "LAWS90108",
                        "LAWS90033",
                        "LAWS90258"
                    ],
                    "Melbourne Law Masters (MLM) elective subjects",
                    "JD students can apply to take up to 25 credit points of their electives (typically two) from the list of MLM electives below. Students cannot self-enrol into MLM electives. Enrolments will be confirmed after a selection process has been run.",
                    "(Sort by 'Name' to view list alphabetically)",
                    [
                        "LAWS90242",
                        "LAWS90248",
                        "LAWS70380",
                        "LAWS70245",
                        "LAWS70135",
                        "LAWS70382",
                        "LAWS90064",
                        "LAWS70230",
                        "LAWS90086",
                        "LAWS70270",
                        "LAWS70133",
                        "LAWS70176",
                        "LAWS90014",
                        "LAWS70149",
                        "LAWS90266",
                        "LAWS90205",
                        "LAWS90126",
                        "LAWS70013",
                        "LAWS70450",
                        "LAWS70031",
                        "LAWS90152",
                        "LAWS70348",
                        "LAWS70452",
                        "LAWS70091",
                        "LAWS70391",
                        "LAWS70392",
                        "LAWS70139",
                        "LAWS70308",
                        "LAWS70219",
                        "LAWS70304",
                        "LAWS70120",
                        "LAWS70006",
                        "LAWS70028",
                        "LAWS90181",
                        "LAWS90097",
                        "LAWS70362",
                        "LAWS70421",
                        "LAWS90208",
                        "LAWS90099",
                        "LAWS70350",
                        "LAWS70259",
                        "LAWS70225",
                        "LAWS70458",
                        "LAWS70182",
                        "LAWS70080",
                        "LAWS90199",
                        "LAWS70239",
                        "LAWS90029",
                        "LAWS70314",
                        "LAWS70113",
                        "LAWS90165",
                        "LAWS70112",
                        "LAWS70329",
                        "LAWS90229",
                        "LAWS70193",
                        "LAWS90239",
                        "LAWS70002",
                        "LAWS90251",
                        "LAWS90052",
                        "LAWS90230",
                        "LAWS70053",
                        "LAWS70322",
                        "LAWS90267",
                        "LAWS90269",
                        "LAWS90271",
                        "LAWS90276",
                        "LAWS90285",
                        "LAWS90281",
                        "LAWS70082",
                        "LAWS70151",
                        "LAWS70184",
                        "LAWS90127"
                    ],
                    "Elective subjects not offered this year",
                    "The following subjects have been offered as electives in the JD Quota list previously, however are not available for enrolment this year:",
                    "(Sort by 'Name' to view list alphabetically)",
                    [
                        "LAWS90161",
                        "LAWS50110",
                        "LAWS90061",
                        "LAWS50122",
                        "LAWS50056",
                        "LAWS50088",
                        "LAWS50115",
                        "LAWS50085",
                        "LAWS50057",
                        "LAWS90078",
                        "LAWS90005",
                        "LAWS90198",
                        "LAWS50125",
                        "LAWS50066",
                        "LAWS50051",
                        "LAWS50080",
                        "LAWS50118",
                        "LAWS90004",
                        "LAWS90037",
                        "LAWS50070",
                        "LAWS90079",
                        "LAWS50067",
                        "LAWS50071",
                        "LAWS90133",
                        "LAWS90109",
                        "LAWS50069",
                        "LAWS50045",
                        "LAWS90228",
                        "LAWS90060",
                        "LAWS50052",
                        "LAWS50133",
                        "LAWS50091",
                        "LAWS50121",
                        "LAWS90076",
                        "LAWS90188",
                        "LAWS90162",
                        "LAWS90038",
                        "LAWS50098",
                        "LAWS50117",
                        "LAWS50095",
                        "LAWS90007",
                        "LAWS50132",
                        "LAWS50106",
                        "LAWS90077",
                        "LAWS50124",
                        "LAWS90134",
                        "LAWS90135",
                        "LAWS90190",
                        "LAWS50120",
                        "LAWS90163",
                        "LAWS50093",
                        "LAWS90245",
                        "LAWS90191",
                        "LAWS90256",
                        "LAWS90260",
                        "LAWS90187"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}