{
    "Course name": "Master of Nursing Science",
    "Course code": "MC-NURSC",
    "Overview text": [
        "The Master of Nursing Science prepares students for registration with the Nursing and Midwifery Board of Australia. The course encourages a practice-oriented and evidence-based approach to learning as a means of ensuring close links between theory and practice and as a tool to support self-directed and life-long learning. To qualify for NMBA registered nurse accreditation, students must complete 187.5 credit points (13 subjects) of core subjects and 12.5 credit points of one elective subject."
    ],
    "Overview table": {
        "Award title": "Master of Nursing Science",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "061211F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completedeither:",
            "An undergraduate degree in any discipline, or equivalent, completed not more than ten years prior to the date of application; or\n",
            "An older undergraduate degree and either more recent graduate study that demonstrates current capacity for graduate study or five years of documented relevant work experience.Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "• Prior academic performance; and where relevant• The work experience.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses and theNursing and Midwifery Board of Australia (NMBA) English standardprior to commencement of the course. For applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceBand 7+is required in one of IELTS, PTE Academic or TOEFL IBT, and must be achieved in one sitting.",
            "NOTES:",
            "Due to the requirement to satisfy both the University and NMBA English standards, applicants who satisfy theUniversity language requirementsthrough prior tertiary study will need to meet one of the following requirements;",
            "1. English is the applicant’s primary language and they have completed at least six years of primary and secondary education in English in one of the NMBA recognised countries* OR",
            "2. The applicant has undertaken, or will undertake one of the approved English language proficiency tests and has achieved (or will achieve) at least the minimum scores required, as specified in the Nursing and Midwifery Board of Australia's (NMBA) English language skills registration standard(3)",
            "*NMBA Recognised countries are Australia, Canada, New Zealand, Republic of Ireland, South Africa, United Kingdom, United States of America.",
            "Performance Band 7+ is equivalent is the following minimum scores in each test:",
            "IELTS: 7 overall and no band less than 7",
            "TOEFL IBT: 94 overall,Writing 27, Minimum of 24 in Speaking, Listening and Reading",
            "PTE Academic: 65 overall and no score less than 65",
            "*Please note the TOEFL iBT (Special Home Edition) is not accepted for this course"
        ],
        "Inherent requirements (core participation requirements)": [
            "Students must comply with Fitness to Practice Rules, which are accessible fromSchedule 1of theStudent Fitness to Practice Policy (MPF1345).",
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course and Subject Descriptions, Course and Subject Objectives, Generic Skills and Assessment Requirements.",
            "The Department of Nursing is committed to making reasonable adjustments to teaching and learning, assessment, clinical practice and other activities to enable students to participate in the MNSc course. However, reasonable adjustments must not fundamentally change the nature of the core participation requirements. The University is dedicated to provide support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website:http://www.services.unimelb.edu.au/disability/",
            "It is a requirement of the course that students will be expected to physically examine their peers (of both genders) in classroom settings and patients (of both genders) in clinics and hospital wards.",
            "Nurses have a responsibility to maintain their physical and mental health, to practice safely and effectively (Code of Conduct for Nurses, NMBA, 2018). All students in the MNSc course must possess the intellectual, ethical, physical and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence at graduation required by theMelbourne School of Health Sciences, Department of Nursingand theAustralian Health Practitioner Registration Agency(AHPRA). Nursing practice in Australia is bound by theRegistration Standards defined by the Australian Nursing and Midwifery Board.",
            "It is recommended that students read and understand the Professional Standards (http://www.nursingmidwiferyboard.gov.au/Codes-Guidelines-Statements/Professional-standards.aspx) and comprehend their responsibilities as a student. Students are automatically registered with AHPRA when enrolled in an entry-to-practice course and as such, are subject to the same regulations regarding professional conduct andmandatory reportingobligations.",
            "A student with a disability may be asked to provide independent medical or other clinical assessments of the disability and its possible impact on the ability of the student to successfully complete the course, before being accepted into the course. This statement would be treated in confidence with only those on the admissions committee and Disability Liaison having access to the document. (Deliberate misinformation about the student’s ability to successfully complete the course will be regarded as unprofessional practice and treated as such.)",
            "While the Department of Nursing will make reasonable adjustments to minimise the impact of a disability, all students must be able to participate in the course in an independent manner. It is not reasonable for students to use an intermediary as an adjustment to compensate for a disability impacting on any of the five categories listed below. In the clinical environment, there is a primary duty of care to the patients, and the needs of students cannot compromise this. It is expected that all students will be able to participate fully in all classroom based learning activities and to successfully fulfil the clinical assessment and self-study requirements of the course. The presence of a disability will not automatically entitle the student to preferential treatment in clinical place allocation.",
            "A candidate for the MNSc must have abilities and skills in the following five categories:",
            "1. Observation",
            "Practical Classes: The student must be able to observe mandatory demonstrations and undertake clinical assessments in the designated subjects.",
            "Clinical Work: The student must be able to observe a patient accurately at a distance and close at hand. Observation necessitates the functional use of the senses of vision, hearing and somatic sensation. It is enhanced by the functional use of the sense of smell.",
            "2. Communication",
            "Practical Classes: The student must be able to hear and comprehend instructions in practical sessions and be able to clearly and independently communicate knowledge and application of the principles and practices of the subject during assessment tasks.",
            "Clinical Work: A student must be able to hear, speak to, and observe patients in order to elicit information and perceive nonverbal communications. A student must be able to communicate effectively and sensitively with patients in both oral and written forms and in a culturally-competent and ethical manner. The student must also be able to communicate effectively and efficiently in both oral and written forms with all health care practitioners involved in patient management (including the use of telephones and computers).",
            "3. Motor",
            "Practical Classes: A student must be able to undertake the motor requirements for any mandatory practical sessions. Such actions require coordination of both gross and fine muscular movements, equilibrium, and functional use of the senses of touch and vision.",
            "Clinical Work: Nursing is a physically demanding profession and requires coordination of both gross and fine muscular movements, equilibrium, and functional use of the senses of touch and vision.",
            "Students should have sufficient motor function to elicit information from patients by clinical examination, which may include palpation of the patient’s body structures, active and passive movements of the patient, auscultation and other diagnostic manoeuvres.",
            "4. Intellectual-Conceptual, Integrative and Quantitative Abilities",
            "Practical Classes: The student is expected to have the ability to develop problem-solving skills and demonstrate this ability in practical sessions. These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving requires all of these intellectual abilities.",
            "Clinical Work: The student is expected to have the ability to develop problem-solving skills and demonstrate the ability to establish management plans and priorities. These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving requires all of these intellectual abilities.",
            "5. Behavioural and Social Attributes",
            "Practical Classes: A student must possess the emotional and mental health required for full utilisation of his/her intellectual abilities, the exercise of good judgement, and the prompt completion of all required tasks.",
            "Clinical Work: A student must possess the emotional health required for full utilisation of his/her intellectual abilities, the exercise of good judgement, the prompt completion of all responsibilities attendant to the diagnosis and care of patients, and the development of mature, sensitive, and effective relationships with patients and colleagues."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Nursing and Midwifery Council (ANMAC)",
            "The Master of Nursing Science has been approved by Nursing and Midwifery Board of Australia (NMBA) and accredited by the Australian Nursing and Midwifery Council (ANMAC).",
            "The Nursing and Midwifery Board of Australia has developed the core registration standards that can be found on their websitehere. Students are strongly encouraged to review the NMBA standards and ensure that they meet the criteria for NMBA registration"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Course structure:",
                "For students who are currently enrolled into the MNSc program, please follow the 2021 course structure which can be found in the 2021 Handbook.",
                "For 2022 or later commencing students:",
                "Master of Nursing Science involves completion of 13 core subjects and one elective subject. To qualify for NMBA registered nurse accreditation, students must complete 187.5 credit points (13 subjects) of core subjects and 12.5 credit points of one elective subject.",
                "Master of Nursing Science Program",
                "200-pointFull-time Program:",
                [
                    "13 compulsory subjects (187.5 points)",
                    "One elective subject (12.5 points)"
                ],
                "Year 1 (100 credit points)",
                "Core subjects (100 credit points)",
                [
                    "NURS90066",
                    "HLTH90019",
                    "NURS90155",
                    "NURS90154",
                    "NURS90153",
                    "NURS90120",
                    "NURS90156"
                ],
                "Year 2 (100 credit points)",
                "Core subjects (87.5 credit points)",
                [
                    "NURS90158",
                    "NURS90157",
                    "NURS90059",
                    "NURS90077",
                    "NURS90076",
                    "NURS90075"
                ],
                "Elective subjects (12.5 credit points)",
                "Student must complete one of the following elective subjects (12.5 credit points):",
                [
                    "NURS90122",
                    "POPH90069",
                    "NURS90025",
                    "ISYS90069",
                    "POPH90257",
                    "PSYT90092",
                    "NURS90142",
                    "NURS90079",
                    "NURS90141",
                    "NURS90121"
                ],
                "Prerequisite subjects",
                [
                    "NURS90154 Foundations of Nursing Practice is a prerequisite for NURS90157 Transition to Nursing Practice, NURS90158 Nursing of Chronic Health Conditions and NURS90075 Applications of Clinical Pharmacology",
                    "NURS90155 Nursing of Acute Health Conditions is a prerequisite for NURS90157 Transition to Nursing Practice, NURS90158 Nursing of Chronic Health Conditions and NURS90075 Applications of Clinical Pharmacology",
                    "NURS90153 Human Anatomy and Physiology is a prerequisite for NURS90156 Human Pathophysiology",
                    "NURS90156 Human Pathophysiology is a prerequisite for NURS90076 Applied Pathophysiology only for MNSc graduates."
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may be eligible to enrol in the Master of Philosophy or Doctor of Philosophy. Enrolment will be subject to a suitable WAM or high distinction in the Research subject NURS90059 individual assesssment."
    ]
}