{
    "Course name": "Master of Management (Accounting)",
    "Course code": "MC-MGMTACT",
    "Overview text": [
        "The Master of Management (Accounting) provides a foundation in accounting, economics, management, and quantitative methods. Students in the Master of Management (Accounting) complete a specialist core to develop their knowledge and skills in financial accounting, managerial accounting, auditing, taxation, corporate reporting and accounting information systems. The Master of Management (Accounting) is accredited by Certified Practising Accountants Australia (CPA Australia) and Chartered Accountants Australia and New Zealand (CAANZ). Successful completion of the Master of Management (Accounting) prepares students to apply for entry to CPA Australia and CAANZ professional studies programs."
    ],
    "Overview table": {
        "Award title": "Master of Management (Accounting)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "064499E",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline, or equivalent; and",
            "a personal statement outlining why they wish to be considered for the course.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance (in previous intakes, a University of Melbourne equivalent 70 weighted average mark has been competitive);",
            "the ; and",
            "an interview or any other evidence required by the Committee (if required).",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAdmission and Selection into Course Policy",
            "4. The minimum English language requirements for this course areBand 6.5.",
            "Notes:",
            "1. Applicants with an undergraduate degree in a business/commerce or related discipline, or with a degree in any discipline with appropriate business breadth or minor, may be awarded up to 50 points of credit.",
            "2. Students who discontinue from the Master of Management (including any of its named streams) but have successfully completed the requirements of the Graduate Certificate in Management or the Graduate Diploma in Management will be eligible to receive the Graduate Certificate in Management or the Graduate Diploma in Management, respectively, as an exit award.",
            "Guaranteed PathwayFor those applicants with an undergraduate degree in any discipline who are assessed as not meeting the University of Melbourne WAM-equivalent requirement for entry into the Master of Management (Accounting), a place in the Graduate Certificate in Business may be offered. Successful completion of the Graduate Certificate with a minimum average WAM of 65, and no failed subjects, provides a guaranteed pathway into the 200-point Master of Management (Accounting). Advanced Standing for subjects completed in the Graduate Certificate in Business will be provided where subjects undertaken align with equivalent foundation subjects to be completed as part of this degree.",
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline, or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required (with no individual band less than 6.5).",
            "Notes:",
            "1. Applicants with an undergraduate degree in a business/commerce or related discipline, or with a degree in any discipline with appropriate business breadth or minor, may be awarded up to 50 points of credit.",
            "2.  Applicants with a prior degree in Accounting will be excluded from entry to this degree. Subject to meeting entry requirements, applicants are encouraged to apply for the Master of Management (Accounting and Finance) program. ",
            "3. Students who discontinue from the Master of Management Accounting) but have successfully completed the requirements of the Graduate Certificate in Management or the Graduate Diploma in Management will be eligible to receive the Graduate Certificate in Management or the Graduate Diploma in Management, respectively, as an exit award.",
            "Guaranteed PathwayFor those applicants with an undergraduate degree in any discipline who are assessed as not meeting the University of Melbourne WAM-equivalent requirement for entry into the Master of Management (Accounting), a place in the Graduate Certificate in Business may be offered. Successful completion of the Graduate Certificate with a minimum average WAM of 70, and no failed subjects, provides a guaranteed pathway into the 200-point Master of Management (Accounting). Advanced Standing for subjects completed in the Graduate Certificate in Business will be provided where subjects undertaken align with equivalent foundation subjects to be completed as part of this degree."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Successful completion of the Master of Management (Accounting) (200 point) provides students with training in all key areas of accounting and prepares them to apply for entry to Chartered Accountants Australia and New Zealand (CAANZ) or Certified Practising Accountant (CPA) professional studies programs."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Completion of one entry point program is required.",
                "The Master of Management (Accounting) has two entry point programs: 200pt and 150pt programs.",
                "The Master of Management (Accounting) 200 Point (200pt) program consists of sixteen subjects, comprising five foundation subjects, three discipline core subjects, one capstone subject and seven elective subjects.",
                "Students who wish to take more Year 1 Foundation selective subject(s) can do so through selecting them in the electives list and completing them as elective subject(s).",
                "Students should visit the Majors, minors and specialisations page for specific entry point course structures. Students entering the course with 50 points of advanced standing should refer to the 150pt program."
            ],
            "Subject options (200pt program)": {
                "overview": []
            },
            "Foundation subjects": {
                "overview": [
                    "Students must complete all of the following subjects:"
                ],
                "Foundation core subjects (the first semester of the program)": {
                    "overview": [
                        [
                            "ACCT90004",
                            "ECOM90009",
                            "ECON90015",
                            "FNCE90060"
                        ],
                        "Students must complete one of the following subjects:"
                    ]
                },
                "Foundation selectives": {
                    "overview": [
                        [
                            "MGMT90018",
                            "MGMT90140",
                            "MKTG90037"
                        ]
                    ]
                }
            },
            "Discipline core subjects": {
                "overview": [
                    "Students must complete all of the following subjects:",
                    [
                        "ACCT90002",
                        "ACCT90009",
                        "ACCT90010",
                        "ACCT90012",
                        "ACCT90013",
                        "ACCT90014",
                        "ACCT90015",
                        "ACCT90016",
                        "ACCT90030"
                    ]
                ]
            },
            "Capstone subject": {
                "overview": [
                    "Students must complete the following subject in their final semester of the program:",
                    [
                        "ACCT90033"
                    ]
                ]
            },
            "Electives": {
                "overview": [
                    "Students must complete one subject from any of the following lists:"
                ],
                "Accounting electives": {
                    "overview": [
                        [
                            "ACCT90005",
                            "ACCT90006",
                            "ACCT90007",
                            "ACCT90008",
                            "ACCT90026",
                            "ACCT90031",
                            "BISY90009",
                            "BUSA90520",
                            "MULT90014"
                        ]
                    ]
                },
                "Economics electives": {
                    "overview": [
                        [
                            "ECON90016",
                            "ECON90025",
                            "ECON90032",
                            "ECON90045",
                            "ECON90047"
                        ]
                    ]
                },
                "Finance electives": {
                    "overview": [
                        [
                            "FNCE90011",
                            "FNCE90016",
                            "FNCE90018",
                            "FNCE90045",
                            "FNCE90046",
                            "FNCE90048",
                            "FNCE90049",
                            "FNCE90051",
                            "FNCE90056",
                            "FNCE90057",
                            "FNCE90086",
                            "FNCE90087"
                        ]
                    ]
                },
                "Management electives": {
                    "overview": [
                        [
                            "BUSA90529",
                            "IBUS90002",
                            "IBUS90003",
                            "IBUS90008",
                            "MGMT90011",
                            "MGMT90012",
                            "MGMT90013",
                            "MGMT90014",
                            "MGMT90015",
                            "MGMT90016",
                            "MGMT90017",
                            "MGMT90018",
                            "MGMT90025",
                            "MGMT90026",
                            "MGMT90027",
                            "MGMT90030",
                            "MGMT90031",
                            "MGMT90032",
                            "MGMT90037",
                            "MGMT90038",
                            "MGMT90140",
                            "MGMT90141",
                            "MGMT90146",
                            "MGMT90148",
                            "MGMT90165",
                            "MGMT90176",
                            "MGMT90201",
                            "MGMT90208",
                            "MGMT90261",
                            "MKTG90026",
                            "MKTG90037"
                        ]
                    ]
                },
                "Marketing electives": {
                    "overview": [
                        [
                            "MKTG90001",
                            "MKTG90002",
                            "MKTG90003",
                            "MKTG90004",
                            "MKTG90006",
                            "MKTG90007",
                            "MKTG90008",
                            "MKTG90009",
                            "MKTG90011",
                            "MKTG90017",
                            "MKTG90033",
                            "MKTG90040",
                            "MKTG90048",
                            "MKTG90049"
                        ]
                    ]
                },
                "Work Integrated Learning electives": {
                    "overview": [
                        [
                            "BUSA90473",
                            "BUSA90485",
                            "BUSA90525",
                            "ENGR90039"
                        ]
                    ]
                },
                "Law electives": {
                    "overview": [
                        [
                            "LAWS90125"
                        ]
                    ]
                }
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}