{
    "Course name": "Master of Urban Planning",
    "Course code": "MC-URPL",
    "Overview text": [
        "The Master of Urban Planning is an accredited professional degree that focuses on Australian and international policy and planning pertaining to human settlements. Planners promote the establishment of economically viable, socially just, environmentally sustainable, safe and healthy human settlements.",
        "As planners, we believe that this is a critical pursuit and perhaps it is never more timely than now as we adapt to global changes that impact our cities. These changes include climate change; deepening inequality that has often been associated with diminished local democracy and the rise of community advocacy; growing concerns for community health and safety; and the emergence of global city-regions that require innovations in governance and planning."
    ],
    "Overview table": {
        "Award title": "Master of Urban Planning",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "002524M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.       In order to be considered for entry, applicants must have completed:",
            "a minimum three-year undergraduate degree with a weighted average mark of at least H3 (65%), or equivalent; and",
            "a personal statement outlining relevant prior study and work experience, and motivation to undertake the course.",
            "Meeting these requirements does not guarantee selection.",
            "2.       In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the personal statement. ",
            "3.       The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4.       Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note.",
            "Graduate Degree Packages for School Leavers",
            "The University of Melbourne offers Graduate Degree Packages to high achieving school leavers, allowing them to secure places (Commonwealth Supported Places for domestic students or International fee places) in the Master of Urban Planning provided that they meet certain requirements.",
            "For a Commonwealth Supported Place or an International Fee Place, the applicant must:",
            "complete an Australian Year 12 or the International Baccalaureate (IB) in 2018 or later either:",
            "—in Australia; or",
            "—outside Australia and be an Australian citizen;",
            "achieve an ATAR (or notional ATAR) of at least 96.00;",
            "apply for a University of Melbourne Graduate Degree Package for commencement in the year following completion of Year 12 or IB via VTAC;",
            "enrol immediately or be granted deferral in the year following Year 12;",
            "successfully complete a Bachelor of Design or Arts at the University of Melbourne including all the specified prerequisite subjects;",
            "achieve a minimum weighted average mark of H3 (65%) in their undergraduate degree; and",
            "commence the Master of Urban Planning within 18 months of completing the undergraduate degree.",
            "Applicants eligible for entry via a Graduate Degree Package will not be required to complete a personal statement as part of their application.",
            "Applicants should refer to the University handbook for the additional entry requirements for the undergraduate degrees in the Articulated Degree Pathways.",
            "Additional Notes",
            "Guaranteed Transfer into Commonwealth Supported PlaceStudents with a fee place in this course who complete 100 points of the course with a weighted average of at least 75% and who are eligible for a Commonwealth Supported Place will be guaranteed a transfer to a Commonwealth Supported Place for the final 100 points of the course.",
            "For information about how to applyclick here."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne School of Design (MSD) welcomes applications from students with disabilities. It is the University's and Faculty's policy to take reasonable steps to make reasonable adjustments so as to enable students’ participation in degrees offered by the Melbourne School of Design.",
            "A candidate for degrees offered in the MSD must have abilities and skills which include the following: observation; communication; motor; conceptual, integrative, and quantitative; and behavioural and social. Adjustments can be provided to minimise the impact of a disability, however, particularly at Masters level, students need to be able to participate in programs in an independent manner and with regard to their safety and the safety of others.",
            "(i) Observation:Candidates must be able to read text, diagrams, maps, drawings and numerical data.",
            "(ii) Communication:Candidates should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. Candidates must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.",
            "(iii) Motor:Candidates should have sufficient motor function to elicit information from environmental contexts. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments. Candidates should have sufficient motor ability to use a computer and to prepare documentation of analytic texts, graphs and maps. Candidates should have the ability to actively participate in appropriate site and studio-based activities.",
            "(iv) Intellectual-Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, synthesis and, importantly, the ability to interpret results of such work. Problem resolution, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, candidates should be able to comprehend spatial relationships in urban spaces and larger geographic areas. Further, graduate study entails learning to master one’s own abilities and skills and to deploy them strategically. This requires further developing skills in both reflective and reflexive thinking and being able to practice these skills.",
            "(v) Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "It is expected that graduates of the Master of Urban Planning will have completed the academic requirements for membership of:",
            "Planning Institute of Australia (PIA)"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Urban Planning requires the successful completion of 200 credit points."
            ],
            "All students must complete:": {
                "overview": [
                    [
                        "100 credit points of core subjects",
                        "25 credit points of Capstone subjects (MSD Minor Thesis both Part 1 and 2)",
                        "75 credit points of elective subjects including\nA minimum of 50 credit points of Specialisation elective subjects\nA maximum of 25 credit points of Multidisciplinary (Melbourne School of Design and/or university graduate) elective subjects\n\n",
                        "A minimum of 50 credit points of Specialisation elective subjects",
                        "A maximum of 25 credit points of Multidisciplinary (Melbourne School of Design and/or university graduate) elective subjects"
                    ],
                    [
                        "A minimum of 50 credit points of Specialisation elective subjects",
                        "A maximum of 25 credit points of Multidisciplinary (Melbourne School of Design and/or university graduate) elective subjects"
                    ],
                    "A maximum of 25 credit points of Multidisciplinary (Melbourne School of Design and/or university graduate) elective subjects",
                    "Master of Urban Planning (MUP) students can complete specialisation elective subjects and multidisciplinary elective subjects by participating in an exchange program with an overseas university.",
                    "To view a sample course plan please go to:",
                    "http://edsc.unimelb.edu.au/graduate/course-planning/sample-course-plans-melbourne-school-of-design/urban-planning"
                ]
            },
            "Subject Options": {
                "overview": [
                    "Core subjects",
                    [
                        "ABPL90134",
                        "ABPL90135",
                        "ABPL90130",
                        "ABPL90246",
                        "ABPL90131",
                        "ABPL90064",
                        "ABPL90132",
                        "ABPL90315"
                    ],
                    "Capstone Subjects",
                    "All students must complete MSD Minor Thesis both part 1 and 2 (25 points).",
                    [
                        "ABPL90396",
                        "ABPL90397"
                    ],
                    "The thesis provides the degree's capstone experience and gives students the necessary preparation for professional work and/or doctoral study.",
                    "Note:",
                    "The MSD Minor Thesis requires two consecutive semesters of enrolment. Students can commence the Minor Thesis (ABPL90396 MSD Minor Thesis Part 1) either in Semester 1 or 2 and must continue (ABPL90397 MSD Minor Thesis part 2) in the following semester. Upon successful completion of Minor Thesis (both part 1 and 2), students will receive 25 points credit.",
                    "Multidisciplinary electives",
                    "Students may choose any masters-level subjects including:",
                    [
                        "Melbourne School of Design graduate subjects starting with ABPL90XXX, ARCH90XXX, LARC90XXX, PLAN90XXX; and CONS90XXX; provided prerequisites are met",
                        "Any University of Melbourne graduate subject provided prerequisites are met and written approval from the home faculty plus the Master of Urban Planning course coordinator is submitted to Stop 1 via an Enrolment Variation form:",
                        "https://students.unimelb.edu.au/your-course/manage-your-course/course-enrolment/enrolment-variation"
                    ],
                    "Note:",
                    "Master of Urban Planning (MUP) students may apply to use points arising from a Melbourne School of Design Travelling Studio towards either the multidisciplinary elective, specialisation elective (with program coordinator approval) components of the course:",
                    "https://msd.unimelb.edu.au/current-students/subject-information/travelling-studios",
                    "Specialisation elective subjects",
                    "The required 'specialisation electives' can be made up from any the subjects on the following list. These subjects are listed by themes which reflect research and teaching interests within the Urban Planning Program. It is not necessary to limit choice to any one theme: specialisation electives can be taken in any combination.",
                    "In each theme, some electives are taught directly by staff from the UP Program, others are delivered by other programs or faculties, and have been chosen because they are known to offer content directly relevant to planning.",
                    "Students may also take other graduate level subjects from the Melbourne School of Design or other faculties as specialisation electives, with written approval from the home faculty and the MUP Program Coordinator.",
                    "Environment",
                    [
                        "ABPL90341",
                        "ABPL90320",
                        "EVSC90015",
                        "ABPL90283",
                        "HORT90039",
                        "FOOD90041",
                        "ABPL90405",
                        "ABPL90404"
                    ],
                    "Social Planning",
                    [
                        "ABPL90280",
                        "ABPL90322",
                        "ABPL90321",
                        "ABPL90441",
                        "ABPL90266",
                        "ABPL90022",
                        "ABPL90377",
                        "ENST90002",
                        "SOCI90011"
                    ],
                    "International Development and Planning",
                    [
                        "ABPL90065",
                        "ABPL90279",
                        "ABPL90055",
                        "PLAN90003",
                        "PLAN90002"
                    ],
                    "Transport",
                    [
                        "ABPL90077",
                        "ABPL90090",
                        "CVEN90048",
                        "ABPL90056",
                        "CVEN90061"
                    ],
                    "Analytic Methods",
                    [
                        "ABPL90319",
                        "ABPL90366",
                        "ABPL90017",
                        "PLAN90001",
                        "NRMT90003",
                        "ABPL90407",
                        "ABPL90408"
                    ],
                    "Property",
                    [
                        "ABPL90281",
                        "ABPL90040",
                        "ABPL90339",
                        "ABPL90026",
                        "ABPL90406",
                        "ABPL90409"
                    ],
                    "Bushfire Planning",
                    [
                        "EVSC90022",
                        "EVSC90023",
                        "ABPL90320",
                        "FRST90025",
                        "FRST90017"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students must complete eABPL90396 MSD Minor Thesis Part 1 + ABPL90397 MSD Minor Thesis Part 2  comprise the degree's capstone experience and provide students with the necessary preparation for professional work and/or doctoral study."
    ]
}