{
    "Course name": "Master of Contemporary Art",
    "Course code": "MC-CTPYART",
    "Overview text": [
        "The Master of Contemporary Art is a two-year, full-time postgraduate professional degree that serves as a bridge between undergraduate study and independent art practice, as a \"refresher\" program for artists who have been away from formal study, or as an entry point to further tertiary education for artists who lack formal qualifications but have significant professional experience, including those of recognised ability who have been unable to undertake or complete an Honours year.",
        "Tuition is conducted through a seminar programme and individual tutorials. Each student is assigned an Academic Advisor who is responsible for the oversight of the student's progress. The studio practice/project component is primarily conducted through individual tutorials and group tutorials/seminars. Students are encouraged to employ speculation and technical experimentation as learning strategies.",
        "Individual tutorials provide the opportunity for one-to-one critical discussion with their advisor and other staff regarding the formal, conceptual, personal and expressive bases of the student's work and its realisation.",
        "The group tutorials/seminars are designed to generate critical discussion and debate on a more formal level with the student's peers, providing an initial forum for the analysis of the work and consideration of a range of issues surrounding contemporary art practice.",
        "Students in consultation with their academic advisor prepare an individual study proposal appropriate to their studio practice. The program should provide a conceptual framework for development and incorporate a study plan for acquisition of necessary skills.",
        "The capstone experience to the course is a year-long studio project in second year, culminating in a public presentation in the School of Art Masters Exhibition at the end of the year.",
        "The Graduate Diplomain Contemporary Artis an Exit Award for the MC-CTPYART Master of Contemporary Art and does not have a direct intake or enrolments. Students are admitted to the Master of Contemporary Art. Students who are unable or who choose not to continue with their studies in MC-CTPYART Master of Contemporary Art may decide to exit the course with the award Graduate Diploma of Contemporary Art.",
        "Last updated: 21 June 2024"
    ],
    "Overview table": {
        "Award title": "Master of Contemporary Art",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "075494G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a bachelor degree or equivalent in a non-cognate area, or",
            "six years of documented relevant professional work experience; AND ",
            "a written proposal; and",
            "a portfolio; and",
            "an interview (shortlisted applicants only)",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic achievement; or",
            "documented relevant work experience; AND",
            "the written proposal; and",
            "the portfolio; and",
            "performance in an interview (shortlisted applicants only).",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the University’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required.",
            "Notes:",
            "Details for the written proposal, portfolio and interview (shortlisted applicants only) can be found on the Fine Arts and Music Study website https://finearts-music.unimelb.edu.au/study-with-us\n",
            "Students who discontinue from the Master of Contemporary Art but have successfully completed the requirements of the Graduate Diploma in Contemporary Art will be eligible to apply to receive the GD-CTPYART Graduate Diploma in Contemporary Art as an exit award.",
            "Successful applicants from the University of Melbourne 842AA Graduate Certificate in Visual Art may be granted up to 100 points of advanced standing."
        ],
        "Inherent requirements (core participation requirements)": [
            "Communication Skills:Students must be able to participate in and produce performances and exhibitions as required; they will also need to communicate effectively and efficiently in oral and written forms. Communication with fellow students, professional and academic staff, and the wider public about their knowledge and application of practising Arts disciplines is essential.Creative, Intellectual and Organisational Abilities:Students require the capacity for high-level creative performance or production. They are also expected to have the ability to develop problem-solving skills and to comprehend disciplinary and cross-disciplinary information. Students must have the ability to establish study plans and prioritise training objectives and outcomes.Behavioural and Social Attributes:Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. They must take full responsibility for their own participation and learning. Students also contribute to the learning of other students in collaborative environments and must therefore demonstrate a wide range of interpersonal skills which consider the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.Students who have a disability which may prevent them from participating in tasks involving these inherent academic requirements are encouraged to contact Student Equity and Disability Services:https://students.unimelb.edu.au/student-support/student-equity-and-disability-support"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "200-point program of compulsory subjects",
                "Qualification for the award requires completion of all subjects listed below."
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "FINA70006",
                    "FINA90006",
                    "FINA70008",
                    "FINA70009",
                    "FINA90007",
                    "FINA70011",
                    "FINA90008",
                    "FINA90009"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}