{
    "Course name": "Master of Music (Research)",
    "Course code": "MR-MUSRES",
    "Overview text": [
        "The Master of Music by research is a graduate research degree designed for students to develop their potential for research, contribute to understandings of contemporary practice and theory, and, where relevant, develop mastery in their field of practice.",
        "Completion of the Master of Music (Research) signifies that the holder has undertaken a substantial piece of original research, which has been conducted and reported by the holder under proper academic supervision and in a research environment for a prescribed period.",
        "The duration of Master of Music (Research) candidature is one and a half years for full-time candidates, one six month extension is allowed.",
        "Except in the disciplines of Music Psychology, Music Therapy and Musicology/Ethnomusicology; candidates may submit a folio of compositions or a combination of performance folio and related written project.",
        "The Master of Music (Research) is offered in the following discipline areas:",
        "See course structure for submission requirements by discipline."
    ],
    "Overview table": {
        "Award title": "Master of Music (Research)",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "099325E",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "9",
        "Duration": "2 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a Bachelor of Music (Honours) degree, or equivalent, with at least an H2A (75%) weighted average;",
            "And for:",
            "Composition: a satisfactory composition folio;",
            "Interactive Composition: a satisfactory interactive composition folio.",
            "Music Performance (including conducting); and Jazz & Improvisation: a satisfactory audition;",
            "Musicology/Ethnomusicology; Music Psychology; Music Therapy and Music Performance: a satisfactory example of scholarly writing.",
            "And:",
            "A research proposal: see https://study.unimelb.edu.au/find/courses/graduate/master-of-music-research/entry-requirements/ for details specific to your discipline.",
            "Exceptional applicants, with substantial professional experience and who have completed an undergraduate qualification in a relevant field, can be considered for entry into Master of Music (Research) in the disciplines of Interactive Composition, Jazz & Improvisation and Ethnomusicology without meeting the requirement of completion of an honours degree or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the selection committee will consider:",
            "prior academic performance; and",
            "the research proposal; and",
            "the composition folio, audition, and/or piece of scholarly writing.",
            "the ability of the Faculty to provide the appropriate supervision, facilities and resources for your intended project",
            "3. The selection committee may seek further information to clarify any aspect of an application in accordance with the Selection and Admission into Graduate Research Courses Policy.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance Band 6.5 is required.",
            "For more information on the application process and details of folio, audition, scholarly writing sample and research proposal requirements visit theStudy Hub."
        ],
        "Inherent requirements (core participation requirements)": [
            "Creative, Intellectual and Organisational Abilities:Students are expected to have the ability to develop problem-solving skills and to comprehend disciplinary and crossdisciplinary information. Students must have the ability to establish study plans and prioritise objectives and outcomes.",
            "Behavioural and Social Attributes:Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. They must take full responsibility for their own participation and learning. Students also contribute to the learning of other students in collaborative environments and must therefore demonstrate a wide range of interpersonal skills which consider the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Disability:For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "A candidate will have appropriately experienced supervisors and an Advisory Committee who, in consultation with the candidate, arranges a course of supervised research designed to suit the individual requirements and interests of the candidate."
            ]
        },
        "Coursework Component": {
            "overview": [
                "Candidates who do not have the appropriate research methodology background may be required to take the following Research Methodology subject in the first semester of their candidature:",
                [
                    "MUSI90191"
                ],
                "Students are expected to participate in seminars and intensive research weekends where relevant over the period of their candidature.",
                "Candidates in the discipline of Music Performance are required to complete the following subject in their first semester of enrolment:",
                [
                    "MUSI90191"
                ],
                "Candidates in the discipline of Jazz & Improvisation are required to complete the following subject in their first semester of enrolment:",
                [
                    "CREA90001"
                ],
                "Candidates in the disciplines of Composition and Interactive Composition may be required to complete the following subject in their first semester of enrolment:",
                [
                    "CREA90001"
                ],
                "Candidates in the discipline of Music Psychology are required to complete the following subject in their first semester of enrolment:",
                [
                    "MUSI90252"
                ]
            ]
        },
        "Thesis and/or Folio Submission": {
            "overview": [
                [
                    "MUSI70021"
                ]
            ],
            "Composition": {
                "overview": [
                    "Candidates complete:",
                    [
                        "1. A folio of works totaling 45–60 minutes in duration (75%), including a live or studio recording of at least one folio work.",
                        "2. An accompanying dissertation of approximately 10,000 words on a topic clearly related to the folio works, including at least 1 analysis of a work from the folio (25%)."
                    ],
                    "The folio and dissertation are to be considered as a mutually reinforcing project, which taken together comprise the overall thesis.",
                    "Candidates also participate in regular seminars and are required to attend Composition Seminar."
                ]
            },
            "Interactive Composition": {
                "overview": [
                    "Candidates complete:",
                    [
                        "1. A folio comprising 45 to 60 minutes of music and sound-based creative work with other media (75%). The music and sound based creative work may take the form of collaborative and/or commercially led music and sound in interaction with other media such as film, animation, visual art and installation, text, design, performance, theatre, dance, multimedia, gaming platforms, online media or other new media technologies and modes of presentation. The creative work must be comprehensively audio-visually documented.",
                        "2. An accompanying dissertation of approximately 10,000 words on a topic clearly related to the folio works (25%)."
                    ],
                    "The folio and dissertation are to be considered as a mutually reinforcing project, which taken together comprise the overall thesis.",
                    "Candidates also participate in regular seminars."
                ]
            },
            "Jazz & Improvisation": {
                "overview": [
                    "Through a course of independent research, students will complete a thesis equivalent to 40,000 words. The thesis will consist of live performance and related written project that together investigate issues and questions that are core to contemporary music making.",
                    "Candidates also participate in regular seminars."
                ]
            },
            "Music Performance": {
                "overview": [
                    "Candidates undertake a supervised project that leads to a live, public performance of 60 to 70 minutes of approved repertoire supported by an integrated written work of between 8,000 and 10,000 words. The public performance component is recorded (live) for assessment, and may be presented as a single recital with interval, or as two shorter recitals, subject to the approval of the Supervisor and the Advisory Committee Chair. The written work and the recorded live performance component are sent together to two external examiners for assessment.",
                    "Candidates also participate in Performance Class and Seminars and are required to present one lecture-recital during their candidature."
                ]
            },
            "Music Psychology": {
                "overview": [
                    "Candidates undertake a significant research project and prepare a thesis of approximately 30,000 - 40,000 words.",
                    "Candidates also participate in regular seminars."
                ]
            },
            "Music Therapy": {
                "overview": [
                    "Candidates undertake a significant research project and prepare a thesis of approximately 30,000 - 40,000 words.",
                    "Candidates also participate in regular seminars, as well as biannual intensive research weekends with international scholars who provide additional feedback on projects.",
                    "Research in Music Therapy is significantly supported and promoted by theCreative Arts and Music Therapy Research Unit."
                ]
            },
            "Musicology/Ethnomusicology": {
                "overview": [
                    "Musicology and Ethnomusicology candidates undertake a research project and prepare a thesis which may be presented as:",
                    [
                        "1. A study of approximately 30,000 - 40,000 words embodying the results of significant research; or",
                        "2. A transcription and edition of a substantial body of music together with a critical study of between 10,000-20,000 words on the music edited; or",
                        "3. A minor thesis of 20,000 to 25,000 words and 3 elective subjects."
                    ],
                    "Candidates also participate in regular seminars.",
                    "For more information on seminar requirements for each discipline please refer to course specific information on our website:https://finearts-music.unimelb.edu.au/current-students/research-students"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "At the successful completion of this degree students will be eligible to apply for PhD studies."
    ]
}