{
    "Course name": "Master of Social Work",
    "Course code": "MC-SOCW",
    "Overview text": [
        "The Master of Social Work offers you an outstanding graduate course of study, preparing you for professional practice in a diverse range of social work contexts. The course provides you with a nationally and internationally benchmarked course of study in the theory and practice of social work. On completion you will be eligible to apply for membership of the Australian Association of Social Workers (AASW).",
        "This is an AASW-accredited qualification. It is an entry qualification into the social work profession and has been determined to meet the Australian Social Work Education and Accreditation Standards (ASWEAS)."
    ],
    "Overview table": {
        "Award title": "Master of Social Work",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "061212E",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "225 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must:",
            "Have completed an undergraduate degree with at least one year of full-time studies in social sciences or equivalent, with studies to have been completed within 10 years of commencing the Master of Social Work, \n",
            "or",
            "Have completed an older undergraduate degree and more recent graduate study that demonstrates current capacity for graduate study, \n",
            "and",
            "Provide a current curriculum vitae (CV), that details education, workplace experience and other relevant skills and training, \n",
            "and",
            "Provide contact details of a professional referee.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Work experience and other training completed as detailed in the CV",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4.  Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7+ is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Students must comply with Fitness to Practice Rules, which are accessible fromSchedule 1of theStudent Fitness to Practice Policy (MPF1345).",
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Course and Subject Descriptions, Course and Subject Objectives, Generic Skills and Assessment Requirements of this entry. The University is dedicated to provide support to those with special requirements. Further details on the disability support scheme can be found at the Student Equity and Disability Support (SEDS) website:http://www.services.unimelb.edu.au/disability/",
            "It is a requirement of the course that students will be expected to interact in all aspects of learning with their peers and educators in classroom settings and clients (individuals, families, groups and communities) in practice settings.",
            "All students in the Master of Social Work (MSW) course must possess the intellectual, ethical, social and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence at graduation required by the Melbourne School of Health Sciences, Department of Social Work (and as accredited in the curriculum by the Australian Association of Social Workers, AASW, and in accordance with the AASW Practice Standards).  Social Work education (and practice) is bound by the Australian Association of Social Workers Education Accreditation Standards defined by the AASW. It is recommended that students read and understand these Standards: (https://www.aasw.asn.au/document/item/3550) and their responsibilities as a student social worker as specified in the Code of Ethics (http://www.aasw.asn.au/practitioner-resources/related-documents).",
            "A student with a disability may be asked to provide independent medical or other clinical assessments of the disability and its possible impact on the ability of the student to successfully complete the course, before being accepted into the course. This statement would be treated in confidence with only those on the admissions committee and SEDS having access to the document. Deliberate misinformation about the student’s ability to successfully complete the course will be regarded as unprofessional practice and treated as such.",
            "While the Department of Social Work will make reasonable adjustments to minimise the impact of a disability, all students must be able to participate in the program in an independent manner. It is expected that all students will be able to participate fully in all classroom-based and online learning activities, and to successfully fulfil the field education requirements of the course.",
            "A student enrolled in the MSW must have abilities and skills (observational and applied) to participate in the course in the following areas, consistent with the AASW Practice Standards:",
            "Values and ethics:In all learning contexts, students must ‘uphold their ethical responsibilities’ and ‘act appropriately when faced with ethical problems, issues and dilemmas’ (AASW Practice Standards). The student must be able to demonstrate professional integrity and respect, in the context of culturally responsive and inclusive practice.",
            "Communication:In all learning contexts, the student must be able to communicate effectively, sensitively and respectfully with others, in written and verbal forms. This includes being able to clearly communicate knowledge and the application and practices of the subject.",
            "Intellectual, conceptual, and integrative abilities:The student is expected to have the ability to develop problem-solving skills and demonstrate this ability in all learning contexts. These abilities include reasoning, analysis, reflection and synthesis.",
            "Behavioural and social attributes:The student must possess the emotional and mental health required for full utilisation of his/her intellectual abilities, the exercise of good judgement, and the timely completion of all required tasks and the development of mature, sensitive, and effective relationships with clients and colleagues.",
            "The University of Melbourne welcomes applications from students with disabilities. It is University policy to take reasonable and proportionate measures to minimise the impact of a disability on academic study."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "This is an Australian Association of Social Workers (AASW)-accredited qulaification. It is an entry qualification into the social work profession and has been determined to meet the Australian Social Work Education and Accreditation Standards (ASWEAS)."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "225-point program:",
                [
                    "18 compulsory subjects (212.5 points)",
                    "Elective subjects (12.5 points)"
                ],
                "In order for students to undertake Supervised Field Placement 1A and 1B (SCWK90048/49) they must complete SCWK90053 Counselling and Interviewing Skills, SCWK90066 Social Work Theory and Practice, and SCWK90072 Professional Identity 1."
            ]
        },
        "First Year": {
            "overview": [
                [
                    "SCWK90072",
                    "SCWK90064",
                    "SCWK90053",
                    "SCWK90066",
                    "SCWK90069",
                    "SCWK90054",
                    "SCWK90055",
                    "SCWK90063",
                    "SCWK90048",
                    "SCWK90049"
                ]
            ]
        },
        "Second Year": {
            "overview": [
                "The following subjects, plus an elective subject (12.5 credit points)",
                [
                    "SCWK90073",
                    "SCWK90057",
                    "SCWK90058",
                    "SCWK90059",
                    "SCWK90065",
                    "SCWK90056",
                    "SCWK90050",
                    "SCWK90051"
                ]
            ]
        },
        "Second Year Elective Subjects": {
            "overview": [
                [
                    "POPH90267",
                    "SCWK90039",
                    "SCWK90038",
                    "SCWK90027",
                    "GEND90015",
                    "HLTH90018",
                    "HLTH90007",
                    "HLTH90008",
                    "HTLH90009",
                    "HLTH90003"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of other graduate programs including the Master of Advanced Social Work (Research), Master of Philosophy or the Doctor of Philosophy."
    ]
}