{
    "Course name": "Master of Commerce (Economics)",
    "Course code": "MC-COMECO",
    "Overview text": [
        "The Master of Commerce (Economics) represents years 1 and 2 of the 5-year doctoral program in Economics and is only available to students pursuing the doctoral program.",
        "Last updated: 24 July 2024"
    ],
    "Overview table": {
        "Award title": "Master of Commerce (Economics)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "096133D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a four-year undergraduate or a postgraduate degree with a strong analytical or mathematical component and with a weighted average mark of at least H2A (75%); or",
            "a qualification and professional experience considered to be equivalent;and submit:",
            "a personal statement outlining why they wish to be considered for the course (maximum of 1,000 words); and",
            "the Graduate Record Examination (GRE), unless the applicant has completed an undergraduate degree in Australia or New Zealand or met one of the approved conditions for GRE exemption; and",
            "referee reports (except for applicants who have graduated from the University of Melbourne within the last 5 years).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applicants, the selection committee will consider:",
            "prior academic performance; and",
            "the results of a Graduate Management Admission Test (GMAT) or a Graduate Record Examinations (GRE) test completed within the last 5 years. No minimum GMAT or GRE score is required. The average score of successful applicants is around 680-700 (GMAT) and 324 (GRE). The following applicants for this course are exempt from submitting a GMAT or GRE test:\n\nThose who have completed an undergraduate degree in Australia or New Zealand within the 18 months prior to the date of application; or\nThose who face significant humanitarian issues;\n\n",
            "Those who have completed an undergraduate degree in Australia or New Zealand within the 18 months prior to the date of application; or",
            "Those who face significant humanitarian issues;",
            "performance in an interview during which the applicant’s level of understanding, motivation and time commitment will be assessed; and",
            "relevant prior research and/or professional experience; and",
            "referee reports; and",
            "the personal statement.",
            "Those who have completed an undergraduate degree in Australia or New Zealand within the 18 months prior to the date of application; or",
            "Those who face significant humanitarian issues;",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required.",
            "Notes:To meet the analytical or mathematical prerequisite requirements, applicants with an economics background will normally be required to have a major in economics including calculus-based economics subjects plus an econometrics subject, equivalent to at least ECOM30002 Econometrics, with a weighted average mark of at least H2A (75%) across the major.",
            "Applicants from a non-economics background require an undergraduate major of a mathematical/analytical nature including calculus, linear algebra and statistics subjects with a weighted average mark of at least H2A (75%) and will also be required to have completed microeconomics and macroeconomics subjects at least at the second year level.Applicants with a relevant two year postgraduate degree in economics with a weighted average mark of at least H2A (75%), who have completed subjects which satisfy the prerequisites for both the core and quantitative second year subjects in the Master of Commerce (Economics) may be awarded up to 100 points of credit into the Master of Commerce (Economics)."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students can only commence this program in Semester 1 of any year.",
                "This course requires the completion of 137.5 points of compulsory subjects and 62.5 points of electives.",
                "Progression from Year 1 to Year 2 of the Master of Commerce (Economics):",
                [
                    "An average of no less than 75% overall in the subjects taken during Year 1."
                ],
                "Students who discontinue from the Master of Commerce (Economics) after Year 1 but have successfully completed the requirements of the Graduate Diploma in Commerce (Economics) will be eligible to receive the Graduate Diploma in Commerce (Economics) as an exit award.",
                "Progression from Year 2 of the Master of Commerce (Economics) to the Doctor of Philosophy (Business and Economics):",
                [
                    "An average of no less than 80% overall in the subjects taken in Year 2; and",
                    "A Pass grade in ECON90073 Economics Thesis Workshop Part 1 and ECON90074 Economics Thesis Workshop Part 2"
                ]
            ],
            "": {
                "overview": []
            }
        },
        "Subject options": {
            "overview": [],
            "Year 1": {
                "overview": [
                    "The first year of the Master of Commerce (Economics) consists of two core economics subjects and an econometrics subject in each semester. The first semester also includes a core maths subject and the second semester includes a core economic history subject.",
                    "Core subjects:",
                    [
                        "ECON90002",
                        "ECON90003",
                        "ECOM90005",
                        "ECON90012",
                        "ECON90014",
                        "ECOM90014",
                        "ECON90053",
                        "ECON90056"
                    ]
                ]
            },
            "Year 2": {
                "overview": [
                    "Students must complete two core subjects and six electives in Year 2.",
                    "Core subjects:",
                    [
                        "ECON90073",
                        "ECON90074"
                    ],
                    "Students must complete six elective subjects (three electives in semester 1 and three electives in semester 2) from the following list:",
                    [
                        "ECON90064",
                        "ECON90065",
                        "ECOM90018",
                        "ECOM90019",
                        "ECON90067",
                        "ECON90052",
                        "ECON90054",
                        "ECON90055",
                        "ECOM90015",
                        "ECON90004",
                        "ECOM90006"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}