{
    "Course name": "Master of Commerce (Decision, Risk and Financial Sciences)",
    "Course code": "MC-COMDRFS",
    "Overview text": [
        "The Master of Commerce (Decision, Risk and Financial Sciences) represents years 1 and 2 of the 5-year doctoral program in Decision, Risk and Financial Sciences and is only available to students pursuing the doctoral program.",
        "The course is a two-year interdisciplinary program in advanced studies in decision, risk and financial sciences. It provides training in the conceptual principles and research techniques in fields across the social, biological and mathematical sciences that analyse human decision-making and problem solving in the context of risk and complexity at the level of individuals and markets.",
        "Last updated: 4 April 2024"
    ],
    "Overview table": {
        "Award title": "Master of Commerce (Decision, Risk and Financial Sciences)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "092761G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. To be considered for entry, applicants must have completed:",
            "A four-year undergraduate degree in finance, economics, mathematics, psychology, biology, computer science, physics, or engineering, or equivalent, a University of Melbourne equivalent weighted average mark of least 75% (H2A) or equivalent; or",
            "a qualification and/or professional experience considered to be equivalent;",
            "and submit:",
            "a personal statement outlining why they wish to be considered for the course (maximum of 1,000 words); and",
            "a Graduate Management Admission Test (GMAT) or Graduate Record Examination (GRE) test, unless the applicant has met one of the Faculty’s doctoral-level conditions for GMAT/GRE exemption; andacademic referee reports (except for applicants who have graduated from the University of Melbourne within the last 5 years).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applicants, the selection committee will consider:",
            "prior academic performance; and",
            "the results of a Graduate Management Admission Test (GMAT) or Graduate Record Examinations (GRE) test completed within the last 5 years. No minimum GMAT or GRE score is required. The average score of successful applicants is around 680-700 (GMAT) and 324 (GRE).**The following applicants for this course are exempt from submitting a GMAT or GRE test: ◦Those who have completed an undergraduate degree in Australia or New Zealand within the 18 months prior to the date of application; or◦Those who face significant humanitarian issues;",
            "performance in an interview during which the applicant’s level of understanding, motivation and time commitment will be assessed; and",
            "relevant prior research and/or professional experience; and",
            "referee reports; and",
            "the personal statement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Commerce (Decision, Risk and Financial Sciences) consists of 16 subjects:",
                [
                    "6 core subjects (75 points)",
                    "3 additional subjects from a related discipline (37.5 points)",
                    "3 elective subjects (37.5 points)",
                    "2 lab rotations (25 points)",
                    "2-part research report (25 points)"
                ],
                "Year 1",
                "During the first year of the course students complete 6 core subjects and 2 additional subjects from a related discipline (one of the disciplines covered by the core subjects or other discipline relevant to decision‐making research). The two additional subjects must be approved by the program director.",
                "Year 2",
                "In the final year of the course students complete 1 additional subject from a related discipline (one of the disciplines covered by the core subjects in Year 1 or other discipline relevant to decision‐making research, 3 electives, 2 lab rotations subjects and the research report, that must be completed over two consecutive semesters of study. The additional subject and electives must be approved by the program director.",
                "Progression from Year 2 of the Master of Commerce (Decision, Risk and Financial Sciences) to the Doctor of Philosophy (Business and Economics) requires:",
                [
                    "An average of no less than 75% overall for the course overall; and",
                    "an average of no less than 80% in FNCE90071 DRFS Research Report Part 1 and FNCE90072 DRFS Research Report Part 2."
                ]
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "FNCE90070",
                    "COMP90049",
                    "ECON90002",
                    "PSYC90097",
                    "COMP90051",
                    "ECOM90002"
                ],
                "andThree additional subjects from a related discipline such as Mathematics, Statistics, Neuroscience, etc. that must be approved by the Program Director.",
                "Elective SubjectsThree elective subjects that must be approved by the Program Director.",
                [
                    "FNCE90073",
                    "FNCE90074"
                ],
                [
                    "FNCE90071",
                    "FNCE90072"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}