{
    "Course name": "Master of Architecture/Master of Urban Design",
    "Course code": "MC-ARCHUD",
    "Overview text": [
        "The Master of Architecture/Master of Urban Design is a double degree, that will allow students to complete two professional graduate programs in a reduced timeframe.",
        "Architecture is a creative and exciting design-based profession concerned with virtually all aspects of the built environment. It combines art, science and technology with business, social and environmental concerns. The Master of Architecture is a professional program which prepares graduates for employment as architects. The ethos of the program emphasises the central role of design in the studio. Students can take a research subject which may enable progression to further studies as a PhD candidate.",
        "With over thirty full-time academics and a broad range of leading architectural practitioners, the program has a depth and breadth of teaching and research performance unmatched within the Southeast-Asian and Australasian regions. Graduates will be equipped with the creative and critical thinking skills to push the envelope of architectural change in terms of the design and production of buildings as well as critique of their technical, aesthetic, social and environmental performance.",
        "The Master of Urban Design at the Melbourne School of Design develops professionals who are capable of seeing the city from multiple viewpoints and who relish working with interdisciplinary teams.  The strengths of this course are the people it involves and the atmosphere they create. People who make urban design at the Melbourne School of Design what it is, are the staff and students. Our core group of staff brings together experience and active involvement in current urban design research, design research and education. A broader teaching team with expertise in landscape architecture and urban planning adds diversity and richness. Urban design students contribute their own experiences, energy, new themes and aspirations and add to a multicultural complexity that make our courses special.",
        "The Master of Urban Design encourages interaction and an appreciation of creativity and difference, which creates an atmosphere of collegiality and common endeavour.",
        "Please note:depending on your background, you may be eligible to receive up to 1 year of credit",
        "Last updated: 6 September 2024"
    ],
    "Overview table": {
        "Award titles": "Master of ArchitectureMaster of Urban Design",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "105515M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "400 credit points",
        "Duration": "48 months full-time or 96 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in a cognate discipline with a weighted average mark of at least H3 (65%), or equivalent; and",
            "a design portfolio in a format as specified by the Selection Committee; and",
            "at least one design studio subject and one art/architecture/built environment/design history subject at undergraduate level, or equivalent; and",
            "a personal statement outlining relevant prior study and work experience, and motivation to undertake the course.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the personal statement; and",
            "the design portfolio.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note.Applicants with the following may be awarded up to 100 points of credit:",
            "an undergraduate degree with a major in architecture, architectural studies with a weighted average mark of at least H3 (65%), or equivalent.",
            "Graduate Degree Packages for School Leavers",
            "The University of Melbourne offers Graduate Degree Packages to high achieving school leavers, allowing them to secure places (Commonwealth Supported places for domestic students or International fee places) in the Master of Architecture/Master of Urban Design  provided that they meet certain requirements.",
            "For a Commonwealth Supported Place or an International Fee Place, the applicant must:",
            "complete an Australian Year 12 or the International Baccalaureate (IB) in 2018 or later either:",
            "— in Australia; or— outside Australia and be an Australian citizen;",
            "achieve an ATAR (or notional ATAR) of at least 98.00;",
            "apply for a University of Melbourne Articulated Degree Pathway for commencement in the year following completion of Year 12 or IB via VTAC;",
            "enrol immediately or be granted deferral in the year following Year 12;",
            "successfully complete a Bachelor of Design (majoring in Architecture) at the University of Melbourne including all the specified prerequisite subjects;",
            "achieve a minimum weighted average mark of H3 (65%) in their undergraduate degree; and",
            "commence the Master of Architecture/Master of Urban Design within 18 months of completing the undergraduate degree.",
            "Applicants eligible for entry via the Graduate Degree packages will not be required to complete a portfolio or personal statement as part of their application.",
            "Applicants should refer to the University handbook for the additional entry requirements for the Bachelor of Design.",
            "Additional notes:",
            "(a) Portfolio format for applicants not eligible for credit allowed under the Resolution on Selection.",
            "The design portfolio is assessed digitally and must be saved as one PDF file in landscape format. The file size of the portfolio should not exceed 10 MB, and the number of pages should not exceed 15 pages. Note that as portfolios are evaluated digitally images should be reproduced at a sufficient scale and resolution to be easily readable with limited zooming or scrolling. The Selection Committee will look for evidence that the applicant has worked successfully in a studio learning environment. Any of the range of pedagogical approaches to the teaching of introductory design is appropriate, although the Selection Committee will be particularly interested in the exploration of 3D form and space, and evidence of other creative work",
            "(b) Portfolio format for applicants who are eligible for credit allowed under the Resolution on Selection.",
            "The design portfolio is assessed digitally and must be saved as one PDF file in landscape format. The file size of the portfolio should not exceed 10 MB, and the number of pages should not exceed 15 pages. Note that as portfolios are evaluated digitally images should be reproduced at a sufficient scale and resolution to be easily readable with limited zooming or scrolling. Elaborate formats that reduce the available page space for the design images should be avoided. The design portfolio should focus on design work rather than, for example, life or still-life drawing skills. Portfolios should be drawn largely from the design studio subjects the applicant has completed. Applicants submitting work done in the context of employment should explain their role in the work produced with brief notes. It would be helpful to see a variety of techniques of drawings and images: free hand diagrams, computer images, two-dimensional (plans, sections, elevations) and three-dimensional studies, photographs of physical models.",
            "It is highly recommended that students obtain at least 16 weeks of documented relevant full-time professional work experience, before commencing the final 100 points of the degree.",
            "Guaranteed Transfer into Commonwealth Supported Place",
            "Students with a fee place in this course who complete 100 points of the course with a weighted average mark of at least H2A (75%) and who are eligible for a Commonwealth Supported Place will be guaranteed a transfer to a Commonwealth Supported Place for the remainder of the course."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne School of Design is the graduate school of the Faculty of Architecture, Building and Planning. It offers professional entry programs in Architecture, Construction Management, Landscape Architecture, Property and Urban Planning. It offers specialist development programs in Property Valuation, Planning and Design and in Urban Design.",
            "The Melbourne School of Design welcomes applications from students with disabilities. It is the University and Faculty (Architecture, Building and Planning) policy to take reasonable steps to make reasonable adjustments so as to enable students’ participation in degrees offered by the Melbourne School of Design (MSD).",
            "A candidate for degrees offered in the MSD must have abilities and skills which include the following: observation; communication; motor; conceptual, integrative, and quantitative; and behavioural and social. Adjustments can be provided to minimise the impact of a disability, however, particularly at Masters level, students need to be able to participate in programs in an independent manner and with regard to their safety and the safety of others.",
            "(i) Observation: Candidates must be able to read text, diagrams, maps, drawings and numerical data. Candidates should be able to observe details at a number of scales and to record useful observations of environmental contexts.",
            "(ii) Communication: Candidates should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. Candidates must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing, presenting one's own work in front of a large group, receiving and responding to feedback about one's own work in a public setting. Assessment in studio subjects will involve 'crits' where students present their own work in front of a large group, where they will receive and respond to feedback about their work in a public setting. Crits are an integral part of working in the industry and are an inherent requirement of the course. The requirement to undertake public crits cannot be waived.",
            "(iii) Motor: Candidates should have sufficient motor function to elicit information from environmental contexts. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments. Candidates should have sufficient motor ability to prepare documentation of analytic texts, drawings and models of findings and for the reparation of proposals for environmental interventions via digital or other means. Candidates should have the ability to actively participate in appropriate site and/or design studio-based activities.",
            "(iv) Intellectual-Conceptual, Integrative and Quantitative Abilities: These abilities include measurement, calculation, reasoning, analysis, synthesis and, importantly, the ability to interpret results of such work. Problem resolution, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, given the disciplines pursued in the SD, candidates should be able to comprehend three-dimensional relationships and to understand the spatial relationships in environmental structures of a wide range of scales – from smaller than the individual through individual buildings and urban spaces to large geographic areas. Further, graduate study entails learning to master one’s own abilities and skills and to deploy them strategically. This requires further developing skills in both reflective and reflexive thinking and being able to practice these skills.",
            "(v) Behavioural and Social Attributes: A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. Assessment in studio subjects will involve 'crits' where students present their own work in front of a large group, where they will receive and respond to feedback about their work in a public setting. Crits are an integral part of working in the industry and are an inherent requirement of the course. The requirement to undertake public crits cannot be waived.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Planning Institute of Australia",
            "This Master of Urban Design component of this program is a accredited with the Planning Institute of Australia (PIA)."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "400 Point Program:",
                "All students must complete:",
                [
                    "350 points core subjects in Architecture and Urban Design",
                    "50 points electives"
                ],
                "300 Point Program:",
                "All students must complete:",
                [
                    "250 Points core subjects in Architecture and Urban Design",
                    "50  points electives"
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "First-year core subjects (100 points)": {
            "overview": [
                "Students with an undergraduate major or degree in a non cognate area should complete the following subjects:",
                [
                    "ABPL90284",
                    "ABPL90285",
                    "ABPL90286",
                    "ABPL90287",
                    "ABPL90288",
                    "ABPL90289"
                ],
                "Students entering the Master of Architecture/Master of Urban Design from a cognate discipline will receive 100 points credit for the above subjects (300 point program starts from here)."
            ]
        },
        "Core subjects in Architecture and Urban Design (250 points)": {
            "overview": [],
            "": {
                "overview": [
                    [
                        "ABPL90061",
                        "ABPL90118",
                        "ABPL90017",
                        "ABPL90437",
                        "ABPL90117"
                    ],
                    [
                        "ABPL90130",
                        "ABPL90131",
                        "ABPL90140",
                        "ABPL90424"
                    ],
                    "AND",
                    [
                        "ABPL90273"
                    ],
                    [
                        "ABPL90438"
                    ],
                    "AND",
                    [
                        "ABPL90439"
                    ],
                    [
                        "ABPL90389"
                    ],
                    [
                        "ABPL90376",
                        "ABPL90246",
                        "ABPL90169"
                    ]
                ]
            }
        },
        "Elective Subjects (50 points)": {
            "overview": [
                [
                    "ABPL90020",
                    "ABPL90075",
                    "ABPL90089",
                    "ABPL90121",
                    "ABPL90123",
                    "ABPL90124",
                    "ABPL90149",
                    "ABPL90151",
                    "ABPL90153",
                    "ABPL90236",
                    "ABPL90272",
                    "ABPL90282",
                    "ABPL90304",
                    "ABPL90310",
                    "ABPL90321",
                    "ABPL90354",
                    "ABPL90355",
                    "ABPL90361",
                    "ABPL90367",
                    "ABPL90368",
                    "ABPL90369",
                    "ABPL90370",
                    "EDUC90728",
                    "EVSC90022",
                    "EVSC90023",
                    "ABPL90146",
                    "ABPL90316",
                    "ABPL90357",
                    "ABPL90268",
                    "ABPL90222",
                    "ABPL90388",
                    "ABPL90385",
                    "ABPL90086",
                    "ABPL90305",
                    "ABPL90377",
                    "ABPL90394",
                    "ABPL90386",
                    "ABPL90152",
                    "ABPL90371",
                    "ABPL90373",
                    "ABPL90241",
                    "FRST90025",
                    "ABPL90322",
                    "ABPL90336",
                    "ABPL90147",
                    "ABPL90403",
                    "ABPL90404",
                    "ABPL90405",
                    "ABPL90114",
                    "ABPL90412",
                    "ABPL90418",
                    "ABPL90419",
                    "ABPL90420",
                    "ABPL90421",
                    "ABPL90422",
                    "ABPL90085",
                    "ABPL90022",
                    "ABPL90040",
                    "ABPL90134",
                    "ABPL90281",
                    "ABPL90090",
                    "ABPL90315",
                    "ABPL90056",
                    "ABPL90064",
                    "ABPL90077",
                    "MULT90004",
                    "PLAN90002",
                    "PLAN90003"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of other graduate coursework programs and research higher degree programs, including the Doctor of Philosophy."
    ]
}