{
    "Course name": "Master of Digital Marketing",
    "Course code": "MC-DMKTG",
    "Overview text": [
        "The Master of Digital Marketing is designed to provide a leading-edge theoretical and practical foundation in the domain of Digital Marketing. It is aimed at students with a Bachelor of Commerce, or equivalent, with extensive previous marketing studies to specifically build their business and commercial skills and knowledge in the digital arena. The course aims to equip graduates for a career in this rapidly changing area through a specialised suite of advanced subjects including Customer Experience Design, Digital Marketing Metrics, Content Marketing, and Thought Leadership in Digital Marketing, combined with application through interaction with executives and the opportunity for internships. This program is academically rigorous, practically orientated and globally relevant."
    ],
    "Overview table": {
        "Award title": "Master of Digital Marketing",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "103161D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in marketing, or a business/commerce degree with a marketing major/specialisation; and",
            "a personal statement outlining why they wish to be considered for the course.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the personal statement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in marketing, or a business/commerce degree with a marketing major/specialisation including at least one 12.5 point quantitative analysis subject (see item 2 in notes section below). ",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance. ",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required (with no individual band less than 6.5).",
            "Notes:",
            "1. Applicants without a prior degree majoring in Marketing will be excluded from entry to this degree. Subject to meeting entry requirements, applicants are encouraged to apply for the Master of Management (Marketing). ",
            "2. To meet the prior study requirements relating to quantitative analysis, applicants must have completed at least one of the following 12.5 point University of Melbourne subjects or equivalents: Quantitative Methods 1 (ECON10005), Econometrics 1 (ECOM20001), Business Decision Analysis (MGMT20005), Statistics (MAST20005), Business Analytics (BUSA90493) or Data Analysis 1 (MAST10010)."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Digital Marketing requires the successful completion of 150 credit points."
            ],
            "To obtain the degree students must complete:": {
                "overview": [
                    [
                        "37.5 credit points of foundation compulsory subjects",
                        "50 credit points of compulsory subjects",
                        "12.5 credit points of compulsory capstone subject",
                        "50 credit points of optional subjects including:\nA minimum of 12.5 credit points of capstone selective subject\nA maximum of 37.5 credit points of elective subjects\n\n",
                        "A minimum of 12.5 credit points of capstone selective subject",
                        "A maximum of 37.5 credit points of elective subjects"
                    ],
                    [
                        "A minimum of 12.5 credit points of capstone selective subject",
                        "A maximum of 37.5 credit points of elective subjects"
                    ]
                ]
            },
            "Subject Options": {
                "overview": [
                    "Foundation compulsory subjects",
                    "Students must complete the following foundation compulsory subjects in their first semester or year of study:",
                    [
                        "MKTG90011",
                        "MKTG90041",
                        "MKTG90042"
                    ],
                    "Compulsory subjects",
                    [
                        "MKTG90043",
                        "MKTG90044",
                        "MKTG90045",
                        "MKTG90046"
                    ],
                    "Compulsory capstone subject",
                    "Students must complete the following compulsory capstone subject as their final subject:",
                    [
                        "MKTG90047"
                    ],
                    "Capstone selective subjects",
                    [
                        "BUSA90525",
                        "MKTG90009"
                    ],
                    "Elective subjects",
                    "Students must complete three elective subjects from the list, or electives approved by the Program Director.",
                    [
                        "MKTG90002",
                        "MKTG90006",
                        "MKTG90007",
                        "MKTG90009",
                        "MGMT90030",
                        "MKTG90033",
                        "MKTG90040",
                        "MKTG90048",
                        "MKTG90049",
                        "BUSA90529",
                        "IBUS90004",
                        "MGMT90037",
                        "MKTG90025"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}