{
    "Course name": "Master of Production Design",
    "Course code": "MC-PRODDES",
    "Overview text": [
        "The Master of Production Design is a professional coursework Masters program where students gain the skills, knowledge and experience necessary to work in the field of design for either stage or screen, including film, television, theatre and dance.",
        "This structured coursework program provides an enriched and comprehensive pathway into the profession encompassing formal classes, workshops and studio-based learning as well as placements on either film or stage productions mounted within Victorian College of the Arts (VCA). It also provides an optional pathway to further learning and Research Higher Degree (RHD).",
        "A core principle of the program is that collaboration is at the heart of design for both screen and stage. In developing this skill, students will be working and interacting with others involved in the making of work for either the stage or the screen.",
        "Last updated: 13 September 2024"
    ],
    "Overview table": {
        "Award title": "Master of Production Design",
        "Year & campus": "2024",
        "CRICOS code": "103430K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree or equivalent in a relevant discipline (such as the performing arts, design, and digital arts); or",
            "at least six years of documented professional practice in the creative arts industry; and",
            "a portfolio; and",
            "presentation of a response to a specific brief set out in the application process; and",
            "an interview.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and/or",
            "documented professional practice; and",
            "portfolio; and",
            "response to design brief; and",
            "interview.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university's English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "200-point program:",
                [
                    "Nine compulsory subjects (187.5 points)",
                    "One subject core to one of the following specialisations:\n\n",
                    [
                        [
                            "Stage (12.5 credit points); or",
                            "Screen (12.5 credit points)."
                        ]
                    ]
                ],
                "To progress from Year 1 to Year 2, students must complete all Year 1 subjects."
            ],
            "Year 1": {
                "overview": [
                    [
                        "DPSS90001",
                        "DPSS90002",
                        "DPSS90003",
                        "DPSS90008",
                        "DPSS90009"
                    ],
                    "PLUSone core subject (12.5 credit points) according to the specialisation being undertaken."
                ]
            },
            "Year 2": {
                "overview": [
                    [
                        "DPSS90010",
                        "DPSS90004",
                        "DPSS90011",
                        "DPSS90005"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}