{
    "Course name": "Master of Food Science",
    "Course code": "439FS",
    "Overview text": [
        "The Master of Food Science has been developed as a graduate degree, ideally for graduates holding a science or engineering degree. This course provides training for a career in the food and associated industries. Each student completes a tailored program of coursework subjects incorporating core study areas and electives in addition to a research project in an approved area of food science.",
        "As a graduate you will be well prepared to play a key role in research and technical divisions within food companies and associated organisations, as well as in managing food production across the entire food supply chain."
    ],
    "Overview table": {
        "Award title": "Master of Food Science",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "061970M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed: an undergraduate degree in any discipline with at least an H3 (65%) weighted average, or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "1. In ranking applications, the Selection Committee will consider: Prior academic performance",
            "2. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments\n",
            "3. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Notes:",
            "Successful applicants with an undergraduate degree in a cognate discipline may receive up to 50 credit points of advanced standing towards the elective subject requirements of the Masters.",
            "Successful applicants with an honours degree in a cognate discipline may receive up to 100 credit points of advanced standing towards the Masters.",
            "Successful applicants with completed graduate level subjects in a cognate discipline may receive up to 100 credit points of advanced standing towards the Masters.",
            "Students completing the Graduate Certificate or Graduate Diploma in Food Science will be eligible for 50 or 100 points of credit respectively into the Master of Food Science."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Science welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to make reasonable adjustments so as to enable the student’s participation in the Faculty's programs.",
            "Students of the Faculty's courses must possess intellectual, ethical, and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the Faculty. Candidates must have abilities and skills in observation; motor in relevant areas; communication; in conceptual, integrative, and quantitative dimensions; and in behavioural and social dimensions.",
            "Adjustments can be provided to minimise the impact of a disability, however students need to be able to participate in the program in an independent manner and with regard to their safety and the safety of others.",
            "I. Observation:In some contexts, the student must be able to observe demonstrations and experiments in the basic and applied sciences. More broadly, observation requires reading text, diagrams, maps, drawings and numerical data. The candidate should be able to observe details at a number of scales and record useful observations in discipline dependant contexts.",
            "II. Communication:A candidate should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. A candidate must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.",
            "III. Motor:Candidates should have sufficient motor function necessary for participation in the inherent discipline-related activities. The practical work, design work, field work, diagnostic procedures, laboratory tests, require varying motor movement abilities. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments.",
            "IV. Intellectual-Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving, the critical skill demanded of professionals in land and environment industries, requires all of these intellectual abilities. In addition, the candidate should be able to comprehend three-dimensional relationships and to understand the spatial relationships of structures.",
            "V. Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel their disability will prevent them from meeting the above academic requirements are encouraged to contact Student Equity and Disability Serviceshttps://students.unimelb.edu.au/explore/student-equity"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Food Science requires the successful completion of 200 credit points.",
                "The Master of Food Science is a 2 year degree (full time). This degree offers a diverse range of elective subjects enabling students to develop sufficient familiarity with knowledge areas relevant to their research thesis or capstone experience, supplementing existing academic qualifications and industrial experience."
            ],
            "To obtain the degree students must complete": {
                "overview": [
                    [
                        "100 credit points of compulsory subjects",
                        "Between 25 and 50 credit points of Capstone subjects",
                        "Between 50 and 75 credit points of Elective subjects"
                    ]
                ]
            },
            "Subjects Options": {
                "overview": []
            },
            "Compulsory subjects": {
                "overview": [
                    "Students must complete all of the following eight subjects (100 points):",
                    [
                        "FOOD90022",
                        "FOOD90007",
                        "FOOD90010",
                        "FOOD90023",
                        "FOOD90008",
                        "FOOD90035",
                        "AGRI90075",
                        "FOOD90012"
                    ]
                ]
            },
            "Capstone Subjects": {
                "overview": [
                    "Students must complete a minimum of 25 points of capstone subjects from the following:",
                    [
                        "Students wishing to take a  Major research project over one semester should enrol into AGRI90072 Major Research Project.",
                        "Students wishing to take a Major Research project over two semesters should enrol into or AGRI90080 Major Research Project Part 1 and AGRI90082 Major Research Project Part 2."
                    ],
                    [
                        "AGRI90080",
                        "AGRI90082",
                        "AGRI90072",
                        "FOOD90043"
                    ]
                ]
            },
            "Electives": {
                "overview": [
                    "Students must complete a minimum of 50 and maximum of 75 credit points from the following:",
                    [
                        "FOOD90034",
                        "FOOD90028",
                        "FOOD90031",
                        "FOOD90032",
                        "AGRI90076",
                        "FOOD90041",
                        "FOOD90040",
                        "FOOD90033",
                        "AGRI90057",
                        "AGRI90089",
                        "AGRI90012",
                        "AGRI90014"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}