{
    "Course name": "Master of Tax",
    "Course code": "742AB",
    "Overview text": [
        "Melbourne Law School’s specialisation in tax is a globally recognised advanced tax law degree. The program provides a valuable enhancement to the careers of lawyers, accountants and other professionals working as tax advisers in business or government.",
        "The extensive and diverse tax subject selection allows students to gain an advanced understanding of tax law, policy and administration across core, specialist and international tax areas. All subjects are taught by leading Australian and international academic and professional experts, and emphasis is placed on international and comparative trends and current developments in tax practice. Practical case studies allow in-depth analysis of tax law to equip students with detailed tax law knowledge, its underlying principles and practical application, generating a real advantage in this competitive professional area."
    ],
    "Overview table": {
        "Award title": "Master of Tax",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "075002M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "Start Year Intake 2024",
            "1. In order to be considered for entry, applicants must have completed:• a degree in law (LLB, JD or equivalent) leading to admission to practice, at honours standard, or equivalent; or• a degree in law (LLB, JD or equivalent) leading to admission to practice, or equivalent, and two years of documented relevant professional experience; or• an undergraduate degree in a relevant discipline; and two years of documented relevant professional experience; or• an undergraduate degree in a relevant discipline; and successful completion of four subjects in a cognate graduate diploma; and one year of documented relevant professional experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:• prior academic performance; and• the professional experience",
            "3.  The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4.  Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Mid-year Intake 2024",
            "1. In order to be considered for entry, applicants must have completed:• a degree in law (LLB, JD or equivalent) leading to admission to practice, at honours standard, or equivalent; or• a degree in law (LLB, JD or equivalent) leading to admission to practice, or equivalent, and two years of documented relevant professional experience; or• an undergraduate degree in a relevant discipline; and two years of documented relevant professional experience; or• an undergraduate degree in a relevant discipline; and successful completion of four subjects in a cognate graduate diploma; and one year of documented relevant professional experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:• prior academic performance; and• the professional experience",
            "3.  The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4.  Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.0 overall with no band less than 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne Law Masters welcomes applications from students with disabilities. The inherent academic requirements for study in the Melbourne Law Masters are:",
            "The ability to attend a minimum of 75% of classes and actively engage in the analysis and critique of complex materials and debate;",
            "The ability to read, analyse and comprehend complex written legal materials and complex interdisciplinary materials;",
            "The ability to clearly and independently communicate in writing a knowledge and application of legal principles and interdisciplinary materials and to critically evaluate these;",
            "The ability to clearly and independently communicate orally a knowledge and application of legal principles and interdisciplinary materials and critically evaluate these;",
            "The ability to work independently and as a part of a group;",
            "The ability to present orally and in writing legal analysis to a professional standard.",
            "Students who feel their disability will inhibit them from meeting these inherent academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete 100 credit points in total. All international students are required to undertakeFoundations of Tax Law. This subject provides a necessary grounding in Australian common law and statutory law of taxation, enabling a comparison with students’ home country tax systems. It provides the foundation for successful study in the other tax subjects studied in the course.",
                "Students must complete at least 75 credit points from the prescribed lists and may select up to 25 credit points from the subjects offered in the Master of Commercial Law.Note: Most subjects in the MLM program are 12.5 credit points each. Check individual subject handbook entries for confirmation.",
                "Study Abroad at Oxford",
                "Students enrolled in the Master of Tax also have the opportunity to study abroad at the University of Oxford.Learn more",
                "Tax Practitioners Board",
                "The subject marked (I) is approved as an introductory subject, and subjects marked (A) are approved as advanced subjects for participant accreditation as a tax agent with the Tax Practitioners Board (TPB). For further information about approved courses, consult the list atwww.tpb.gov.au. For information about applying the TPB ‘mix and match’ approach, please consult TPB Information Sheet TPB(I) 06/2011 atwww.tpb.gov.au.",
                "Tax subjects",
                [
                    "Capital Gains Tax: Problems in Practice (A)",
                    "Corporate Tax A (Shareholders, Debt and Equity) (A)",
                    "Foundations of Tax Law (I)",
                    "Taxation of Business and Investment Income (A)"
                ],
                "Specialist Tax subjects",
                [
                    "Administrative Law in Tax Matters",
                    "Corporate Tax B (Consolidation and Losses) (A)",
                    "Goods and Services Tax Principles (A)",
                    "Global Digital Tax \n",
                    "Mineral and Petroleum Tax",
                    "Not-for-Profits, Law and the State",
                    "Sport and Taxation",
                    "State Taxes and Duties",
                    "Tax and Crime",
                    "Tax Avoidance and Planning (A)",
                    "Tax Litigation",
                    "Tax Policy",
                    "Tax Practice: Writing Effectively (A)",
                    "Tax in Practice \n",
                    "Tax of Innovation \n",
                    "Taxation of Major Projects",
                    "Taxation of Mergers and Acquisitions (A)",
                    "Taxation of Small and Medium Enterprises (A)",
                    "Taxation of Superannuation (A)",
                    "Tax of Superannuation A \n",
                    "Taxation of Trusts (A)"
                ],
                "International and Comparative Tax subjects",
                [
                    "Chinese Tax Law and Policy\n",
                    "Comparative Corporate Tax (A)",
                    "Comparative International Tax",
                    "Comparative Tax Avoidance (A)",
                    "Current Issues in International Tax",
                    "Income Tax Compliance and Enforcement",
                    "International Tax: Anti-Avoidance",
                    "International Tax: Principles and Structure (A)",
                    "International Taxation in the US",
                    "International Tax in the United States \n",
                    "Special Issues in Tax Treaties",
                    "Tax Reform and Development",
                    "Tax Treaties (A)",
                    "Tax Treaty Interpretation",
                    "Transfer Pricing: Practice and Problems (A)",
                    "UK International Tax"
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Tax subjects": {
            "overview": [
                [
                    "LAWS70081",
                    "LAWS70024",
                    "LAWS70323",
                    "LAWS90130",
                    "LAWS70002"
                ]
            ]
        },
        "Specialist Tax subjects": {
            "overview": [
                [
                    "LAWS90167",
                    "LAWS70008",
                    "LAWS90232",
                    "LAWS70031",
                    "LAWS70399",
                    "LAWS90055",
                    "LAWS70130",
                    "LAWS90239",
                    "LAWS70005",
                    "LAWS90233",
                    "LAWS70266",
                    "LAWS90236",
                    "LAWS90235",
                    "LAWS70319",
                    "LAWS70318",
                    "LAWS70331",
                    "LAWS70049",
                    "LAWS70267",
                    "LAWS70333"
                ]
            ]
        },
        "International and Comparative Tax subjects": {
            "overview": [
                [
                    "LAWS90231",
                    "LAWS70009",
                    "LAWS70353",
                    "LAWS70410",
                    "LAWS90158",
                    "LAWS90176",
                    "LAWS90234",
                    "LAWS90017",
                    "LAWS70006",
                    "LAWS70124",
                    "LAWS90050",
                    "LAWS70162",
                    "LAWS70146",
                    "LAWS90132",
                    "LAWS70203",
                    "LAWS90054"
                ]
            ]
        },
        "Other subjects": {
            "overview": [
                [
                    "LAWS90268"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "A student who completes a masters degree in the Melbourne Law Masters is eligible to apply for entry to the PhD program."
    ]
}