{
    "Course name": "Master of Entrepreneurship (Enhanced)",
    "Course code": "MC-ETRENH",
    "Overview text": [
        "In the Master of Entrepreneurship (Enhanced) you will learn how to develop new businesses, products, services, or processes, creating value and generating new revenue growth through entrepreneurial thought and action. This program will facilitate your career as an agent of change, either within a new venture or an established organization. Students will learn about the latest concepts, frameworks, tools and techniques to identify and successfully implement new business opportunities. During the course of the year, there will be many opportunities to interact with and learn from (corporate) entrepreneurs and put obtained knowledge, tools and skills into practice.",
        "Master of Entrepreneurship graduates generally follow one of three career paths:",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Master of Entrepreneurship (Enhanced)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "107115M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completedone of:",
            "A bachelor degree* or equivalent in a cognate area (ie, business or economics related); or",
            "A bachelor honours degree* or equivalent in a non-cognate area; or",
            "A three-year undergraduate qualification* and at least 50 credit points, or equivalent, of graduate study in a non-cognate area; or",
            "A three-year undergraduate qualification* in a non-cognate area and at least two years of documented, relevant work experience; or",
            "A minimum of six years documented, relevant work experience; and\n",
            "A personal statement (no more than 1000 words) outlining why they wish to be considered for the course; and\n",
            "An interview (for shortlisted candidates only).",
            "*Undergraduate qualification must have a University of Melbourne equivalent weighted average mark of least 65% (H3) or equivalent",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic and/or professional performance; and",
            "The personal statement; and",
            "The interview (for short-listed candidates).",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7.0is required.",
            "Note:",
            "Applicants who have completed the Graduate Certificate in Entrepreneurship or graduate course work in the field of entrepreneurship and innovation may be awarded up to 50 points of credit.",
            "Students who discontinue from the Master of Entrepreneurship (Enhanced) but have successfully completed the requirements of the Graduate Certificate in Entrepreneurship will be eligible to receive the Graduate Certificate in Entrepreneurship as an exit award."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students with reasonable adjustments to assessment and participation under the Disability Standards for Education (2005), and the Assessment and Results Policy (MPF1326). Students are expected to meet the core participation requirements for their course. These can be viewed under Entry and Participation Requirements for the course outlines in the Handbook. Further details on how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Entrepreneurship (Enhanced) is a 150 point program comprised of:",
                [
                    "4 compulsory foundation subjects, 50pts",
                    "4 compulsory core subjects, 50pts",
                    "3 constrained elective subjects (capstone pathway), 37.5pts",
                    "1 elective subject from the approved elective options, 12.5pts"
                ]
            ],
            "Semester 1": {
                "overview": [
                    "Students must complete the following four compulsory foundation subjects. All foundation subjects must be completed before progressing to core and elective subjects.",
                    [
                        "MGMT90201",
                        "MGMT90227",
                        "MGMT90030",
                        "BUSA90529"
                    ]
                ]
            },
            "Semester 2": {
                "overview": [
                    "Students must complete the following two compulsory core subjects and then choose a capstone pathway:",
                    [
                        "MGMT90225",
                        "FNCE90089"
                    ],
                    "AND",
                    [
                        "MKTG90025",
                        "MGMT90230"
                    ],
                    [
                        "MKTG90002",
                        "MGMT90285"
                    ]
                ]
            },
            "Semester 3": {
                "overview": [
                    "Students must complete the following two compulsory core subjects, a capstone pathway subject and an elective from the constrained choice:",
                    [
                        "MGMT90228",
                        "MGMT90229"
                    ],
                    [
                        "MGMT90286"
                    ],
                    "OR",
                    [
                        "MGMT90284"
                    ]
                ]
            },
            "One elective subject from:": {
                "overview": [
                    [
                        "BUSA90525",
                        "BUSA90473",
                        "BUSA90485",
                        "MGMT90165",
                        "BUSA90013",
                        "BUSA90053",
                        "BUSA90519",
                        "BUSA90273",
                        "BUSA90524",
                        "BUSA90527",
                        "BUSA90458",
                        "LAWS90125"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}