{
    "Course name": "Master of Marketing Communications",
    "Course code": "MC-MKTCOMM",
    "Overview text": [
        "The Master of Marketing Communications is designed to allow students to understand and penetrate a rapidly changing environment where marketing and communications functions are increasingly integrated and merged. A major focus of the degree, and point of difference from competing degrees taught at other institutions, is its rigorous academic engagement with the question of how marketing and communications professions are being transformed by the emergence of a ‘post-convergence’ media and communications environment, as evidenced by:",
        "At the same time the degree is significantly vocational and aimed at genuine industry training needs. The MMC will train students in a range of skills for employment in professions involving persuasive public communications, such as advertising, public relations, and strategic political communications. The MMC will to equip students with skills essential to a new and evolving professional environment and ground their learning in an appropriate academic discourse.",
        "The Master of Marketing Communications draws on the expertise across the University of Melbourne to develop the skills and competencies of professionals who operate in increasingly complex marketing and communications environments. The MMC focuses on the role of professionals working across the increasingly overlapping fields of marketing and communications. Participants will mix theory and practice to address the complex challenges of marketing and communications through an interactive learning experience, combining individual and team-based learning opportunities that allow them to explore a range of contemporary issues. All participants undertake an internship or research project as part of the MMC to apply their learning in an individual or team-based experience."
    ],
    "Overview table": {
        "Award title": "Master of Marketing Communications",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "085102B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree in any discipline with at least an H2B (70%) weighted average, or equivalent",
            "Meeting this requirement does not guarantee selection.2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Relevance of previous studies",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. The minimumEnglish language requirementsfor this course are Band 6.5Applicants with the following may be awarded up to 50 points of credit:",
            "An undergraduate degree in a cognate discipline, with at least H2B (70%) weighted average, or equivalent",
            "An undergraduate degree in any discipline with at least an H2B (70%) weighted average, or equivalent and at least two years documented relevant media and communications work experience"
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [],
            "200 point program": {
                "overview": [
                    "Duration: two years full-time / up to four years part-time",
                    "First 50 points: (must be completed in the first 50 points of the program)",
                    [
                        "Three compulsory subjects (50 points)"
                    ],
                    "Remaining 150 points",
                    "Coursework Only Option:",
                    [
                        "Six compulsory subjects (75 points)",
                        "Capstone subject/s (25 points)",
                        "Elective subjects (50 points)"
                    ],
                    "OR",
                    "Minor Thesis Option:",
                    [
                        "Six compulsory subjects (75 points)",
                        "MECM90032 Marketing Communications Thesis Part 1 and MECM90033 Marketing Communications Thesis Part 2 (37.5 points total)",
                        "ARTS90032 Research Principles and Practices (12.5 points)",
                        "Elective subjects (25 points)"
                    ]
                ]
            },
            "150 point program": {
                "overview": [
                    "Duration: one and a half years full-time / up to three years part-time",
                    "Coursework Only Option:",
                    [
                        "Six compulsory subjects (75 points)",
                        "Capstone subject/s (25 points)",
                        "Elective subjects (50 points)"
                    ],
                    "OR",
                    "Minor Thesis Option:",
                    [
                        "Six compulsory subjects (75 points)",
                        "MECM90032 Marketing Communications Thesis Part 1 and MECM90033 Marketing Communications Thesis Part 2 (37.5 points total)",
                        "ARTS90032 Research Principles and Practices (12.5 points)",
                        "Two elective subjects (25 points)"
                    ]
                ]
            },
            "Capstone Requirement:": {
                "overview": [
                    "All students are required to complete the Capstone Requirement for the program (at least 25 points). Students must complete one of the following capstone options in their final semester(s) of study:",
                    "Capstone Stream 1: MKTG90032 Applied Syndicate Project (12.5 points) and MGMT90148 Consulting Fundamentals (12.5 points)",
                    "Purpose: Enables students to plan, execute and communicate a communications plan or research project.",
                    "Capstone Stream 2: MKTG90011 Marketing Research (12.5 points) and MGMT90148 Consulting Fundamentals (12.5 points)",
                    "Purpose: Enables students to plan, execute and communicate a marketing-focussed research project.",
                    "Capstone Stream 3: ARTS90032 Research Principles & Practices Graduate and MECM90032 Marketing Communications Thesis Part 1 and MECM90033 Marketing Communications Thesis Part 2 (50 points total)",
                    "Purpose: An opportunity to integrate knowledge and research skills to address a specific marketing communications research question.",
                    "Capstone Stream 4: MULT90019 Internship II (Semester Long) (25 points)",
                    "Purpose: An opportunity to acquire practical skills in development practice and project management and apply this knowledge to solve problems that arise in a professional context and develop an integrated understanding of knowledge and practice.",
                    "External subject rule",
                    "Student may undertake an external subject (not listed within the program structure) with the permission of the program and subject coordinator. All external subject requests must be for the elective subject requirement, not as a compulsory, capstone subject. The maximum external subjects allowed are as follows:",
                    [
                        "200 point program undertaken at University of Melbourne (2 years): maximum 25 points.",
                        "150 point program undertaken at University of Melbourne (1.5 years): maximum 12.5 points.",
                        "100* point program undertaken at University of Melbourne (1 year): 12.5 points",
                        "50*^ point program undertaken at University of Melbourne (0.5 years): 0 points."
                    ],
                    "* GC-ARTS, GD-ARTS, GCA-ARTS and GDA-ARTS students are not normally granted permission to undertake external subjects towards their degree.",
                    "^ Exception: Students admitted to 50 point programs may apply to take LING90002, Presenting Academic Discourse, as an external subject.",
                    "Please note that advanced standing contributes to a student’s remaining points undertaken at University of Melbourne, and may affect how many points the student can undertake outside the enrolled program.",
                    "For policies that govern this degree, see Academic Services Policy in the University of Melbourne Policy Framework:",
                    "Academic Services Policy",
                    "University of Melbourne Policy Framework",
                    "Students also should also refer to information in the Student Policy Directory:",
                    "Policy and conduct"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who complete the thesis option may be eligible for entry into the PhD."
    ]
}