{
    "Course name": "Master of Music (Opera Performance)",
    "Course code": "MC-MUSOP",
    "Overview text": [
        "The Master of Music (Opera Performance) is a practice-based graduate coursework degree. The course consists of 200 points of study in four areas: Opera Performance Practicum, Core Skills in Opera, Research Studies and Supporting Studies.",
        "This course includes specialist training provided to students through vocational placement in a professional opera company (e.g. Victorian Opera or Pinchgut Opera), or through performance in one of the University’s in-house opera productions.",
        "Last updated: 13 September 2024"
    ],
    "Overview table": {
        "Award title": "Master of Music (Opera Performance)",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "076225K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in vocal performance or equivalent, with evidence of European modern language training in either lyric diction and/or practical language skills learning; and",
            "an audition.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance;",
            "and the audition.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "All students of music must possess intellectual, ethical, physical and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the Melbourne Conservatorium of Music.a) Musical skills, including well developed vocal proficiency, musical literacy, and aural discrimination skills;",
            "b) Cognitive skills, including the ability to comprehend complex music information and material independently;",
            "c) Communication skills, including the ability to write and speak clearly and effectively. Communication with fellow students, academic and professional staff, and the wider public about their knowledge and application of music performance is essential.",
            "Students must possess the physical and emotional health required for full use of their intellectual abilities, the exercise of good judgment and the prompt completion of all responsibilities required by the course. All students need to be aware of their personal limitations and when and where to seek professional advice or supervision. Students must be able to tolerate physically taxing musical practice and to function effectively under stress and isolation in musical preparation. They must also be able to function effectively as part of a musical ensemble, to adapt to changing environments and to display flexibility.",
            "d) Behavioural and Social Attributes, so as to enable students to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "The Melbourne Conservatorium of Music welcomes applications from students with disabilities. It is University policy to make reasonable adjustments so as to enable a student’s participation in the Melbourne Conservatorium of Music’s programs. Students who have a disability which may prevent them from participating in tasks involving these inherent academic requirements are encouraged to contact the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/. Adjustments can be provided to minimise the impact of a disability; however, students will need to participate in the course in an independent manner."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "This course is only offered as a Full Time course over 2 consecutive years.",
                "200-point program:",
                [
                    "150 points of compulsory subjects",
                    "50 points of elective subjects according to one of the following specialisations:\n\n",
                    [
                        [
                            "Singer (50 credit points); or",
                            "Repetiteur (50 credit points)."
                        ]
                    ]
                ]
            ],
            "Year 1": {
                "overview": [
                    [
                        "MUSI90160",
                        "MUSI90231",
                        "MUSI90169",
                        "MUSI90233"
                    ],
                    "PLUS",
                    "Two elective subjects according to the specialisation chosen."
                ]
            },
            "Year 2": {
                "overview": [
                    [
                        "MUSI90171",
                        "MUSI90172",
                        "MUSI90234"
                    ],
                    "PLUS",
                    "Two elective subjects according to the specialisation chosen."
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "After successful completion of the degree with appropriate research training subjects, students will be eligible to apply for a research Masters degree."
    ]
}