{
    "Course name": "Master of Ecosystem Management and Conservation",
    "Course code": "MC-ECOSMC",
    "Overview text": [
        "The Master of Ecosystem Management and Conservation aims to prepare graduates for a wide range of ecosystem and landscape management employment pathways by preparing graduates with an understanding the biophysical and the social aspects of ecosystem management and how to function across local and landscape levels to address the problems of the future. The course seeks to development key practical and technical based skills sets as well as the knowledge and theories that underpin them creating graduates who can evaluate, collaborate and act. It is ultimately designed to prepare graduates for employment outcomes and will provide a cohort experience between graduates, teaching staff and practitioners to foster a connected and engaged coursework experience.",
        "Features of the Master of Ecosystem Management and Conservation:",
        "Last updated: 4 April 2024"
    ],
    "Overview table": {
        "Award title": "Master of Ecosystem Management and Conservation",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "098317B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree in a cognate discipline with at least an H3 (65%) weighted average, or equivalent; or",
            "An undergraduate degree in any area including at least 25 points in one or more of Chemistry, Biology, Mathematics or Statistics, or equivalent, and with at least an H3 (65%) weighted average, or equivalent; or",
            "An undergraduate degree in any area and a Graduate Certificate in a relevant discipline with at least an H3 (65%) weighted average in the Certificate, or equivalent; or",
            "A two-year associate degree or diploma in a relevant discipline, or equivalent; and five years documented, relevant professional experience; and",
            "an appropriate level of performance on a test conducted by the Selection Committee to confirm generic skills necessary for successful study in the program or the completion of a relevant Melbourne MicroCert.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Professional experience; and",
            "The score on the test conducted by the Selection Committee.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Admission and Selection into Course Policy.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note:",
            "The requirement for at least H3 (65%) weighted average in each case may be waived where the applicant can demonstrate significant professional development in a relevant area since graduation.",
            "The assessment test will be conducted in a single period of two-hour duration where students will be required to demonstrate the following abilities to gain entry to graduate study:",
            "Analyze and interpret scientific or technical data;",
            "Comprehend and use scientific literature; and",
            "Conceptualise a problem."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Science (Science) welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to make reasonable adjustments so as to enable the student’s participation in the Faculty's programs. Science contributes to the New Generation degrees and offers a broad range of programs across undergraduate and post-graduate levels many of which adopt a multi-disciplinary approach.",
            "Students of the Faculty's courses must possess intellectual, ethical, and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the Faculty. Candidates must have abilities and skills in observation; motor in relevant areas; communication; in conceptual, integrative, and quantitative dimensions; and in behavioural and social dimensions.",
            "Adjustments can be provided to minimise the impact of a disability, however students need to be able to participate in the program in an independent manner and with regard to their safety and the safety of others.",
            "I. Observation:In some contexts, the student must be able to observe demonstrations and experiments in the basic and applied sciences. More broadly, observation requires reading text, diagrams, maps, drawings and numerical data. The candidate should be able to observe details at a number of scales and record useful observations in discipline dependant contexts.",
            "II. Communication:A candidate should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. A candidate must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.",
            "III. Motor:Candidates should have sufficient motor function necessary for participation in the inherent discipline-related activities. The practical work, design work, field work, diagnostic procedures, laboratory tests, require varying motor movement abilities. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments.",
            "IV. Intellectual-Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving, the critical skill demanded of professionals in land and environment industries, requires all of these intellectual abilities. In addition, the candidate should be able to comprehend three-dimensional relationships and to understand the spatial relationships of structures.",
            "V. Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel their disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit.http://www.services.unimelb.edu.au/disability"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Institute of Foresters Australia",
            "Graduates of the Master of Ecosystem Conservation and Management will be eligible for membership of theInstitute of Foresters Australiaand with further professional and practical experience to qualify as Registered Professional Foresters."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete 200 pts consisting of:",
                [
                    "Foundational Core (25 pts)",
                    "Discipline Core (100pts)",
                    "Discipline Electives (50 - 62.5 pts)",
                    "Professional Skills (12.5 - 25 pts)"
                ]
            ]
        },
        "Foundational Core Subjects (25pts)": {
            "overview": [
                "Students must complete 25 points of Foundational Core subjects in the first year of study from the following:",
                [
                    "FRST30001",
                    "FRST20015",
                    "BOTA30004",
                    "EVSC30007",
                    "BOTA90005",
                    "HORT90041",
                    "EVSC30003",
                    "ECOL30005",
                    "FRST30003",
                    "ECOL20003",
                    "ENST20001",
                    "GEOG30025",
                    "ENST20004",
                    "ENST30004"
                ]
            ]
        },
        "Discipline Core Subjects (100pts)": {
            "overview": [
                "Students must complete all of the following:",
                [
                    "FRST90015",
                    "ENST90044",
                    "FRST90025",
                    "FRST90022",
                    "ENST90045",
                    "ENST90046",
                    "NRMT90007",
                    "ENST90043"
                ],
                "***ENST90046 and NRMT90007 must be undertaken within the final 100 points of the course"
            ]
        },
        "Discipline Elective subjects (50-62.5pts)": {
            "overview": [
                "Students must complete at least 50 points of Electives subjects from the following:",
                [
                    "AGRI90075",
                    "EVSC90014",
                    "EVSC90020",
                    "EVSC90026",
                    "FRST90017",
                    "FRST90030",
                    "FRST90032",
                    "FRST90033",
                    "FRST90034",
                    "FRST90076",
                    "FRST90078",
                    "NRMT90003"
                ]
            ]
        },
        "Professional Skills Subjects (12.5 - 25pts)": {
            "overview": [
                "Students must complete between 12.5- and 25-points of Professional Skills subjects from the following:",
                [
                    "AGRI90089",
                    "BUSA90403",
                    "GEOG90022",
                    "MGMT90171",
                    "SCIE90005",
                    "SCIE90012",
                    "SCIE90013",
                    "SCIE90017",
                    "SCIE90027",
                    "SKIL90004"
                ],
                "Note:",
                "1. Those choosing to undertake FRST90076 Short Research Project B as an elective will be required to complete one of either NRMT90003 Social Research Methods or AGRI90075 Research Methods for Life Science as well as a 12.5-point professional skills subject. Students considering this option are required to discuss this with the course coordinator prior to commencement.",
                "2. Students are expected to complete ENST90046 Landscape Governance and Policy and NRMT90007 Communities and Ecosystem Management during the final 100 points of their study as part of a capstone experience.",
                "3. A 150pt cognate stream is available. Up to 50pts credit can be awarded for foundation and elective subjects to students deemed to be cognate allowing them to complete the course in 1.5 years. Students planning to undertake the cognate stream will need to discuss this with the course coordinator prior to commencement. The cognate stream will comprise of: completion of all Core subjects - 100pts, completion of 12.5 to 25 points of Professional Skills subjects and completion of 25 to 37.5 points of elective subjects.",
                "4. Students can complete, on approval from course coordinator, electives or foundation subjects from: * the Office of Environmental Programs Subject List * the University Handbook * or alternatively from another University nationally or internationally (up to 25% of total course)."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The Master of Ecosystem Conservation and Management allows students to complete either the Ecosystem Internship or the Short Research Project B to progress to a PhD."
    ]
}