{
    "Course name": "Master of Psychology (Clinical Neuropsychology)/Doctor of Philosophy",
    "Course code": "080CN",
    "Overview text": [
        "The clinical neuropsychology program at the University of Melbourne commenced in the 1970s and aims to provide students with the skills and knowledge necessary for competent practice in relation to a variety of diagnostic problems and management issues. The acquisition of professional skills at a sophisticated level is the ultimate goal of the program. The program enjoys an excellent reputation as one of the premier clinical neuropsychology programs in the country and produces graduates with a detailed understanding of the affective, behavioural and cognitive manifestations of diseases of the central nervous system, particularly those affecting the brain, in adults and children. Graduates acquire competence in various approaches to the study of brain disease, including basic and applied clinical sciences, and are expected to acquire an understanding of culturally responsive, objective assessment of the many behavioural features of brain diseases that can present across the lifespan.",
        "The course is accredited by theAustralian Psychology Accreditation Council (APAC),providing the required sequence of subjects for graduates wishing to attain generalist registration as a psychologist in Australia as well as competency in knowledge and skills relevant to the clinical neuropsychology specialisation.",
        "The course is comprised of coursework subjects, practical experience through clinical placements and a major research thesis in an area relevant to clinical neuropsychology.  All subjects are compulsory.  The academic members of the teaching staff are actively involved in the practice of clinical neuropsychology (including supervision of clinical trainees) in a teaching hospital, and are therefore well positioned to bring to the teaching situation a high level of clinical and research expertise.",
        "Students undertake clinical placements in a wide variety of services that cover acute care neurology and neurosurgery, psychiatry, geriatrics, rehabilitation, and paediatrics. The placement experience enjoyed by our students is one of the most extensive in the world.For the Doctor of Philosophy component of the course, please also refer to :http://mdhs-study.unimelb.edu.au/degrees/doctor-of-philosophy/overview"
    ],
    "Overview table": {
        "Award title": "Master of Psychology (Clinical Neuropsychology)/Doctor of Philosophy",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "037232A",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "4 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "All applicants who wish to undertake the Master of Psychology (Clinical Neuropsychology)/PhD combined program must first enrol in the single Master of Psychology (Clinical Neuropsychology)and may then apply for entry to the combined program for the following year. Applicants must satisfy the Doctor of Philosophy - Medicine, Dentistry and Health Sciences currently approved entry requirements -1. In order to be considered for entry, applicants must have completed:• a four-year bachelor degree in a relevant discipline which includes a substantial research component equivalent to at least 25% of one year of full-time study and have achieved a minimum weighted average of 80% or (University of Melbourne) equivalent;or• a masters degree in a relevant discipline which includes a substantial research component equivalent to at least 25% of one year of full-time study and achieved a minimum weighted average of 80% or (University of Melbourne) equivalent;or• a qualification and professional experience considered to be equivalent;and• a research proposal; and• referee reports (except for applicants who have graduated from the University of Melbourne within the last 5 years); and• the endorsement of a prospective supervisor.Meeting these requirements does not guarantee selection.2. In selecting applicants, the selection committee will consider applicants’:• prior academic performance and, if relevant, professional qualifications;• understanding of the research question to be explored;• performance at an interview;• motivation and capacity to complete the course in a timely manner;• relevant prior research and/or professional experience; and• the referee reports.3. The selection committee may seek further information to clarify any aspect of an application in accordance with the Selection and Admission Policy.4. The minimum English language requirements for this course are: Band 7"
        ],
        "Inherent requirements (core participation requirements)": [
            "Students must comply with Fitness to Practice Rules, which are accessible fromSchedule 1of theStudent Fitness to Practice Policy (MPF1345).",
            "The University of Melbourne is committed to providing students with reasonable adjustments to assessment and participation under the Disability Standards for Education (2005), and theAssessment and Results Policy (MPF1326). Students are expected to meet the core participation requirements for their course. These can be viewed under Entry and Participation Requirements for the course outlines in the Handbook.",
            "Further details on how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home",
            "PhD",
            "All candidates are required to complete the equivalent of at least six months full-time (12 months part-time) advanced study and research at the University unless studying at an outside institution approved by the Research Higher Degrees Committee (RHDC). The RHDC will not approve entirely distance supervision or entirely on-line supervision for research higher degree students.",
            "Throughout their candidature candidates are expected to attend the University in order to benefit from planning, conducting and writing up their research within a University community and environment.",
            "The residency requirement is deemed especially important during the first six months of candidature. During this time the student is expected to interact on a regular basis with the supervisor, the department (including staff and other research students) and the University, so as:",
            "to build the skills and knowledge necessary to carry out the proposed research program",
            "to acquire an understanding of the standards and requirements for a research higher degree awarded by the University",
            "to make use of support programs and facilities provided by the University throughout candidature."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Psychology Accreditation Council",
            "Accredited by the Australian Psychology Accreditation Council (APAC) and recognised by the Australian Health Practitioner Regulation Agency (AHPRA)"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "This course consists of the coursework and placement components of the Master of Psychology (Neuropsychology) together with a fullPhDresearch thesis in Psychology.",
                "Coursework consists of 13 classroom-based subjects taken over the first three years of this four-year course (see below).",
                "PhD: A range of University policies and procedures apply to students enrolled in Higher Degrees by Research. Students should familiarise themselves with these policies. Refer to thepolicy library"
            ]
        },
        "Subject options": {
            "overview": [
                "In order to satisfy the requirements of the combined Master of Psychology (Clinical Neuropsychology)/PhD, students must complete the following subjects:",
                "First-year subjects:",
                [
                    "PSYC90003",
                    "PSYC90039",
                    "PSYC90032",
                    "PSYC90006",
                    "PSYC90029",
                    "PSYC90030",
                    "PSYC90031",
                    "PSYC90007",
                    "PSYC90082",
                    "PSYC90083",
                    "PSYC90084",
                    "PSYC90008",
                    "PSYC90125"
                ],
                "Second-year subjects:",
                [
                    "PSYC80004",
                    "PSYC90079",
                    "PSYC90033"
                ],
                "Third-year subjects:",
                [
                    "PSYC80004",
                    "PSYC90080",
                    "PSYC90042",
                    "PSYC90023"
                ],
                "Fourth-year subjects",
                [
                    "PSYC80004"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}