{
    "Course name": "Master of Analytics Management",
    "Course code": "MC-ANAMGT",
    "Overview text": [
        "The goal of this course is to equip its graduates with the capabilities to use their analytics skills to address business issues. The course is designed to develop an analytics generalist. The course will cover foundational general management subjects, analytics subjects as well as frameworks for applying the techniques to a variety of business contexts.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Master of Analytics Management",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "0100137",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. To be considered for entry, applicants must have completed:",
            "An undergraduate degree; and",
            "Minimum two years of documented full-time relevant work experience; and",
            "A personal statement outlining why they wish to be considered for the program; and",
            "Referees' reports",
            "Meeting these requirements does not guarantee selection.",
            "1. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "The work experience; and",
            "The personal statement; and",
            "The referees' reports",
            "1. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments. ",
            "1. Applicants are required to satisfy the university's English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band (7.0) is required.",
            "Note.",
            "Students who do not meet the progression requirements or choose not to complete the Master of Analytics Management, may exit the Master of Analytics Management with one of the following awards:",
            "Professional Certificate in Business Administration: requires successful completion of two Category 1 subjects;",
            "Professional Certificate in Analytics Management: requires successful completion of two Category 2 or Category 3 subjects;",
            "Graduate Certificate in Business Administration: requires successful completion of four Category 1 subjects; or",
            "Graduate Diploma in Analytics Management: requires successful completion of four subjects (must include Data Analysis) in Category 1 and any three subjects in Category 2, and one subject in Category 3",
            "Information on the requirements that must be met for exit award are available in the Handbook."
        ],
        "Inherent requirements (core participation requirements)": [
            "Melbourne Business School welcomes applications from eligible students for a variety of graduate degrees offered by its programme portfolio. These degrees require following attributes for academic study:",
            "The ability to explain and evaluate concepts, theories, and business operations of organisations",
            "Ability to use analytic techniques to solve business problems",
            "Melbourne Business School welcomes applications from students with disabilities and takes reasonable steps to implement adjustments to provide equal participation opportunities for students with disability."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "AACSB"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students are required to achieve a grade of 70% minimum in Data Analysis to progress to Category 2 and Category 3 subjects and students cannot continue in the Master of Analytics Management course without meeting all the requirements below.",
                [
                    "1. Achieved a weighted average mark of at least H2B (70%) in a minimum of 6 subjects; and",
                    "2. Had no more than one grade below 65 in the 6 subjects; and",
                    "3. Had no fails in any of the 6 subjects"
                ],
                "For students who do not meet the above requirements, they may exit the Master of Analytics Management course with an exit award if applicable."
            ],
            "Category 1: Foundation Management subjects": {
                "overview": [
                    [
                        "BUSA90060"
                    ],
                    "Plus any three of the following five subjects:",
                    [
                        "BUSA90243",
                        "BUSA90227",
                        "BUSA90093",
                        "BUSA90001",
                        "BUSA90193"
                    ]
                ]
            },
            "Category 2: Analytics Foundations subjects": {
                "overview": [
                    [
                        "BUSA90493",
                        "BISY90016",
                        "BISY90017",
                        "MGMT90244"
                    ]
                ]
            },
            "Category 3: Analytics Specialised subjects": {
                "overview": [
                    "Any two of the following three subjects:",
                    [
                        "BUSA90521",
                        "FNCE90079",
                        "MKTG90039"
                    ]
                ]
            },
            "Category 4: Applied Analytics Lab Capstone": {
                "overview": [
                    [
                        "BUSA90522"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}