{
    "Course name": "Master of Science (Epidemiology)",
    "Course code": "MC-SCIEPI",
    "Overview text": [
        "The Master of Science (Epidemiology) is a coursework masters degree incorporating a supervised research project.",
        "Epidemiology is the scientific method used to track population health, to find cause of disease (and health) and to identify ways to prevent disease. It is often called the basic science of public health, but its principles extend to clinical research and practice. Epidemiologists are the medical detectives for populations. They solve puzzles about who gets diseases, what causes disease and how to prevent disease.",
        "The Master of Science (Epidemiology) gives students the opportunity to undertake a supervised research project in a field of choice as well as a broad range of coursework subjects including a professional skills component, as a pathway to PhD study or to the workforce"
    ],
    "Overview table": {
        "Award title": "Master of Science (Epidemiology)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "094598J",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1 . In order to be considered for entry, applicants must havecompleted:",
            "an undergraduate degree with a science discipline major and a weighted average mark of at least H3 (65%) in the best 50points in appropriate major or discipline studies at third year.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4.Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note:",
            "Quotas may be applied and preference may be given to applicants with evidence of appropriate preparation or potential to undertake research.",
            "Entry into this stream of the Master of Science (Epidemiology) is subject to the capacity of the department(s) or schools(s) to provide adequate supervision in a research project appropriate to the interests and preparation of the individual student and may be subject to the agreement of a member of academic staff to supervise the project module."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students undertaking the Master of Science - Epidemiology program will complete 200 points comprising:",
                [
                    "Discipline Core subjects (75 points);",
                    "Discipline Elective subjects (25-75 points);",
                    "Professional Skills subjects (25-50 points); and",
                    "Research Project component (25-50 points)."
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Discipline Core subjects": {
            "overview": [
                "Students must take:",
                [
                    "POPH90013",
                    "POPH90014",
                    "POPH90144",
                    "POPH90145",
                    "POPH90243",
                    "POPH90242"
                ]
            ]
        },
        "Discipline Elective subjects": {
            "overview": [
                "Students must complete at least two of the following subjects:",
                [
                    "POPH90093",
                    "POPH90111",
                    "POPH90112",
                    "POPH90271",
                    "POPH90094",
                    "POPH90206",
                    "POPH90020",
                    "POPH90270",
                    "POPH90205",
                    "POPH90058",
                    "POPH90231",
                    "POPH90199",
                    "POPH90217"
                ],
                "Other subjects as approved by the course coordinator.",
                "Students without a background in biology may select up to two approved relevant biology subjects."
            ]
        },
        "Professional Skills subjects": {
            "overview": [
                "Students must take between two and four subjects from:",
                "Business Skills",
                [
                    "BUSA90403"
                ],
                "Communication Skills",
                [
                    "SCIE90012",
                    "SCIE90013"
                ],
                "Science skills",
                [
                    "COMP90072",
                    "MAST90045",
                    "MULT90063",
                    "SCIE90005",
                    "COMP90059",
                    "MAST90101",
                    "SCIE90017"
                ]
            ]
        },
        "Epidemiology Research Project": {
            "overview": [
                "For both the major and minor research project options, these research projects must be completed towards the end of the degree.",
                "Research Project - 50 points (Major Research Project)",
                "Students will gain research experience in Epidemiology by completing a 50-point major research project.",
                "Students completing the major research project must ensure that they have completed a total of 50 credit points, taken over two consecutive semesters  i.e. Part 1 followed by Part 2.",
                "Students must take:",
                [
                    "POPH90278",
                    "POPH90279"
                ],
                "Research Project - 25 points (Minor Research Project)",
                "Students will gain research experience in Epidemiology by completing a 25-point minor research project option.",
                "Students completing the minor research project must ensure that they have completed a total of 25 credit points, taken over two consecutive semesters  i.e. Part 1 followed by Part 2.",
                "Students must take:",
                [
                    "POPH90280",
                    "POPH90283"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The Master of Science offers a pathway to a PhD."
    ]
}