{
    "Course name": "Master of Clinical Ultrasound",
    "Course code": "MC-CU",
    "Overview text": [
        "This online program will be offered to practicing medical professionals who wish to obtain further expertise in medical ultrasound for clinical practice.",
        "The course is designed to provide the knowledge-base necessary for diagnostic-level performance of echocardiography and interpretation; surface ultrasound uses such as ultrasound guided procedures and nerve blocks; and other medical specialist specific ultrasound applications such as vascular ultrasound examination. The aim is to provide advanced knowledge to specialist craft groups to facilitate use of ultrasound relevant to their specialty.",
        "The Master of Clinical Ultrasound is part of a nested program of courses related to the use of clinical ultrasound. The program includes the Graduate Certificate and Graduate Diploma in Clinical Ultrasound."
    ],
    "Overview table": {
        "Award title": "Master of Clinical Ultrasound",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.In order to be considered for entry, applicants must have completed:",
            "a Doctor of Medicine or a Bachelor of Medicine/Bachelor of Surgery (MBBS) or equivalent, or",
            "an undergraduate degree or equivalent in allied health, nursing, physiotherapy, or science.",
            "Meeting this requirement does not guarantee selection.",
            "2.In ranking applications, the Selection Committee will consider:",
            "prior academic qualification and performance",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "To satisfy the requirements of the Master of Clinical Ultrasound students must successfully complete a total of 150 points.",
                "Along the way they can complete the Graduate Certificate and Graduate Diploma in Clinical Ultrasound."
            ]
        },
        "Subject options": {
            "overview": [
                "To satisfy the requirements of the Master of Clinical Ultrasound student must successfully complete a total of 150 points.",
                "Nine compulsory subjects (112.5 points – 12.5 points each subject)",
                [
                    "MEDI90049",
                    "MEDI90056",
                    "MEDI90057",
                    "MEDI90058",
                    "MEDI90059",
                    "MEDI90046",
                    "MEDI90047",
                    "MEDI90048",
                    "MEDI90083"
                ],
                "Three elective subjects (37.5 points, 12.5 points each subject)",
                [
                    "MEDI90050",
                    "MEDI90051",
                    "MEDI90054",
                    "MEDI90100",
                    "MEDI90101",
                    "MEDI90102"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}