{
    "Course name": "Master of Fine Arts (Interdisciplinary Arts Practice)",
    "Course code": "MR-FAIAP",
    "Overview text": [
        "The Master of Fine Arts (Interdisciplinary Arts Practice) is now offered in the consolidated Master of Fine Arts course.",
        "Information on the Master of Fine Arts can be found in the Handbookhere.",
        "If you wish to apply for entry to the Master of Fine Arts, information on admissions is on the Study Hubhere.",
        "You can find details of our discipline areas and all the courses offered by the Faculty of Fine Arts and Musichere.",
        "The Master of Fine Arts aims to provide opportunities for suitably qualified candidates to develop their potential for research, develop mastery in their field of practice and contribute to understandings of contemporary artistic practice and theories of arts and culture. High quality research subjects and independent supervision ensure artistic and intellectual excellence and leadership potential, and learning and training takes place in an international context."
    ],
    "Overview table": {
        "Award title": "Master of Fine Arts (Interdisciplinary Arts Practice)",
        "Year & campus": "2024",
        "CRICOS code": "093578K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "9",
        "Duration": "2 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "Specific Course Entry RequirementsThe Selection Committee will evaluate the applicant's ability to pursue the course successfully using the following criteria.",
            "1. In order to be considered for entry, applicants must have completed:",
            "• an honours degree with at least an H2A (75%) weighted average, including a major relevant to the stream to which entry is sought, or equivalent; or",
            "• a relevant undergraduate degree with at least an H2A (75%) weighted average and two years of documented work experience relevant to the stream to which entry is sought; or",
            "• an undergraduate degree in any discipline and five years of documented work experience relevant to the stream to which entry is sought; or",
            "• five years of documented relevant work experience related to the stream to which entry is sought and demonstrating outstanding artistic ability, together with evidence of ability in academic writing and research or scholarship appropriate for postgraduate study;",
            "and",
            "• performance in one or more of an audition, test, interview, workshop, portfolio or folio presentation, as prescribed by the Academic Board for the stream to which entry is sought.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the selection committee will consider:",
            "• prior academic performance and/or the professional experience; and",
            "• the performance in audition, test, interview, workshop, portfolio or folio presentation.",
            "3. The selection committee may seek further information to clarify any aspect of an application in accordance withthe Selection and Admission into Graduate Research Courses Policy.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceBand 6.5.is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Communication:Students must be able to participate in and produce performances and exhibitions as required; they will also need to communicate effectively and efficiently in oral and written forms. Communication with fellow students, professional and academic staff, and the wider public about their knowledge and application of practising Arts disciplines is essential.Creative, Intellectual and Organisational Abilities:Students require the capacity for high-level creative performance or production. They are also expected to have the ability to develop problem-solving skills and to comprehend disciplinary and crossdisciplinary information. Students must have the ability to establish study plans and prioritise training objectives and outcomes.",
            "Behavioural and Social Attributes:Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. They must take full responsibility for their own participation and learning. Students also contribute to the learning of other students in collaborative environments and must therefore demonstrate a wide range of interpersonal skills which consider the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.Disability:For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Fine Arts is a graduate degree consisting of 200 points normally taking two years of full-time study or part-time equivalent. The degree requires the completion of two coursework subjects - a research methods and a research seminar subject - along with an individual supervised project of research and practice in the area of along with an individual supervised project of research and practice in the area of Interdisciplinary Arts Practice."
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "FINA90002",
                    "FINA90003",
                    "MULT90029"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "At the successful completion of this degree students will be eligible to apply for PhD studies."
    ]
}