{
    "Course name": "Master of Applied Econometrics",
    "Course code": "MC-APPECON",
    "Overview text": [
        "The Master of Applied Econometrics is a two year program that focuses on the practical application of econometric modelling techniques. It combines coursework and research components to equip graduates with the skillset required to guide and inform economic decision making in a data-driven manner. The course will provide a comprehensive curriculum covering core microeconomics and macroeconomics and a suite of econometrics offerings including time series analysis, financial econometrics, microeconometrics, macroeconometrics and structural econometric modelling.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Master of Applied Econometrics",
        "Year & campus": "2024",
        "CRICOS code": "092759B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate or postgraduate degree with a strong analytical and mathematical component with a major in social science, commerce or stem. A first year statistics subject must have been completed.",
            "a personal statement outlining why they wish to be considered for the course; and",
            "the Graduate Record Examination (GRE) unless the applicant has completed an undergraduate degree in Australia or New Zealand or met one of the approved conditions for GRE exemption.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance;",
            "the GRE score unless the applicant has completed an undergraduate degree in Australia or New Zealand or met one of the approved conditions for GRE exemption; and",
            "the personal statement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Notes:",
            "Applicants with an honours degree in economics with a weighted average mark of at least H3 (65%), or a relevant postgraduate degree with a weighted average mark of at least H3 (65%), who have completed subjects which satisfy the prerequisites for second year subjects in the Master of Applied Econometrics may be awarded up to 100 points of credit into the Master of Applied Econometrics."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Business and Economics welcomes applications from students with disabilities. It is University and Faculty policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.",
            "The BCom and Masters degrees of the Faculty of Business and Economics equip graduates with the knowledge and technical skills necessary to understand and participate in the modern business world. The degrees include the following academic requirements for study:",
            "(1) The ability to explain and evaluate concepts, theories, institutional arrangements and operations of modern mixed economies; (2) The ability to critically evaluate the economy, commerce and business in the broader social and political context; (3) The ability to explain and apply concepts across a range of commerce and business disciplines in solving business and policy problems; and (4) The ability to contribute positively to the development of organisations and society in relation to business, government and the commercial professions.",
            "All students of the Faculty’s courses must possess intellectual, ethical, and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the Faculty. Candidates for the BCom degree and for FBE Masters degrees must have abilities and skills in communication; in conceptual, integrative, and quantitative dimensions; and in behavioural and social dimensions.",
            "I. Communication: The student must be able to communicate effectively and efficiently in oral and/or written form. A student must have the ability to clearly and independently communicate knowledge and application of a discipline, principles or practices during assessment tasks, and in some discipline streams.",
            "II. Intellectual‐Conceptual, Integrative and Quantitative Abilities: The student is expected to have the ability to develop problem‐solving skills and demonstrate the ability to establish study plans and priorities. These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving requires all of these intellectual abilities. Students should also have the ability to comprehend complex disciplinary and cross disciplinary information related to the BCom and Masters degrees.",
            "III. Behavioural and Social Attributes: A student must possess behavioural and social attributes that enable them to participate in a complex learning environment and the emotional health required for full utilisation of his/her intellectual abilities. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. Integrity, concern for others, interpersonal skills, interest, and motivation are all personal qualities that are deemed necessary for students enrolled in FBE courses.",
            "Students who feel their disability will prevent them from participating in tasks involving the inherent academic requirements of the BCom and FBE Masters courses are encouraged to contact the Disability Liaison Unit. Adjustments can be provided to minimise the impact of a disability, but students should participate in the course in an independent manner."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Applied Econometrics program consists of 16 semester-length subjects comprising nine core subjects, five electives and two capstone subjects."
            ]
        },
        "Subject options": {
            "overview": [
                "Master of Applied Econometrics"
            ]
        },
        "Semester 1, Year 1": {
            "overview": [
                "Students must take all of the following core subjects:",
                [
                    "ECOM90024",
                    "ECON30020",
                    "ECOM90001"
                ],
                "Students must take one of the following core subjects (depending upon their prior economics background):",
                [
                    "ECON30010",
                    "ECON90063",
                    "ECON90047"
                ]
            ]
        },
        "Semester 2, Year 1": {
            "overview": [
                "Students must take all of the following core subjects:",
                [
                    "ECOM90002",
                    "ECOM90003",
                    "ECOM90004"
                ],
                "Students must take one of the following subjects (depending upon their prior economics background):",
                [
                    "ECON30009",
                    "ECON90045"
                ],
                "If either of these subjects have been taken previously, then students must take one of:",
                [
                    "ECON30002",
                    "ECON30005",
                    "ECON30011",
                    "ECON30019",
                    "ECON30022"
                ]
            ]
        },
        "Semester 1, Year 2": {
            "overview": [
                "Students must take the following subject:",
                [
                    "ECOM90013"
                ],
                "Students must take the following capstone subject:",
                [
                    "ECOM90022"
                ],
                "Students must choose two elective subjects from the following list:",
                [
                    "ECOM90007",
                    "ECOM90020",
                    "ECOM90023",
                    "ECON90075"
                ]
            ]
        },
        "Semester 2, Year 2": {
            "overview": [
                "Students must take the following capstone subject:",
                [
                    "ECOM90021"
                ],
                "Students must choose three elective subjects from the following list:",
                [
                    "ECOM90008",
                    "ECOM90010",
                    "ECOM90011",
                    "ECOM90012",
                    "ECOM90017"
                ],
                "Optional elective, subject to Program Director's approval:",
                [
                    "BUSA90525"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}