{
    "Course name": "Master of Social Change Leadership",
    "Course code": "MC-SCL",
    "Overview text": [
        "The Master of Social Change Leadership is offered to Fellows undertaking the Atlantic Fellows for Social Equity Program (AFSE). The program focusses on developing social change leaders through immersive Indigenous knowledges environments working in critical dialogue with other knowledge systems. Fellows will be equipped with knowledge and skills drawn from a range of disciplines and immersive contexts and take a comparative and global focus. It provides opportunities for Fellows to engage with the wide-ranging dimensions of social change leadership with the goal of working on complex social and environmental issues concerning Indigenous communities.",
        "The program is designed to enable the Fellows to act as catalysts in partnership with communities and organisations to generate Indigenous knowledge informed social change.  This is a comprehensive, interdisciplinary and wide-ranging program that draws on expertise from leading academics in the University of Melbourne."
    ],
    "Overview table": {
        "Award title": "Master of Social Change Leadership",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "113015J",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a) An application to the Atlantic Fellows for Social Equity program, which requires:",
            "At least 5 years of documented work experience in the social change field working with or for Indigenous communities, institutions and peoples across Australia, New Zealand, and/or Pacific Island nations; and",
            "Two references; and",
            "Workplace notification of release (if employed); and",
            "An outline of a social change project proposal (maximum 1000 words); and",
            "A short application video (maximum 1.5 minutes)",
            "Applicants must have been accepted into the Atlantic Fellows for Social Equity program, before applying for the Master of Social Change Leadership.",
            "b) And must have completed either:",
            "a bachelor honours degree or equivalent in a relevant discipline (e.g., education, health, social work, law, arts, or business); or",
            "a three‐year undergraduate qualification and at least 50 credit points, or equivalent, of graduate study in a relevant discipline (e.g., education, health, social work, law, arts, or business); or",
            "a three‐year undergraduate qualification in a relevant discipline (e.g., education, health, social work, law, arts, or business) and at least two years of documented, relevant work experience; or",
            "at least eight years of documented, relevant work experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In assessing applications, the Selection Committee will consider:",
            "Acceptance into the Atlantic Fellows for Social Equity program; and",
            "The documented, relevant work experience, if applicable.",
            "3.The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the University’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band7 is required.",
            "Notes:",
            "Details of the Atlantic Fellows for Social Equity program application are available on theAtlantic Fellows for Social Equity website."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student's participation in the Faculty's programs.",
            "The core participation requirements for study in the Master of Social Change Leadership are:",
            "1. The ability to comprehend complex information related to Indigenous-led social change and the fields in which the Fellow practises;",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines;",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment.",
            "Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact Student Equity and Disability Supporthttps://students.unimelb.edu.au/student-support/student-equity-and-disability-support"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Social Change Leadership requires the successful completion of 100 credit points.  It is completed over one year of study.",
                "To obtain the degree Fellows must complete:",
                [
                    "100 points of compulsory subjects (consisting of four 12.5-point subjects and two 25-point subjects)."
                ],
                "Alternative Exit Point",
                "An early exit point is available for Fellows who commence the Master’s, but do not complete the whole degree. These Fellows may exit the Master of Social Change Leadership*, and apply to graduate with the following award:",
                [
                    "Graduate Certificate in Social Change Leadership (GC-SCL), if they have satisfied the requirements for that award during their enrolment in this Master’s course (i.e., successfully completed 50 credit points of Graduate Certificate core subjects)."
                ],
                "*Fellows must discontinue their enrolment in the MC-SCL without completing the award, to be conferred the exit award."
            ],
            "Year 1 (100 credit points)": {
                "overview": [],
                "Compulsory subjects": {
                    "overview": [
                        [
                            "INDG90002",
                            "INDG90003",
                            "INDG90004",
                            "INDG90005",
                            "INDG90006",
                            "INDG90007"
                        ]
                    ]
                }
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduate Research Degrees",
        "The University of Melbourne's Faculty of Education is widely recognised as a leader in Australian and international education research.",
        "Graduates interested in further study in one ofFaculty of Education’s suite of graduate research degreesmay have several options, depending on their prior qualifications, academic achievement, research experience and professional experience.",
        "Graduates from this course (MC-SCL) may be eligible to apply to theMaster of Education (Research)(960BA).",
        "Note that MC-SCL graduates who gain successful admission to the Master of Education (Research), and who achieve a weighted average mark of at least H2A (75%) across “INDG90004 Collaborative Fieldwork (25pts) and INDG90007 Indigenous Social Change Project (25 pts)” will be granted advanced standing for the 960BA’s 50 point compulsory coursework component (per the limits in the University’sCredit, Advanced Standing and Accelerated Entry Policy). These candidates will proceed to complete the thesis.",
        "Alternatively, Graduates from this course (MC-SCL) who have completed:",
        [
            "the  or",
            "an undergraduate Honours degree"
        ],
        "may be eligible to apply to one of the following Faculty of Education research degrees:",
        [
            "\n (note there are professional experience requirements associated with this degree)"
        ],
        "Entry to these courses is a competitive process and each course has other entry requirements such as a minimum academic entry score which must be met. Please check the Handbook course entry for details of entry requirements.",
        "For more information about graduate research study in Education see theFaculty of EducationResearch Degreespage."
    ]
}