{
    "Course name": "Master of Employment and Labour Relations Law",
    "Course code": "510AA",
    "Overview text": [
        "Major shifts in laws governing the workplace and labour force in Australia and internationally mean that understanding the regulatory framework pertaining to employment and labour relations practices is more important than ever. Employment and labour relations law is ideal for legal practitioners, the public sector, corporate management and human resources/personnel services, trade unions and employer groups. This specialisation caters for legal practitioners as well as non-lawyers with experience and interest in the legal regulation of employment and labour relations. In-depth analysis of recent developments in this complex and evolving area ensures the program remains at the forefront of legal knowledge in this field. The subjectPrinciples of Employment Lawis designed to be of particular assistance to students without previous (or recent) legal study in the area."
    ],
    "Overview table": {
        "Award title": "Master of Employment and Labour Relations Law",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "074995F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "Start Year 2024:",
            "A degree in law (LLB, JD or equivalent) leading to admission to practice, at honours standard, or equivalent;  or ",
            "A degree in law (LLB, JD or equivalent) leading to admission to practice, or equivalent and two years of documented relevant professional experience;  or ",
            "An undergraduate degree in a relevant discipline and two years of documented relevant professional experience;  or ",
            "An undergraduate degree in a relevant discipline; and successful completion of four subjects in a cognate graduate diploma and one year of documented relevant professional experience. ",
            "The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "Mid-Year 2024 intake:",
            "1. In order to be considered for entry, applicants must have completed:",
            "A degree in law (LLB, JD or equivalent) leading to admission to practice, at honours standard, or equivalent;  or ",
            "A degree in law (LLB, JD or equivalent) leading to admission to practice, or equivalent and two years of documented relevant professional experience;  or ",
            "An undergraduate degree in a relevant discipline and two years of documented relevant professional experience;  or ",
            "An undergraduate degree in a relevant discipline; and successful completion of four subjects in a cognate graduate diploma and one year of documented relevant professional experience. ",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:• prior academic performance; and• the professional experience",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments. Applicants are required to satisfy the university’s English language requirements for graduate courses. 4.",
            "4. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.0 overall with no band less than 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne Law Masters welcomes applications from students with disabilities. The inherent academic requirements for study in the Melbourne Law Masters are:",
            "The ability to attend a minimum of 75% of classes and actively engage in the analysis and critique of complex materials and debate;",
            "The ability to read, analyse and comprehend complex written legal materials and complex interdisciplinary materials;",
            "The ability to clearly and independently communicate in writing a knowledge and application of legal principles and interdisciplinary materials and to critically evaluate these;",
            "The ability to clearly and independently communicate orally a knowledge and application of legal principles and interdisciplinary materials and critically evaluate these;",
            "The ability to work independently and as a part of a group;",
            "The ability to present orally and in writing legal analysis to a professional standard.",
            "Students who feel their disability will inhibit them from meeting these inherent academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Principles of Employment Lawis compulsory for students who do not have a law degree from a common law jurisdiction, and it is strongly recommended that this subject be taken before any other employment and labour relations law subjects.",
                "Principles of Employment Lawis also recommended for students who have not studied an equivalent subject in their law degree, or who have not done so recently.",
                "Students must complete 100 credit points in total.",
                "Students who do not have a law degree from a common law jurisdiction must complete;Fundamentals of the Common LawandPrinciples of Employment Law, as well as at least 37.5 credit points from the list of Employment and Labour Relations Law subjects. The remaining subjects can be taken from the Employment and Labour Relations Law subjects and the other subjects list.",
                "Students with a law degree from a common law jurisdiction must complete at least 50 credit points from the list of Employment and Labour Relations Law subjects. The remaining subjects can be taken from the Employment and Labour Relations Law subjects and the other subjects list (excludingFundamentals of the Common Law).Note: Most subjects in the MLM program are 12.5 credit points each. Check individual subject handbook entries for confirmation."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Employment and Labour Relations Law subjects": {
            "overview": [
                [
                    "LAWS70135",
                    "LAWS90086",
                    "LAWS90205",
                    "LAWS70200",
                    "LAWS70025",
                    "LAWS70391",
                    "LAWS90246",
                    "LAWS70218",
                    "LAWS70446",
                    "LAWS70197",
                    "LAWS70371",
                    "LAWS90206",
                    "LAWS70053",
                    "LAWS90273",
                    "LAWS90280"
                ]
            ]
        },
        "Other subjects": {
            "overview": [
                [
                    "LAWS70018",
                    "LAWS90062",
                    "LAWS70190",
                    "LAWS90018",
                    "LAWS70217",
                    "LAWS70264",
                    "LAWS70093",
                    "LAWS70067",
                    "LAWS70117",
                    "LAWS70122",
                    "LAWS90226",
                    "LAWS90048",
                    "LAWS90113",
                    "LAWS70468",
                    "LAWS70460",
                    "LAWS70036"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "A student who completes a masters degree in the Melbourne Law Masters is eligible to apply for entry to the PhD program."
    ]
}