{
    "Course name": "Master of Psychology (Educational and Developmental)/Doctor of Philosophy",
    "Course code": "DR-PHILEDP",
    "Overview text": [
        "The degree of Doctor of Philosophy signifies that the candidate has undertaken a substantial piece of original research that makes a distinct contribution to discipline knowledge. The MPsych(Ed&Dev) PhD will enable students to become practitioners while developing advanced research skills and experience to enhance their capacity to work in professionally related tertiary programs. The course provides a grounding in the theoretical, conceptual, and empirical foundations of professional practice in educational and developmental psychology, and the opportunity for students to develop skills relevant to professional practice through supervised professional experience. The course provides the opportunity for students to undertake a substantial piece of original research within the field of educational and developmental psychology and related practice.",
        "This is a four-year combined course comprising a Masters (Coursework) and a PhD. The coursework subjects and practicums are spread across Years one to three; with the PhD component completed over Years two to four.",
        "Note:",
        "Last updated: 10 February 2024"
    ],
    "Overview table": {
        "Award title": "Master of Psychology (Educational and Developmental)/Doctor of Philosophy",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "056962J",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "4 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "Within the last 10 years, an Australian Psychology Accreditation Council (APAC) accredited four-year undergraduate sequence in psychology (namely a three-year major in psychology as part of an undergraduate degree plus a fourth year Honours specialisation in psychology, or equivalent) with a weighted average mark of at least H2A (75%)* or equivalent; and",
            "A successful application into the Master of Psychology (Educational and Developmental) and be undertaking the first year of the Masters^, before applying for the combined Master of Psychology (Educational and Developmental)/Doctor of Philosophy; and",
            "A research proposal of 5000 – 6000 words; and",
            "Have the written support of a principal supervisor for the thesis.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "The research proposal.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAcademic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the University’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7+is required.",
            "Note:",
            "a) *Entry to the Doctor of Philosophy is highly competitive and typically requires achievement of an H1 (80-100%) overall grade range in the relevant honours or Masters degree.",
            "b) ^Direct entry to this combined program is not available. All applicants must first gain admission and enrol into the Master of Psychology (Educational and Developmental) and may then apply for entry to the combined the Master of Psychology (Educational and Developmental)/Doctor of Philosophy program for the following year. Applications to transfer are opened to currently enrolled Master of Psychology (Educational and Developmental) students towards the end of their first year.",
            "c) To be validly enrolled, applicants not currently registered with the Psychology Board of Australia must apply for Provisional Registration with the Psychology Board of Australia before the start of the first semester of enrolment, and applicants without a Working with Children Card must apply for one before the start of the first semester of enrolment.",
            "d) Applicants with non-Australian qualifications must provide an Australian Psychological Society (APS) comparability assessment with their application, to confirm their eligibility for Associate Membership. See the Australian Psychological Society (APS) website for details:www.psychology.org.au"
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.",
            "The core participation requirements for study in this course are:",
            "1. The ability to comprehend complex information related to educational and developmental psychology.",
            "2. The ability to communicate clearly and independently in assessment tasks and knowledge of the content, principles and practices relating to educational and developmental psychology.",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "4. The ability to undertake professional practice placements independently, including:",
            "a. the ability based on personal maturity to establish a professional relationship with client groups and interact with them appropriately;",
            "b. the ability to create, monitor and maintain a safe physical environment, and a stable and supportive psychological environment;",
            "c. the ability to establish effective relationships with all members of the client and caregiver groups;",
            "d. the ability based on mental and physical health to exercise sound judgment and respond promptly to the demands of client groups, and the personal resilience to cope and maintain their wellbeing under stress.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact Student Equity and Disability Supporthttp://services.unimelb.edu.au/student-equity."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Psychology Accreditation Council",
            "This course is accredited by the Australian Psychology Accreditation Council (APAC), and recognised by the Australian Health Practitioner Regulation Agency, Psychology Board of Australia (PsyBA). Graduates of this course will be qualified to practice as a registered psychologist, become a member of the Australian Psychological Society, and an Associate Member of the College of Educational and Developmental Psychologists."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Psychology (Educational and Developmental)/Doctor of Philosophy requires the successful completion of 162.5 credit points of coursework, and a PhD thesis.",
                "To obtain the combined degree, candidates must complete:",
                [
                    "Ten core subjects (totalling 112.5 credit points of coursework);",
                    "Four field practicums (totalling 50 points of coursework); and",
                    "A PhD thesis."
                ],
                "Detailed information on the thesis is available atGraduate Research Hub.",
                "Note:Admission to and enrolment in the DR-PHILEDP Master of Psychology (Educational and Developmental)/Doctor of Philosophy combined program is a two-stage process:",
                [
                    "1. All applicants must be admitted into the single MC-PSYCHED Master of Psychology (Educational and Developmental) program, and complete the first year via the MC-PSYCHED. Students should show satisfactory progress in their first-year Masters’ subjects (to achieve the required level of academic achievement for entry to the combined Master/PhD program).",
                    "2. During the first year of the Masters, students may then find a PhD supervisor, prepare a research proposal, and apply for entry to the combined DR-PHILEDP Master of Psychology (Educational and Developmental)/Doctor of Philosophy program for the following year. Students must meet the DR-PHILEDP entry requirements. Please note that selection to the PhD is highly competitive, and is not guaranteed."
                ]
            ]
        },
        "Subject options": {
            "overview": [
                "Students undertake the following subjects in this order:"
            ]
        },
        "Year 1": {
            "overview": [
                [
                    "EDUC90229",
                    "EDUC90218",
                    "EDUC90224",
                    "EDUC90223",
                    "EDUC90225",
                    "EDUC90220",
                    "EDUC90227",
                    "EDUC90226",
                    "EDUC90221"
                ]
            ]
        },
        "Year 2": {
            "overview": [
                "The thesis (EDUC80001 PhD Research). Detailed information on the thesis is available atGraduate Research Hub) and",
                [
                    "EDUC90217",
                    "EDUC90253",
                    "EDUC90222",
                    "EDUC90228"
                ]
            ]
        },
        "Year 3": {
            "overview": [
                "The thesis (EDUC80001 PhD Research) and",
                [
                    "EDUC90216"
                ]
            ]
        },
        "Year 4": {
            "overview": [
                "The thesis (EDUC80001 PhD Research)"
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}