{
    "Course name": "Master of Teaching (Early Childhood)",
    "Course code": "MC-TEACHEC",
    "Overview text": [
        "The Master of Teaching (Early Childhood) is for those looking to become registered teachers in early childhood settings. The course focuses on learning and teaching for children aged birth to eight years and provides a qualification for registration to teach in early childhood settings.",
        "The course provides an in-depth understanding of child learning and development, as well as professional practice in early childhood settings so that graduates can operate in multi-disciplinary fields involving care, education and health.",
        "Teacher Candidates receive ongoing support throughout their studies and while on placement, ensuring they graduate confident and ready for a career in teaching. The Faculty of Education's unique Clinical Model of Initial Teacher Education integrates theory and practice, ensuring teachers develop the professional skills to assess, identify and support students of all abilities.",
        "The course promotes a greater understanding of Aboriginal and Torres Strait Islander ways of knowing and being. There is a focus on wellbeing for both the student and the teacher, along with prioritising sustainable practices. The course will prepare graduates to become leaders in the profession and extend their capabilities through work integrated learning that links authentic real world professional experiences with disciplinary theory.",
        "The course may be completed in two years of full time study, or be extended over three years."
    ],
    "Overview table": {
        "Award title": "Master of Teaching (Early Childhood)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "093410A",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.       In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree in any discipline; and",
            "A selection test as determined by the Selection Committee.",
            "Meeting these requirements does not guarantee selection.",
            "2.       In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "The results of the selection test. *",
            "3.       The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAcademic Board ruleson the use of selection instruments.",
            "4.       Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7+is required.",
            "(a)    The Academic Board may prescribe minimum grade point averages for undergraduate studies that must be met by applicants eligible forGuaranteed Entryin a given year. Applicants not eligible for Guaranteed Entry will normally be required to have a grade point average for undergraduate studies at least as high as the prescribed minimum for Guaranteed Entry.",
            "(b)   All applicants must have a valid Working with Children Check prior to the commencement of the Practicum subjects, and for the duration of the program.",
            "(c)    Higher English standards than those normally required for admission to graduate study at the University of Melbourne may be needed for eligibility for Australian teacher registration on graduation. The Selection Committee may require applicants who have not recently completed a full undergraduate degree in Australia or New Zealand to demonstrate English language ability using one of the standard tests approved by the Academic Board atperformance band 7+, even if their prior study of the English language, or their prior education and assessment in an English language university, would normally exempt them from standard testing.",
            "(d) *All applicants must complete the Teacher Capability Assessment Tool (TCAT) selection test and meet all TCAT benchmarks. Details of the selection test are available on the Faculty of Education’sTeacher Capability Assessment Tool (TCAT) website.",
            "(e)Graduate Degree Packagesfor School Leavers",
            "The University of Melbourne offers Graduate Degree Packages to high achieving school leavers, allowing them to secure places (Commonwealth Supported places for domestic students or International fee places) in the Master of Teaching (Early Childhood) provided that they meet certain requirements.",
            "For a Commonwealth Supported Place or an International Fee Place, the applicant must:",
            "Complete an Australian Year 12 or the International Baccalaureate (IB) in 2018 or later either:",
            "—In Australia; or",
            "—Outside Australia and be an Australian citizen;",
            "Achieve an ATAR (or notional ATAR) of at least 95.00;",
            "Apply for a University of Melbourne Graduate Degree Package for commencement in the year following completion of Year 12 or IB via VTAC;",
            "Enrol immediately or be granted deferral in the year following Year 12;",
            "Successfully complete a Bachelor of Arts, Design, Fine Arts, Music or Science at the University of Melbourne including all the specified prerequisite subjects;",
            "Complete the Teacher Capability Assessment Tool during application into the undergraduate degree; and",
            "Commence the Master of Teaching (Early Childhood) within 18 months of completing the undergraduate degree. ",
            "Applicants should refer to theUniversity Handbookfor the additional entry requirements for the undergraduate degrees in theGraduate Degree Package."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.All Teacher Candidates are required to meet the core participation requirements for study in the Faculty of Education which are:",
            "1. The ability to comprehend complex information related to education and the disciplines in which the Teacher Candidate is teaching.",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "3. Behavioural and social attributes that enable a Teacher Candidate to participate in a complex learning environment. Teacher Candidates are required to take responsibility for their own participation and learning. They also contribute to the learning of other Teacher Candidates in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other Teacher Candidates. Assessment may include the outcomes of tasks completed in collaboration with other Teacher Candidates.In courses requiring Teacher Candidates to undertake practicum placements",
            "4. The ability to undertake professional practice placements independently, including:",
            "a.The ability based on personal maturity to establish a professional relationship with students and interact with them appropriatelyb.The ability to communicate to students the subject matter being taught with clarity and in a way that is age-sensitivec.The ability to model literacy and numeracy skills independently for students and in all their interactions meet community expectations of the literacy and numeracy skills teachers should haved.The ability to demonstrate skilfully and safely activities required in particular discipline areas being taught (e.g. physical education activities, science laboratory techniques)e.The ability to create, monitor and maintain a safe physical environment, a stable and supportive psychological environment, and a productive learning environment in their classroomf.The ability to establish effective relationships with all members of the school community, including colleagues, students, and caregiversg.The ability based on mental and physical health to exercise sound judgement and respond promptly to the demands of classroom situations, and the personal resilience to cope and maintain their wellbeing under stress.",
            "Teacher Candidates who feel a disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Children's Education & Care Quality Authority",
            "The Master of Teaching (Early Childhood) is accredited by the Australian Children's Education & Care Quality Authority (ACECQA). Graduates may apply for registration as an early childhood teacher with the Victorian Institute of Teaching (VIT) and can work in Australian early childhood education and care settings with children aged birth to eight years."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Teaching (Early Childhood) requires the successful completion of 200 credit points."
            ],
            "Course Structure Overview": {
                "overview": [
                    "The Master of Teaching (Early Childhood) requires completion of 15 compulsory subjects, that must be taken in the sequence outlined in the Standard Mode, or the Extended Mode. The subjects include:",
                    [
                        "11 x core subjects;",
                        "3 x Engaging and Assessing Learners subjects (which incorporate 55 placement days in early childhood settings and 5 placement days in a primary school setting); and",
                        "1 x Professional Learning Capstone subject."
                    ]
                ]
            },
            "Course Mode Options": {
                "overview": [
                    "The Master of Teaching (Early Childhood) is normally completed over two years (Standard Mode), but can be completed in a longer time frame over three years (Extended Mode), similar to full time and part time modes.",
                    "Standard and Extended Modes"
                ]
            },
            "To obtain the degree (Standard Mode) students must complete:": {
                "overview": [
                    "Year 1 subjects",
                    [
                        "50 credit points of Year 1 (the first semester of the program) subjects",
                        "50 credit points of Year 1 (the second semester of the program) subjects"
                    ],
                    "Year 2 subjects",
                    [
                        "50 credit points of Year 2 (the third semester of the program) subjects",
                        "50 credit points of Year 2 (the fourth semester of the program) subjects"
                    ]
                ]
            },
            "To obtain the degree (Extended Mode) students must complete:": {
                "overview": [
                    "Year 1 subjects",
                    [
                        "37.5 credit points of Year 1 (the first semester of the program) subjects",
                        "37.5 credit points of Year 1 (the second semester of the program) subjects"
                    ],
                    "Year 2 subjects",
                    [
                        "25 credit points of Year 2 (the third semester of the program) subjects",
                        "37.5 credit points of Year 2 (the fourth semester of the program) subjects"
                    ],
                    "Year 3 subjects",
                    [
                        "37.5 credit points of Year 3 (the fifth semester of the program) subjects",
                        "25 credit points of Year 3 (the sixth semester of the program) subjects"
                    ]
                ]
            },
            "Course Mode Considerations": {
                "overview": [
                    "Teacher Candidates should carefully consider suitability of the Standard or Extended course mode options to their personal circumstances as well as the study load implications (e.g. on international student visa, or government support).",
                    "Once enrolled students who wish to change their study mode must first speak to their Course Coordinator, as changing modes can impact on placements, course progression, and may have visa implications for international students. Students should note the following points should they wish to request to change modes:",
                    [
                        "Change from Standard to Extended mode – complete an Enrolment Assistance Form via the link below and notify your Course Coordinator and the Faculty Placements team.",
                        "Change from Extended to Standard mode – must be discussed with your Course Coordinator (and is only permissible in exceptional circumstances).",
                        "International students – should consult with the visa team and submit a Student Visa inquiry via the link below."
                    ],
                    "Student Advice and Help (includes Enrolment Assistance and Student Visa enquiry links)"
                ]
            },
            "Progression Rules": {
                "overview": [
                    "1. LITERACY AND NUMERACY TEST FOR INITIAL TEACHER EDUCATION STUDENTS",
                    [
                        "The Australian Commonwealth Government’s Literacy and Numeracy Test for Initial Teacher Education Students (LANTITE) is a compulsory test for Initial Teacher Education students administered by the Australian Council for Educational Research (independently of The University of Melbourne).",
                        "The Faculty of Education requires each Teacher Candidate to satisfactorily complete the LANTITE by the end of the first calendar year of their enrolment in the Master of Teaching (Early Childhood) to continue the course.",
                        "Failure to satisfactorily complete the LANTITE by this progression point will result in referral to the Faculty of Education Course Academic Progress Committee and may result in exclusion from the course until the LANTITE is satisfactorily completed.",
                        "An excluded Teacher Candidate may be granted an early exit award of a Graduate Diploma in Pedagogy* (if they have satisfactorily completed 100 credit points of the course). Alternatively, they may be withdrawn from the course if they are not able to complete the LANTITE progression requirement within the guidelines set by the LANTITE test administering body.",
                        "\n\n",
                        [
                            []
                        ]
                    ],
                    "* Note that the Graduate Diploma in Pedagogy (Early Childhood) is not a qualification for registration to teach in early childhood settings.",
                    "2. COURSE ACADEMIC PROGRESS COMMITTEE",
                    "Any Teacher Candidate who does not satisfactorily complete a subject, or meet the course progression rules, will be called to attend a Course Academic Progress Committee (CAPC) meeting after results have been certified for each subject. Teacher Candidates in these categories will be invited to make an oral and/or written submission to the Committee as per the requirements of the CAPC process."
                ]
            },
            "Subject Options": {
                "overview": [
                    "See subject list and course mode structures under:",
                    "Majors, minors & specialisations"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Professional and Continuing Education DegreesThe University of Melbourne's Faculty of Education is widely recognised as a leader in continuing professional education. Graduates who wish to further their professional studies may consider aMaster of Educationor a specialist master’s degree. Entry to these courses is based on academic merit and may also require professional experience. For more information about continuing professional study in Education, see theFoE Coursespage.",
        "",
        "",
        "Graduate Research Degrees",
        "The University of Melbourne's Faculty of Education is widely recognised as a leader in Australian and international education research. Graduates interested in further study in one ofFoE’s suite of graduate research degreesmay have several options, depending on their prior qualifications, academic achievement, research experience and professional experience.",
        "",
        "Graduates from this course (MC-TEACHEC) may be eligible to apply to:",
        [
            "the ;",
            "the ; or",
            "the  (with applicable professional experience)."
        ],
        "",
        "Alternatively, Graduates from this course (MC-TEACHEC) who have completed:",
        [
            "the ;",
            "the ; or",
            "an undergraduate Honours degree"
        ],
        "",
        "may be eligible to apply to one of the following FoE research degrees:",
        [],
        "",
        "",
        "Entry to these courses is a competitive process and each course has other entry requirements such as a minimum academic entry score which must be met. Please check the Handbook course entry for details of entry requirements.",
        "For more information about graduate research study in Education see theFoE Research Degreespage."
    ]
}