{
    "Course name": "Master of Supply Chain Management",
    "Course code": "MC-SCM150",
    "Overview text": [
        "This innovative course draws on industry expertise, emphasising a strategic approach to supply chain management. The course focuses on global best practice and makes extensive use of “real life” case studies. The course will cover core and contemporary supply chain topics relevant to practitioners in both manufacturing and service sectors and is designed for those who wish to advance their knowledge and careers in supply chain management. It is expected that students will come from diverse sectors including retail, manufacturing, mining, transport, public agencies, defence and primary industry.",
        "Last updated: 23 March 2024"
    ],
    "Overview table": {
        "Award title": "Master of Supply Chain Management",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree; and",
            "a minimum of two years of documented professional experience (preferably some of which is in a supply chain, logistics or procurement role); and",
            "a personal statement outlining why they wish to be considered for the course.",
            "Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:prior academic performance; and",
            "the professional experience and",
            "the personal statement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. The minimum English language requirements for this course areBand 6.5.",
            "Guaranteed PathwayFor those applicants with an undergraduate degree in any discipline who are assessed as not meeting the University of Melbourne WAM-equivalent requirement for entry into the Master of Supply Chain Management, a place in the Graduate Certificate in Business may be offered. Successful completion of the Graduate Certificate with a minimum average WAM of 65, and no failed subjects, provides a guaranteed pathway into the Master of Supply Chain Management. Advanced Standing for subjects completed in the Graduate Certificate in Business will be provided where subjects undertaken align with equivalent foundation subjects to be completed as part of this degree.",
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree; and",
            "a minimum of two years of documented professional experience (preferably some of which is in a supply chain, logistics or procurement role);",
            "Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the professional experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required (with no individual band less than 6.5).",
            "Notes:",
            "1. Applicants with an undergraduate degree in a business/commerce or related discipline, or with a degree in any discipline with appropriate business breadth or minor, may be awarded up to 50 points of credit.",
            "Guaranteed PathwayFor those applicants with an undergraduate degree in any discipline who are assessed as not meeting the University of Melbourne WAM-equivalent requirement for entry into the Master of Supply Chain Management, a place in the Graduate Certificate in Business may be offered. Successful completion of the Graduate Certificate with a minimum average WAM of 70, and no failed subjects, provides a guaranteed pathway into the Master of Supply Chain Management. Advanced Standing for subjects completed in the Graduate Certificate in Business will be provided where subjects undertaken align with equivalent foundation subjects to be completed as part of this degree."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Supply Chain Management is 150 points comprising:",
                [
                    "Four 12.5 point foundation subjects (50 points)",
                    "Eight 6.25 point core subjects (50 points)",
                    "Two elective subjects (25 points)",
                    "Four 6.25 point capstone subjects (25 points)"
                ]
            ],
            "Foundation Subjects": {
                "overview": [
                    "Students must takeallof the following subjects:",
                    [
                        "ECON90077",
                        "MGMT90239",
                        "FNCE90075",
                        "MKTG90038"
                    ]
                ]
            },
            "Core Subjects": {
                "overview": [
                    "Students must takeallof the following subjects:",
                    [
                        "MGMT90255",
                        "MGMT90256",
                        "MGMT90257",
                        "MGMT90258",
                        "MGMT90272",
                        "MGMT90273",
                        "MGMT90274",
                        "MGMT90276"
                    ]
                ]
            },
            "Elective subjects": {
                "overview": [
                    "Students must select 25 points of elective subjects from this list:",
                    [
                        "MGMT90264",
                        "MGMT90265",
                        "MGMT90266",
                        "MGMT90267",
                        "MGMT90268",
                        "MKTG90050",
                        "BUSA90530"
                    ]
                ]
            },
            "Capstone subjects": {
                "overview": [
                    "Students must take the following subjects in their final semester/s of study:",
                    [
                        "MGMT90278",
                        "MGMT90275",
                        "MGMT90279",
                        "MGMT90277"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}