{
    "Course name": "Master of Science (Earth Sciences)",
    "Course code": "MC-SCIEAR",
    "Overview text": [
        "The Master of Science (Earth Sciences) is a coursework masters degree incorporating a substantial research project.",
        "The Master of Science gives students the opportunity to undertake a substantive research project in a field of choice as well as a broad range of coursework subjects including a professional skills component, as a pathway to PhD study or to the workforce.",
        "The program includes collaboration between Earth Sciences/Geosciences departments from at least two other institutions (originally Monash and La Trobe universities, under our Victorian Institute of Earth and Planetary Sciences or ‘VIEPS’ legal agreement and partnership) expanding in the last decade to involve cooperation between several institutions (including Melbourne). Cooperation at this national level provides students from all participating institutions with the opportunity to access the best and broadest array of advanced coursework in the Earth Sciences discipline.",
        ""
    ],
    "Overview table": {
        "Award title": "Master of Science (Earth Sciences)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "094596M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• An undergraduate degree with a major in Agricultural Science, Atmospheric and Ocean Sciences, Biochemistry, Botany, Chemistry, Engineering, Environmental Science, Food Science, Genetics, Geography, Geology, Mathematics, Microbiology, Physics, Plant Science or Zoology, with a weighted average mark of at least H3 (65%) in the best 50 points in that major or relevant discipline studies at third year.Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:• Prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note:• Quotas may be applied and preference may be given to applicants with evidence of appropriate preparation or potential to undertake research.• Entry into  this stream of the Master of Science is subject to the capacity of the department(s) or schools(s) offering the program stream to provide adequate supervision in a research project appropriate to the interests and preparation of the individual student and may be subject to the agreement of a member of academic staff to supervise the project module."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete 200 pts including:",
                [
                    "Discipline Core subjects (50 points);",
                    "Discipline Elective subjects (0 - 12.5 points);",
                    "Professional Skills subjects (12.5 - 25 points);",
                    "Research Project (125 points)."
                ],
                "Two streams are offered in the Master of Science (Earth Sciences program): the Atmospheric Science stream and the Geology stream."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Discipline Core - Atmospheric Science stream": {
            "overview": [
                "Students must take 50 points of the following:",
                [
                    "ATOC90002",
                    "ATOC90010",
                    "ATOC90011",
                    "ATOC90012",
                    "ATOC90013",
                    "ATOC90014",
                    "ATOC90015",
                    "ATOC90016",
                    "ATOC90017",
                    "ERTH90026"
                ],
                "* Students who satisfy the mathematics prerequisites for the 3rd-year subjects of the Atmospheric Science major are permitted to substitute one 3rd-year or level 9 Atmospheric Science subject in place of any core discipline subject, after first obtaining the permission of the Masters Coordinator."
            ]
        },
        "Discipline Elective - Atmospheric Science stream": {
            "overview": [
                "Students must choose a further 12.5 points from level 9 Earth Sciences subjects, Professional Skills subjects or 300-level Science subjects. One elective from another stream within the Master of Science, Master of Environment or the Master of Energy Systems may also be approved on a case-by-case basis."
            ]
        },
        "Discipline Core - Geology stream": {
            "overview": [
                "Students must take 50 points of the following subjects, 25 points of which are required to correspond to their thesis topic:",
                [
                    "ERTH90033",
                    "ERTH90034",
                    "GEOL90005",
                    "GEOL90027",
                    "GEOL90028",
                    "GEOL90030",
                    "GEOL90031",
                    "GEOL90032",
                    "GEOL90033",
                    "GEOL90034",
                    "GEOL90043",
                    "GEOL90044",
                    "GEOL90045",
                    "GEOL90046",
                    "GEOL90048",
                    "GEOL90050",
                    "GEOL90051",
                    "GEOL90052",
                    "GEOM90005",
                    "GEOM90008",
                    "GEOM90044"
                ]
            ]
        },
        "Discipline Elective - Geology stream": {
            "overview": [
                "Students must also take a further 12.5 points of approved coursework subjects, selected from any of the list below, the list of discipline core subjects, professional skills subjects, or from 300-level geology subjects. Electives from another stream within the Master of Science, Master of Environment or Master of Energy Systems may also be approved on a case-by-case basis. Students who satisfy the prerequisites for the 3rd-year subjects of the Geology major are permitted to substitute one 3rd-year subject in place of any core discipline subject, after first obtaining the permission of the Masters Coordinator.",
                [
                    "ERTH90062",
                    "ERTH90063"
                ]
            ]
        },
        "Professional Skills": {
            "overview": [
                "Students must take 12.5 to 25 points of the following subjects:",
                [
                    "BUSA90403",
                    "MAST90045",
                    "SCIE90005",
                    "MAST90044",
                    "MAST90007",
                    "SCIE90013",
                    "SCIE90017",
                    "SCIE90012",
                    "COMP90059",
                    "COMP90072",
                    "LAWS90203",
                    "MULT90063"
                ]
            ]
        },
        "Research Project": {
            "overview": [
                "Students enrolled in this program are required to complete a 125 point Research Project. Students will gain research experience in Earth Sciences by completing an original research project in their main field of interest. The amount of work completed in this project should be comparable to that undertaken for a published journal article, and students will be encouraged to submit their work for publication. Although the assessment weighting for the literature review may be viewed as low given the word limit, particularly when compared with the final thesis, the former is largely a ‘reading topic’, from which the student is expected to place their research project into a broader context. In contrast, and as noted above, the final thesis is expected to be a far more rigorous scientific document, showing an appropriate level of insight and scientific interpretation of results, and be of publishable quality.",
                "Assessment is based on the sequential completion of:",
                [
                    "a research presentation of the research project (3%) within the study period leading to the completion of the first 50 points;",
                    "a literature review of no more than 4,000 words (5%) within the study period leading to the completion of the first 50 points;",
                    "a project-related oral presentation within two months of the completion of 125 points, i.e. the conclusion of the project (7%);",
                    "a concise thesis of no more than 25,000 words (85%) due at the completion of 125 points, i.e. at the end of the final research project subject part; and",
                    "research project reviews at the end of each semester (hurdle)"
                ],
                "These assessment requirements are applicable to the entire 125 point Research Project.",
                "The research project subject will be taken over consecutive semesters each worth 12.5, 25, 37.5 or 50 points depending on a full-time or part-time study commitment. Students must commence the Research Project in their first semester of study and the project will continue until the 125 points are achieved. The student is entitled to a total of 4 to 8 weeks of recreational leave for the 125 point subject. For how long and at what time within the enrolment the actual period of leave is to be taken needs to be negotiated with a student’s supervisor. The Research Project will be due for submission by the end of the formal examination period if an earlier date is not specified.",
                "Research Project (125 points)",
                "Students may enrol in a combination of research project subjects and coursework subjects during their enrolment as long as once the Research Project is commenced, the consecutive enrolment requirement is met and they have completed a total of 125 points for the research project by the end of their course.",
                "*Note:in the case of part-time studies, students will first enrol in Earth Sciences Research Project Pt1, and then progress through to Pt2, Pt3,Pt4 Cnt.andPt5.",
                "Students may only progress through Earth Sciences Research Project subjects upon successful completion of the earlier project component.",
                [
                    "ERTH90035",
                    "ERTH90036",
                    "ERTH90037",
                    "ERTH90038"
                ],
                [
                    "ERTH90039",
                    "ERTH90040",
                    "ERTH90041",
                    "ERTH90042"
                ],
                [
                    "ERTH90043",
                    "ERTH90044",
                    "ERTH90045",
                    "ERTH90046"
                ],
                [
                    "ERTH90047",
                    "ERTH90048",
                    "ERTH90049",
                    "ERTH90050"
                ],
                "For Part Time Course Enrolments:",
                [
                    "ERTH90055",
                    "ERTH90053",
                    "ERTH90054",
                    "ERTH90052"
                ],
                [
                    "ERTH90057",
                    "ERTH90056",
                    "ERTH90058",
                    "ERTH90059"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The Master of Science offers a pathway to a PhD."
    ]
}