{
    "Course name": "Master of Laws (Global Competition and Consumer Law)",
    "Course code": "MC-LAWGCCL",
    "Overview text": [
        "The Master of Laws (Global Competition and Consumer Law) is an innovative and advanced international course that responds to the proliferation of competition and consumer policies and laws around the world. Competition policy and law are a crucial means of driving economic growth, higher living standards and productivity at national and global levels.",
        "This course provides interdisciplinary knowledge and skills through subjects that grapple with the legal, regulatory, economic, political, institutional and social facets of competition policy, law and enforcement. The course draws on the experiences of the major jurisdictions in this field, the United States and European Union, as well as those from other jurisdictions, including Australia.",
        "The course provides students with specialised expertise and skills to tackle the complex challenges raised by the design and application of competition systems. It is designed for professionals in the private and public sectors who are aspiring to build or advance a career in this field. Whether online or on-campus, the course facilitates close rich engagement with globally-renown experts and a diverse network of like-minded peers."
    ],
    "Overview table": {
        "Award title": "Master of Laws (Global Competition and Consumer Law)",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "In order to be considered for entry, applicants must have completed:",
            "A degree in law (LLB, JD or equivalent) leading to admission to practice, or equivalent; and one year of documented relevant professional experience;or\n",
            "A degree in law (LLB, JD or equivalent) leading to admission to practice, at honours standard, or equivalent; or\n",
            "A degree in law (LLB, JD or equivalent) leading to admission to practice, or equivalent; and four subjects towards the Graduate Diploma (Global Competition and Consumer Law), with a minimum of 65% in each.",
            "Meeting these requirements does not guarantee selection.",
            "In ranking applications, the Selection Committee wil consider:",
            "prior academic performance, and",
            "the professional experience",
            "The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "Applicants are required to satisfy the university's English language requirements for graduate courses."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne Law Masters welcomes applications from students with disabilities. The inherent academic requirements for study in the Melbourne Law Masters are:",
            "The ability to use a computer, including read material on screen, to a competent standard;",
            "The ability to read, analyse and comprehend complex written legal materials and complex interdisciplinary materials;",
            "The ability to clearly and independently communicate in writing a knowledge and application of legal principles and interdisciplinary materials and to critically evaluate these;",
            "The ability to clearly and independently communicate orally a knowledge and application of legal principles and interdisciplinary materials and critically evaluate these;",
            "The ability to work independently and as a part of a group;",
            "The ability to present orally and in writing legal analysis to a professional standard.",
            "Students who feel their disability will inhibit them from meeting these inherent academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete 100 credit points of study from the prescribed list of subjects, of which 25 credit points will represent a capstone experience in the course.",
                "LAWS90073 Research Projectmust be taken as a capstone subject along with one of the following subjects that have a research paper option:",
                [
                    "Australian Consumer Law",
                    "Chinese Competition Policy and Law",
                    "Competition Law and Intellectual Property",
                    "Competition Law in a Globalised World",
                    "EU Competition Law",
                    "Institutions",
                    "International Trade and Competition Law"
                ],
                "Foundations: Competition Law and Economicsis a prerequisite for several other subjects."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Intensive teaching period (mix of delivery modes)": {
            "overview": [
                [
                    "LAWS70380",
                    "LAWS90095",
                    "LAWS70046",
                    "LAWS70385",
                    "LAWS70208",
                    "LAWS70082"
                ]
            ]
        },
        "Extended teaching period (online learning)": {
            "overview": [
                [
                    "LAWS90064",
                    "LAWS90070",
                    "LAWS90065",
                    "LAWS90071",
                    "LAWS90072",
                    "LAWS90073",
                    "LAWS90066"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Completion of this course enables a student to proceed to further graduate coursework or higher degree research programs."
    ]
}