{
    "Course name": "Master of Landscape Architecture",
    "Course code": "MC-LARCH",
    "Overview text": [
        "Landscape architecture is a unique discipline that acts as a bridge between the arts and sciences, design and environment. Landscape architecture engages in core ecological, cultural and social issues in both urban and rural societies.",
        "The Master of Landscape Architecture allows students with no undergraduate background in landscape architecture to enrol directly in a master's program and is a distinctive feature of the University of Melbourne. The first year of study is carefully structured to allow students from diverse backgrounds to develop the required knowledge and foundations in design, history and physical systems before joining second year entry point students (with a cognate background).",
        "The Master of Landscape Architecture is also available to students who have an undergraduate background in landscape architecture, including our Bachelor of Environments graduates with a major in Landscape Architecture, most often with 100 points of advanced standing.",
        "The Master of Landscape Architecture at the University of Melbourne is underpinned by a strong grounding in design, ecology and urbanism. These strengths are paralleled by a comprehensive history and theory stream encompassing contemporary landscape architecture, architecture and urban design theory, cross cultural issues, including indigenous perspectives for sustainable societies.",
        "This course is part of an accelerated professional degree for students from non-cognate undergraduate degrees. The dominant mode of teaching and learning is through design studios which are each 25 points. To be successful in this degree, a commitment of at least 25 points a semester is necessary.",
        "Note:Semester 2 (mid-year) entry may be available to students with an undergraduate degree in Landscape Architecture, or with a cognate degree. Entry (with advanced standing) will be offered on a case by case basis."
    ],
    "Overview table": {
        "Award title": "Master of Landscape Architecture",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "061209M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time or 72 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.       In order to be considered for entry, applicants must have completed:",
            " an undergraduate degree in any discipline with a weighted average mark of at least H3 (65%), or equivalent; and",
            "a personal statement which outlines relevant prior study, work experience and motivation to undertake the course; and, for students not seeking credit:",
            "a 250-word essay on one designed or vernacular work of landscape architecture that the applicant has seen and found significant.",
            "Meeting these requirements does not guarantee selection.",
            "2.       In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the personal statement; and, for students not seeking credit",
            "the essay; and, for students seeking credit",
            "the portfolio.",
            "3.       The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4.       Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note.",
            "Applicants with the following may be awarded up to 100 points of credit:",
            "an undergraduate degree with a landscape architecture major with a weighted average mark of at least H3 (65%), or equivalent; and",
            "a design portfolio in a format as specified by the Selection Committee.",
            "Graduate Degree Packages for School Leavers",
            "The University of Melbourne offers Graduate Degree Packages to high achieving school leavers, allowing them to secure places (Commonwealth Supported Places for domestic students or International fee places) in the Master of Landscape Architecture provided that they meet certain requirements.",
            "For a Commonwealth Supported Place or an International Fee Place, the applicant must:",
            "complete an Australian Year 12 or the International Baccalaureate (IB) in 2018 or later either:",
            "—in Australia; or",
            "—outside Australia and be an Australian citizen;",
            "achieve an ATAR (or notional ATAR) of at least 96.00;",
            "apply for a University of Melbourne Graduate Degree Package for commencement in the year following completion of Year 12 or IB via VTAC;",
            "enrol immediately or be granted deferral in the year following Year 12;",
            "successfully complete a Bachelor of Design (majoring in Landscape Architecture) at the University of Melbourne including all the specified prerequisite subjects;",
            "achieve a minimum weighted average mark of H3 (65%) in their undergraduate degree; and",
            "commence the Master of Landscape Architecture within 18 months of completing the undergraduate degree.",
            "Applicants eligible for entry via a Graduate Degree Package will not be required to complete a personal statement as part of their application.",
            "Applicants should refer to the University handbook for the additional entry requirements for the Bachelor of Design.",
            "Additional notes",
            "(a) Personal statement format for applicants not eligible for credit allowed under the Resolution on Selection.",
            "The personal statement should include evidence of the applicant’s interest in design and aptitude for creative thinking through design. Evidence can include photographic essays, photographs of executed works of visual art, prose, published writing, graphic design, records of multi-media design and design processes from other disciplines. This material should be incorporated into the personal statement and presented in an A4 or A3 format.",
            "(b) Portfolio format (all applicants)",
            "The design portfolio is assessed digitally and must be saved as one PDF file in landscape format. The file size of your portfolio should not exceed 10 MB, and the number of pages should not exceed 20 single pages. Note that as portfolios are evaluated digitally images should be reproduced at a sufficient scale and resolution to be easily readable with limited zooming or scrolling. Elaborate formats that reduce the available page space for the design images should be avoided.",
            "The design portfolio should focus on design work rather than, for example, life or still-life drawing skills. Portfolios should be drawn largely from design studio subject(s) the applicant has completed. Applicants submitting work done in the context of employment should explain their role in the work produced with brief notes. It is most helpful to see a variety of kinds of drawings and images: free hand diagrams, computer images, two-dimensional (plans, sections, elevations) and three-dimensional studies, photographs of physical models. , design documentation (construction, site engineering, plant knowledge).",
            "Guaranteed Transfer into Commonwealth Supported Place",
            "Students with a fee place in this course who complete 100 points of the course with a weighted average of at least 75% and who are eligible for a Commonwealth Supported Place will be guaranteed a transfer to a Commonwealth Supported Place for the remainder of the course.",
            "For information about how to applyclick here.."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne School of Design is the graduate school of the Faculty of Architecture, Building and Planning. It offers professional entry programs in Architecture, Construction Management, Landscape Architecture, Property and Urban Planning. It offers specialist development programs in Property Valuation, Planning and Design and in Urban Design.The Melbourne School of Design welcomes applications from students with disabilities. It is the University and Faculty (Architecture, Building and Planning) policy to take reasonable steps to make reasonable adjustments so as to enable students’ participation in degrees offered by the Melbourne School of Design (MSD).A candidate for degrees offered in the MSD must have abilities and skills which include the following: observation; communication; motor; conceptual, integrative, and quantitative; and behavioural and social. Adjustments can be provided to minimise the impact of a disability, however, particularly at Masters level, students need to be able to participate in programs in an independent manner and with regard to their safety and the safety of others.(i)Observation: Candidates must be able to read text, diagrams, maps, drawings and numerical data. Candidates should be able to observe details at a number of scales and to record useful observations of environmental contexts.(ii)Communication: Candidates should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. Candidates must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing, presenting one's own work in front of a large group, receiving and responding to feedback about one's own work in a public setting. Assessment in studio subjects will involve 'crits' where students present their own work in front of a large group, where they will receive and respond to feedback about their work in a public setting. Crits are an integral part of working in the industry and are an inherent requirement of the course.(iii)Motor: Candidates should have sufficient motor function to elicit information from environmental contexts. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments. Candidates should have sufficient motor ability to prepare documentation of analytic texts, drawings and models of findings and for the reparation of proposals for environmental interventions via digital or other means. Candidates should have the ability to actively participate in appropriate site and/or design studio-based activities.(iv)Intellectual-Conceptual, Integrative and Quantitative Abilities: These abilities include measurement, calculation, reasoning, analysis, synthesis and, importantly, the ability to interpret results of such work. Problem resolution, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, given the disciplines pursued in the SD, candidates should be able to comprehend three-dimensional relationships and to understand the spatial relationships in environmental structures of a wide range of scales – from smaller than the individual through individual buildings and urban spaces to large geographic areas. Further, graduate study entails learning to master one’s own abilities and skills and to deploy them strategically. This requires further developing skills in both reflective and reflexive thinking and being able to practice these skills.(v)Behavioural and Social Attributes: A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. Assessment in studio subjects will involve 'crits' where students present their own work in front of a large group, where they will receive and respond to feedback about their work in a public setting. Crits are an integral part of working in the industry and are an inherent requirement of the course.Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "This course is currently accredited by the Australian Institute of Landscape Architects (AILA)."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "300 Point EntryAll student must complete:",
                [
                    "250 points of core subjects (including the capstone subject: ABPL90375 Landscape Architecture Design Thesis.",
                    "25 points of Landscape Architecture Electives.",
                    "25 points of Multidisciplinary Electives."
                ],
                "200 Point EntryAll students must complete:",
                [
                    "150 points of core subjects (including the capstone subject: ABPL90375 Landscape Architecture Design Thesis.",
                    "25 points of Landscape architecture electives.",
                    "25 points of multidisciplinary electives."
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "NOTE :",
        [
            "Completion of ABPL90375 Landscape Architecture Design Thesis is necessary research preparation for doctoral study.",
            "From time to time, a selection of student work completed as part of this program will be reviewed by the relevant accreditation panel(s) as a requirement of the accreditation process."
        ]
    ]
}