{
    "Course name": "Master of Learning Intervention",
    "Course code": "MC-LI",
    "Overview text": [
        "The Master of Learning Intervention provides training to teachers and early childhood educators in understanding the learning and support needs of children and young people with disabilities, learning difficulties and hearing loss enrolled in educational settings. This course is also appropriate for allied health and other education professionals engaged in working with this cohort of children and young people, their families and teachers.",
        "Candidates enrolled in the Master of Learning Intervention can choose to specialise in disability, learning difficulties or deaf education. In addition, students can choose to study Stream A or Stream B.",
        "The Learning Intervention Internship (Stream A) is suitable for teachers who are eligible for VIT registration. Stream A requires students to design, implement and evaluate an educational intervention to support learners with disabilities, learning difficulties or hearing loss in educational settings. This stream involves 45 days of professional experience, including 30 days of placement in approved education settings.",
        "The Learning Intervention Minor Projects (Stream B) is suitable for allied-health practitioners, early childhood educators, international students, and teachers interested in research. In this stream two minor projects replace the professional experience.",
        "Please note that the Master of Learning Intervention does not provide an initial qualification for registration to teach in Australia."
    ],
    "Overview table": {
        "Award title": "Master of Learning Intervention",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "085104M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 12 months full-time or 24 months part-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "either",
            "• a four-year education degree, or equivalent; or",
            "• a three-year undergraduate qualification and a fourth-year level education qualification, or equivalent; or",
            "• a three-year undergraduate qualification in an area related to education (such as social work, speech pathology, psychology or occupational therapy) and at least two years of documented, relevant work experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "• prior academic performance; and",
            "• work experience if relevant.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAcademic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.",
            "The core participation requirements for study in the Faculty of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education.",
            "2. The ability to communicate clearly and independently in assessment tasks knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "In courses requiring students to undertake practicum placements",
            "1. The ability to undertake professional practice placements independently, including:a. the ability based on personal maturity to establish a professional relationship with students and interact with them appropriately;b. the ability to communicate to students the subject matter being taught with clarity and in a way that is age-sensitive;c. the ability to model literacy and numeracy skills independently for students and in all their interactions meet community expectations of the literacy and numeracy skills teachers should have;d. the ability to demonstrate skillfully and safely activities required in particular discipline areas being taught (e.g. physical education activities, science laboratory techniques);e. the ability to create, monitor and maintain a safe physical environment, a stable and supportive psychological environment, and a productive learning environment in their classroom;f. the ability to establish effective relationships with all members of the school community, including colleagues, students, and caregivers;g. the ability based on mental and physical health to exercise sound judgment and respond promptly to the demands of classroom situations, and the personal resilience to cope and maintain their wellbeing under stress.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Victorian Institute of Teaching",
            "The Master of Learning Intervention is endorsed by the Victorian Institute of Teaching as a continuing education program in Special Education."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Learning Intervention requires the successful completion of 100 credit points.",
                "The course is one year of full time study, or two years of part time study.",
                "Completion of one specialisation is required.",
                "To obtain the degree students must complete:",
                "Specialisation subject requirement:",
                [
                    "62.5 credit points of all five core subjects from one specialisation"
                ],
                "Elective subject requirement:",
                [
                    "12.5 credit points of elective subjects from the options outside their specialisation"
                ],
                "Capstone subject requirement:",
                [
                    "25 credit points of Capstone Stream A subjects or 25 credit points of Capstone Stream B subjects"
                ],
                "25 credit points of Capstone Stream A subjectsor25 credit points of Capstone Stream B subjects",
                "Notes:",
                [
                    "Capstone subjects must be completed in the final 50 credit points of the program.",
                    "The Learning Intervention Internship (Stream A) is suitable for teachers eligible for VIT registration.",
                    "The Learning Intervention Minor Projects (Stream B) is suitable for allied-health practitioners, early childhood teachers, international students, and teachers interested in research."
                ],
                "Specialisation options are:",
                [
                    "Deaf Education",
                    "Disability",
                    "Learning Difficulties"
                ]
            ],
            "Subject Options": {
                "overview": [
                    "Specialisation subjects",
                    "Please refer to the specialisation page in Major, Minors and specialisations.",
                    "Elective subjects",
                    [
                        "EDUC91200",
                        "EDUC90194",
                        "EDUC90505",
                        "EDUC90507"
                    ],
                    "Capstone: Stream A",
                    "EDUC90846 Learning Intervention 2 must be taken in the final semester of the course.",
                    [
                        "EDUC90845",
                        "EDUC90846"
                    ],
                    "Capstone: Stream B",
                    "EDUC90334 Minor Project in Education 2 must be taken in the final semester of the course.",
                    [
                        "EDUC90335",
                        "EDUC90334"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduate Research Degrees​",
        "The University of Melbourne's Faculty of Education is widely recognised as a leader in Australian and international education research. ​",
        "Graduates interested in further study in one ofFaculty of Education’s suite of graduate research degrees​ may have several options, depending on their prior qualifications, academic achievement research experience and professional experience.",
        "Graduates from this course (MC-LI) may be eligible to apply to either:",
        [
            "the Graduate Certificate in Educational Research or",
            "the Master of Education (Research). ​"
        ],
        "Graduates who have completed:",
        [
            "the Graduate Certificate in Educational Research or",
            "the Master of Education (Research), or",
            "an undergraduate Honours degree"
        ],
        "may be eligible to apply to one of the following Faculty of Education research degrees:",
        [
            "Doctor of Philosophy-Education (PhD)",
            "\nDoctor of Education (note there are professional experience requirements associated with this degree)",
            "Master of Philosophy - Education"
        ],
        "Entry to these courses is a competitive process and each course has other entry requirements such as a minimum academic entry score which must be met. Please check the Handbook course entry for details of entry requirements.",
        "For more information about graduate research study in Education see theFaculty of Education Research Degreespage."
    ]
}