{
    "Course name": "Master of Screenwriting",
    "Course code": "MC-SCWR",
    "Overview text": [
        "The Master of Screenwriting is an 18-month, practice based, course designed for those who have a desire to tell audience-driven stories via a visual medium. Students are introduced in Semester One of Year One to facets of screenwriting with a focus on feature and television writing. Storytelling workshops, script tutorials, the craft of writing, and a unique script development hothouse are major attributes of the course.",
        "A substantial first draft feature screenplay, or a TV Bible plus a draft of a script, are the expected outcomes after Year One. Students in the final Semester are expected to implement the learnt skills for writing and re-writing as they head towards a third or final draft of the script. Students also learn about the screenwriting industries, concluding the course with the Business of Screenwriting.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Master of Screenwriting",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "075501C",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:•either– a bachelor degree or equivalent in a cognate area;– a bachelor honours degree or equivalent in a non-cognate area;– a three-year undergraduate qualification and at least 50 credit points, or equivalent, of graduate study in a non-cognate area;– a three-year undergraduate qualification in a non-cognate area and at least two years of documented, relevant work experience; or– a minimum of six years of documented, relevant work experience related to film and television, with evidence of artistic ability and achievement or practice comparable to that expected of undergraduate degree holders in relevant disciplines;and• a selection test which may include both visual and written elements; and• a folio of past work.Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:• prior academic performance; and/or the work experience; and• the selection test; and• the folio.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university's English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Communication:Students must be able to participate in and produce performances and exhibitions as required; they will also need to communicate effectively and efficiently in oral and written forms. Communication with fellow students, professional and academic staff, and the wider public about their knowledge and application of practising Arts disciplines is essential.",
            "Creative, Intellectual and Organisational Abilities:Students require the capacity for high-level creative performance or production. They are also expected to have the ability to develop problem-solving skills and to comprehend disciplinary and cross-disciplinary information. Students must have the ability to establish study plans and prioritise training objectives and outcomes.",
            "Behavioural and Social Attributes:Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. They must take full responsibility for their own participation and learning. Students also contribute to the learning of other students in collaborative environments and must therefore demonstrate a wide range of interpersonal skills which consider the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Disability:Students who have a disability which may prevent them from participating in tasks involving these inherent academic requirements are encouraged to contact the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/Adjustments can be provided to minimise the impact of a disability; however, students will need to participate in the course in an independent manner."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "150-point program of compulsory subjects"
            ]
        },
        "Subject options": {
            "overview": [],
            "Year 1": {
                "overview": [
                    [
                        "FLTV70041",
                        "FLTV70042",
                        "FLTV70043",
                        "FLTV70046",
                        "FLTV70047"
                    ]
                ]
            },
            "Year 2": {
                "overview": [
                    [
                        "FLTV70044",
                        "FLTV70045"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}