{
    "Course name": "Master of Psychiatry",
    "Course code": "342AA",
    "Overview text": [
        "The Master of Psychiatry Program is run by the Department of Psychiatry, University of Melbourne and was developed following extensive consultation with academic staff, students and Royal Australia and New Zealand College of Psychiatry (RANZCP).",
        "With the need to improve and facilitate the delivery of psychiatric care to a broader cross section of the community, this academic qualification provides doctors with the opportunity to develop their knowledge and skills in working with patients experiencing mental illness.",
        "Psychiatric trainees will particularly appreciate the benefits of this program, as they complement the RANZCP Training Program.",
        "The course comprises core and elective subjects which range from the basics through to cutting-edge research, via exploration of the theoretical concepts in psychiatry and the interrelationship with clinical practice.",
        "The course promotes tolerance to the diversity within our community and our geographical region, equity to appropriate treatment for all individuals, and encourages the practitioner to consider the sociocultural factors in their interactions with patients and their broader community.",
        "The seminar format of the course provides a graduate-level learning environment with high quality teaching led by a facilitator/lecturer, whilst encouraging self-directed learning, participation and problem solving.",
        "The course can be taken as a) a three-year part time course b) a one year full time intensive course or c) an online course.",
        "Students have the option to complete a thesis or do a dissertation if they choose the Psychiatric Research Subject. Those not undertaking the Psychiatric Research Subject will complete the other Capstone subject, Special Topics in Psychiatry. There is also the possibility of taking some or the entire course on a continuing education, rather than a degree basis.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Master of Psychiatry",
        "Year & campus": "2024",
        "CRICOS code": "079406C",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "12 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• either— a postgraduate coursework Doctor of Medicine, or— an undergraduate degree in medicine, or equivalent;and• at least one year of documented experience as a practising doctor;and• hold current medical registration in the country where the applicant is working.",
            "Meeting these requirements in itself does not guarantee selection.2. In ranking applications, the Selection Committee will consider:• prior academic performance; and• professional experience.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the University’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7+is required. The English language requirement will be will be deemed met by evidence of registration with the Medical Board of Australia, since this registration has stringent English language requirements.Notes:",
            "All applicants must either 1) At the time of admission and during their candidature be engaged in clinical training in psychiatry or 2) be practicing medical officers in a psychiatric service or private medical practitioners with a significant proportion of their practice (equivalent to 12 months clinical practice) involved in working with patients with mental illness, or 3) if undertaking the one year intensive program, have at least 12 months clinical experience within the last 2 years.",
            "Entry to the elective  Psychiatric Research Project is subject to the capacity of a participating department to provide adequate supervision in a research project. Joint supervision arrangements may need to be put in place for overseas students and a formal agreement to support this may be required from the partner head of the institution prior to enrolment.",
            "Selection into the course is not automatic and in particular, is subject to competition and availability of places.",
            "Completion of this course does not lead to qualifications to work in psychiatry in Australia. The Masters of Psychiatry is an academic course. Qualification as a psychiatrist in Australia is obtained through application and completion of a training program with the Royal Australian and New Zealand College of Psychiatrists - \n"
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Overview, Objectives, Assessment and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support:http://services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete six core subjects and four selective subjects.",
                "The configuration of the subjects is dependent on \"Intensive\" or \"Standard\" mode."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Standard Delivery": {
            "overview": [
                "Over 3 years, part-time",
                "Year I - Standard Delivery",
                [
                    "Two core subjects as per below"
                ],
                [
                    "PSYT90078",
                    "PSYT90079"
                ],
                "Year II - Standard Delivery",
                [
                    "Two core subjects as per below",
                    "Two selective subjects: one May and one June/July"
                ],
                [
                    "PSYT90006",
                    "PSYT90024"
                ],
                "Year III - Standard Delivery",
                [
                    "PSYT90004 - Psychiatry of Old Age",
                    "\n PSYT90094 - Special Topics in Psychiatry  PSYT90093 - Psychiatric Research Project*",
                    "EITHEROR",
                    "Two selective subjects: one May and one June/July\n\n",
                    [
                        [
                            "* prerequisite subject for Psychiatry Research Project (PSYT90010 Research Methods in Psychiatry)"
                        ]
                    ]
                ],
                [
                    "PSYT90004",
                    "PSYT90094",
                    "PSYT90093"
                ]
            ]
        },
        "Intensive Delivery": {
            "overview": [
                "1 year, full time",
                [
                    "Six core subjects listed below",
                    "Four selective subjects: two May and two June/July"
                ],
                [
                    "PSYT90078",
                    "PSYT90006",
                    "PSYT90004",
                    "PSYT90079",
                    "PSYT90024",
                    "PSYT90094"
                ]
            ]
        },
        "Standard & Intensive Delivery - May Selective Subjects": {
            "overview": [
                [
                    "PSYT90059",
                    "PSYT90009",
                    "PSYT90022",
                    "PSYT90068",
                    "PSYT90023",
                    "PSYT90016"
                ]
            ]
        },
        "Standard & Intensive Delivery - June/July Selective Subjects": {
            "overview": [
                [
                    "PSYT90061",
                    "PSYT90010",
                    "PSYT90062",
                    "PSYT90090",
                    "PSYT90014",
                    "PSYT90088"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}