{
    "Course name": "Master of Business Administration",
    "Course code": "MC-BAPT",
    "Overview text": [
        "The main aim of the MBA program is to assist students to develop their capacity to become effective senior level general managers in a wide range of private, public and government organisations.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Master of Business Administration",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "225 credit points",
        "Duration": "48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "• an undergraduate degree; and",
            "• two years of documented work experience; and",
            "a personal statement outlining why they wish to be considered for the course.",
            "Applicants are also required to nominate referees.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "• prior academic performance; and",
            "• the work experience; and",
            "• the personal statement; and",
            "• the referee reports.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note.",
            "• These programs are only available part-time and direct admission to the Master of Business Administration is not permitted. Students who successfully complete the Graduate Diploma in Business Administration may be eligible to progress to the Master of Business Administration with 112.5 points credit.",
            "• Students who discontinue from the Master of Business Administration but have successfully completed the requirements of the Graduate Diploma in Business Administration will be eligible to receive the Graduate Diploma in Business Administration as an exit award."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "To qualify for the MBA degree, students must complete 225 credit points.",
                "All students should expect to complete the entire course within four years of first enrolment, that is, within 16 consecutive terms of study. Permission to extend the period of candidature beyond the four year time limit will be granted on a case by case basis. Please note that Australian visa regulations require that international students complete their study on an entirely full-time basis.",
                "Students must complete eleven core subjects which account for a total of 137.5 credit points. Students must complete seven electives drawn from the school’s elective offering which account for a total of 87.5 credit points (12.5 points for each subject).",
                "Students are required to complete their compulsory subjects (other than the Capstone subject) prior to enrolling in elective subjects."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                [
                    "BUSA90480",
                    "BUSA90481",
                    "BUSA90001",
                    "BUSA90224",
                    "BUSA90243",
                    "BUSA90060",
                    "BUSA90193",
                    "BUSA90093",
                    "BUSA90074",
                    "BUSA90227",
                    "BUSA90026",
                    "BUSA90490"
                ]
            ]
        },
        "Electives": {
            "overview": [
                [
                    "BUSA90360",
                    "BUSA90042",
                    "BUSA90046",
                    "BUSA90053",
                    "BUSA90492",
                    "BUSA90090",
                    "BUSA90491",
                    "BUSA90132",
                    "BUSA90124",
                    "BUSA90218",
                    "BUSA90167",
                    "BUSA90172",
                    "BUSA90248",
                    "BUSA90258",
                    "BUSA90261",
                    "BUSA90270",
                    "BUSA90273",
                    "BUSA90494",
                    "BUSA90341",
                    "BUSA90086",
                    "BUSA90458",
                    "BUSA90493",
                    "BUSA90013",
                    "BUSA90523",
                    "BUSA90524",
                    "MGMT90244",
                    "BISY90016",
                    "BISY90017",
                    "BUSA90521",
                    "MKTG90039",
                    "FNCE90079",
                    "BUSA90527",
                    "BUSA90549",
                    "BUSA90555",
                    "BUSA90279",
                    "BUSA90530",
                    "BUSA90498"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}