{
    "Course name": "Master of Applied Positive Psychology",
    "Course code": "MC-APP",
    "Overview text": [
        "The Master of Applied Positive Psychology (MAPP) is designed for students who are interested in scientifically-grounded approaches to understanding and supporting wellbeing personally and professionally. The MAPP aims to equip graduate students with the skills, knowledge and abilities to competently apply positive psychology and wellbeing science principles to a range of real-world contexts. The course emphasises critical thinking, contextually relevant analysis, and the ethical application and evaluation of concepts.",
        "The program provides a deep and strong foundation of the historical developments of the field; explores key elements, theories, and perspectives from a range of scholars and practitioners; and introduces innovations within the field. Through experiential learning approaches, students explore applications of the positive psychology perspective and wellbeing science with individuals, organisations, and communities. Multi-disciplinary empirical research is combined with thoughtful discourse, with a particular emphasis on contextual relevance, critical thinking, and understanding of the complexities involved in creating and sustaining positive change.",
        "The program also addresses issues related to ethical and professional practice. As part of the learning and assessment processes, students are expected to engage in a range of conceptual, applied and research-informed tasks. The program draws on a variety of pedagogical approaches to promote deep learning, connection with others, and critical scholarship, providing students with skills to confidently apply their knowledge in the future."
    ],
    "Overview table": {
        "Award title": "Master of Applied Positive Psychology",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "079279E",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 12 months full-time or 24 months part-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "either",
            "A bachelor honours degree or equivalent in a cognate area*; \n",
            "or",
            "A three-year undergraduate qualification and at least 50 credit points, or equivalent, of graduate study in a cognate area*; \n",
            "or",
            "A three-year undergraduate qualification in a cognate area*, and at least two years of documented relevant work experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "relevant work experience, where applicable.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardrules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required.",
            "Note:",
            "a) *Cognate area: psychology, education, sociology, business, management, political science, medicine, public health, and economics.",
            "b) Successful applicants with one of the following University of Melbourne degrees may be granted applicable advanced standing:",
            "Graduate Certificate in Wellbeing Science (50 points of advanced standing);",
            "Professional Certificate in Positive Education (25 points of advanced standing);",
            "Professional Certificate in Positive Psychology (25 points of advanced standing. Available to students that commenced the PR-POSPYC from 2022 onwards only); or",
            "Professional Certificate in Wellbeing Science (25 points of advanced standing): or",
            "Professional Certificate in Wellbeing Coaching (12.5 points of advanced standing for equivalent subjects); or",
            "Professional Certificate in Wellbeing Leadership (12.5 points of advanced standing for equivalent subjects)."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Master of Applied Positive Psychology welcomes applications from students with disabilities.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Commonwealth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the degree. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with the Student Equity and Disability Support Team:https://students.unimelb.edu.au/student-support/student-equity-and-disability-support"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Applied Positive Psychology requires the completion of 100 credit points of study, usually over one year full time or two years part time.",
                "Students must complete:",
                [
                    "6 x compulsory subjects (75 points); and",
                    "1 x capstone subject (25 points)."
                ],
                "Note that:",
                [
                    "Principles of Positive Psychology must be completed in the first semester and:",
                    "Capstone in Positive Psychology may only be undertaken after satisfactory completion of 50 points (and in the final semester of study)."
                ],
                "Alternative Exit Point",
                "Early exit points are available for students who commence the Masters^, but later decide to not complete the whole course. These students may exit the Master of Applied Positive Psychology early*, and apply to graduate with one of the following awards:",
                [
                    "Graduate Certificate in Wellbeing Science (GC-WBSCI) if they have satisfied the completion requirements for that award during their enrolment in this masters course (i.e., successfully completed the prescribed 50 credit points of study).",
                    "Professional Certificate in Positive Education (PR-POSED), if they have satisfied the completion requirements for that award during their enrolment in this masters course (i.e., successfully completed the prescribed 25 credit points of study).",
                    "Professional Certificate in Wellbeing Science (PR-WBSCI), if they have satisfied the completion requirements for that award during their enrolment in this masters course (i.e., successfully completed the prescribed 25 credit points of study)."
                ],
                "^These early exit points are only available to students who commenced the MC-APP from 2022 onwards.",
                "*Students must discontinue their enrolment in the MC-APP without completing the award, to be conferred the exit award."
            ]
        },
        "Subject Options": {
            "overview": [
                "Compulsory Subjects",
                [
                    "EDUC91041",
                    "EDUC91042",
                    "EDUC91043",
                    "EDUC91044",
                    "EDUC91045",
                    "EDUC91046"
                ],
                "Capstone Subject",
                [
                    "EDUC90790"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduate Research Degrees",
        "The University of Melbourne's Faculty of Education is widely recognised as a leader in Australian and international education research.",
        "Graduates interested in further study in one ofFaculty of Education’s suite of graduate research degreesmay have several options, depending on their prior qualifications, academic achievement, research experience and professional experience.",
        "Graduates from this course (MC-APP) may be eligible to apply to:",
        [
            "the  or",
            "the  or",
            "the \n"
        ],
        "Alternatively, Graduates from this course (MC-APP) who have completed:",
        [
            "the  or",
            "the  or",
            "an undergraduate Honours degree "
        ],
        "may be eligible to apply to one of the following Faculty of Education research degrees:",
        [],
        "",
        "Entry to these courses is a competitive process and each course has other entry requirements such as a minimum academic entry score, research experience and/or professional experience which must be met. Please check the Handbook course entry for details of entry requirements.",
        "For more information about graduate research study in Education see theFaculty of EducationResearch Degreespage."
    ]
}