{
    "Course name": "Master of Landscape Architecture/Master of Urban Planning",
    "Course code": "MC-LARCHUP",
    "Overview text": [
        "The Master of Landscape Architecture/Master of Urban Planning is a double degree, that will allow students to complete two professionally accredited graduate programs in a reduced timeframe.",
        "Landscape architecture is a unique discipline that acts as a bridge between the arts and sciences, design and environment. Landscape architecture engages with core ecological, cultural and social issues in both urban and rural societies.",
        "The Master of Landscape Architecture at the University of Melbourne is underpinned by a strong grounding in design, ecology and urbanism. These strengths are paralleled by a comprehensive history and theory stream encompassing contemporary landscape architecture, architecture and urban design theory, cross cultural issues, including indigenous perspectives for sustainable societies.",
        "The Master of Landscape Architecture allows students with an undergraduate degree in any discipline to enrol in the Master of Landscape Architecture, which is a distinctive feature of this program at the University of Melbourne.",
        "The first year of study is carefully structured to allow students from diverse backgrounds to develop the required knowledge and foundations in design, history and physical systems before joining second year entry point students (with a cognate background).",
        "The Master of Landscape Architecture is also available to students who have an undergraduate background in landscape architecture, including graduates with a Bachelor of Environments from the University of Melbourne with a major in Landscape Architecture, most often with 100 points of advanced standing.",
        "The Master of Urban Planning focuses on Australian and international policy and planning pertaining to human settlements. Planners promote the establishment of economically viable, socially just, environmentally sustainable, safe and healthy human settlements.",
        "As planners, we believe that this is a critical pursuit and perhaps it is never more timely than now as we adapt to global changes that impact our cities. These changes include climate change; deepening inequality that has often been associated with diminished local democracy and the rise of community advocacy; growing concerns for community health and safety; and the emergence of global city-regions that require innovations in governance and planning.",
        "Please note:depending on your background, you may be eligible to receive up to 1 year of credit.",
        "",
        "Last updated: 6 September 2024"
    ],
    "Overview table": {
        "Award titles": "Master of Landscape ArchitectureMaster of Urban Planning",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "105522A",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "400 credit points",
        "Duration": "48 months full-time or 96 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline with a weighted average mark of at least H3 (65%), or equivalent; and",
            "a portfolio of recent design work, submitted in accordance with the requirements of the Selection Committee; and",
            "a personal statement which outlines relevant prior study, work experience and motivation to undertake the course; and, for students not seeking credit;",
            "a 250-word essay on one designed or vernacular work of landscape architecture that the applicant has seen and found significant.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the personal statement; and",
            "the design portfolio.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note:Applicants with the following may be awarded up to 100 points of credit:",
            "an undergraduate degree with a major in landscape architecture with a weighted average mark of at least H3 (65%), or equivalent. ",
            "Graduate Degree Packages for School LeaversThe University of Melbourne offers Graduate Degree Packages to high achieving school leavers, allowing them to secure places (Commonwealth Supported places for domestic students or International fee places) in the Master of Architecture/Master of landscape architecture provided that they meet certain requirements.",
            "For a Commonwealth Supported Place or an International Fee Place, the applicant must:",
            "complete an Australian Year 12 or the International Baccalaureate (IB) in 2018 or later either:",
            "— in Australia; or— outside Australia and be an Australian citizen;",
            "achieve an ATAR (or notional ATAR) of at least 98.00;",
            "apply for a University of Melbourne Articulated Degree Pathway for commencement in the year following completion of Year 12 or IB via VTAC;",
            "enrol immediately or be granted deferral in the year following Year 12;",
            "successfully complete a Bachelor of Design (majoring in landscape architecture) at the University of Melbourne including all the specified prerequisite subjects;",
            "achieve a minimum weighted average mark of H3 (65%) in their undergraduate degree; and",
            "commence the Master of Landscape Architecture/Master of Urban Planning within 18 months of completing the undergraduate degree.",
            "Applicants eligible for entry via the Graduate Degree packages will not be required to complete a portfolio or personal statement as part of their application.",
            "Applicants should refer to the University handbook for the additional entry requirements for the Bachelor of Design.",
            "Additional notes:",
            "(a) Portfolio format for applicants not eligible for credit allowed under the Resolution on Selection.",
            "The design portfolio is assessed digitally and must be saved as one PDF file in landscape format. The file size of the portfolio should not exceed 10 MB, and the number of pages should not exceed 15 pages. Note that as portfolios are evaluated digitally images should be reproduced at a sufficient scale and resolution to be easily readable with limited zooming or scrolling. The Selection Committee will look for evidence that the applicant has worked successfully in a studio learning environment. Any of the range of pedagogical approaches to the teaching of introductory design is appropriate, although the Selection Committee will be particularly interested in the exploration of 3D form and space, and evidence of other creative work",
            "(b) Portfolio format for applicants who are eligible for credit allowed under the Resolution on Selection.",
            "The design portfolio is assessed digitally and must be saved as one PDF file in landscape format. The file size of the portfolio should not exceed 10 MB, and the number of pages should not exceed 15 pages. Note that as portfolios are evaluated digitally images should be reproduced at a sufficient scale and resolution to be easily readable with limited zooming or scrolling. Elaborate formats that reduce the available page space for the design images should be avoided. The design portfolio should focus on design work rather than, for example, life or still-life drawing skills. Portfolios should be drawn largely from the design studio subjects the applicant has completed. Applicants submitting work done in the context of employment should explain their role in the work produced with brief notes. It would be helpful to see a variety of techniques of drawings and images: free hand diagrams, computer images, two-dimensional (plans, sections, elevations) and three-dimensional studies, photographs of physical models.",
            "It is highly recommended that students obtain at least 16 weeks of documented relevant full-time professional work experience, before commencing the final 100 points of the degree.",
            "Guaranteed Transfer into Commonwealth Supported Place",
            "Students with a fee place in this course who complete 100 points of the course with a weighted average mark of at least H2A (75%) and who are eligible for a Commonwealth Supported Place will be guaranteed a transfer to a Commonwealth Supported Place for the remainder of the course."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne School of Design is the graduate school of the Faculty of Architecture, Building and Planning. It offers professional entry programs in Architecture, Construction Management, Landscape Architecture, Property and Urban Planning. It offers specialist development programs in Property Valuation, Planning and Design and in Urban Design.",
            "The Melbourne School of Design welcomes applications from students with disabilities. It is the University and Faculty (Architecture, Building and Planning) policy to take reasonable steps to make reasonable adjustments so as to enable students’ participation in degrees offered by the Melbourne School of Design (MSD).",
            "A candidate for degrees offered in the MSD must have abilities and skills which include the following: observation; communication; motor; conceptual, integrative, and quantitative; and behavioural and social. Adjustments can be provided to minimise the impact of a disability, however, particularly at Masters level, students need to be able to participate in programs in an independent manner and with regard to their safety and the safety of others.",
            "(i) Observation: Candidates must be able to read text, diagrams, maps, drawings and numerical data. Candidates should be able to observe details at a number of scales and to record useful observations of environmental contexts.",
            "(ii) Communication: Candidates should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. Candidates must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing, presenting one's own work in front of a large group, receiving and responding to feedback about one's own work in a public setting. Assessment in studio subjects will involve 'crits' where students present their own work in front of a large group, where they will receive and respond to feedback about their work in a public setting. Crits are an integral part of working in the industry and are an inherent requirement of the course. The requirement to undertake public crits cannot be waived.",
            "(iii) Motor: Candidates should have sufficient motor function to elicit information from environmental contexts. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments. Candidates should have sufficient motor ability to prepare documentation of analytic texts, drawings and models of findings and for the reparation of proposals for environmental interventions via digital or other means. Candidates should have the ability to actively participate in appropriate site and/or design studio-based activities.",
            "(iv) Intellectual-Conceptual, Integrative and Quantitative Abilities: These abilities include measurement, calculation, reasoning, analysis, synthesis and, importantly, the ability to interpret results of such work. Problem resolution, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, given the disciplines pursued in the SD, candidates should be able to comprehend three-dimensional relationships and to understand the spatial relationships in environmental structures of a wide range of scales – from smaller than the individual through individual buildings and urban spaces to large geographic areas. Further, graduate study entails learning to master one’s own abilities and skills and to deploy them strategically. This requires further developing skills in both reflective and reflexive thinking and being able to practice these skills.",
            "(v) Behavioural and Social Attributes: A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. Assessment in studio subjects will involve 'crits' where students present their own work in front of a large group, where they will receive and respond to feedback about their work in a public setting. Crits are an integral part of working in the industry and are an inherent requirement of the course. The requirement to undertake public crits cannot be waived.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Institute of Landscape Architects",
            "The Master of Landscape Architecture component of this program is accredited with the Australian Institute of Landscape Architects (AILA).",
            "Planning Institute of Australia",
            "The Master of Urban Planning component of this course is accredited with the Planning Institute of Australia (PIA)."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "300 point program:",
                "All students must complete:",
                [
                    "275 points core subjects in Landscape Architecture and Urban Planning",
                    "25 points electives"
                ],
                "400 point program:",
                "All students must complete:",
                [
                    "375 points core subjects in in Landscape Architecture and Urban Planning",
                    "25 points electives"
                ]
            ]
        },
        "Subject options": {
            "overview": [
                "Students entering the Master of Landscape Architecture/Master of Urban planning  from a non cognate discipline will undertake the 400 point program.",
                "Year 1:",
                "First 100 points for students with an undergraduate major or degree in a non cognate discipline:",
                [
                    "ABPL90107",
                    "HORT90033",
                    "ABPL90271",
                    "ABPL90176",
                    "ABPL90283",
                    "ABPL90265"
                ],
                "Students entering the Master of Landscape Architecture/Master of Urban Planning from a cognate discipline (Landscape Architecture major) with 100 points of advanced standing (above subjects) will undertake the 300 point program (starting point for students with Landscape Architecture major)",
                "Year 2:",
                [
                    "ABPL90078",
                    "ABPL90246",
                    "ABPL90134",
                    "ABPL90135",
                    "ABPL90170",
                    "ABPL90074",
                    "ABPL90315"
                ],
                "Year 3:",
                [
                    "ABPL90172",
                    "ABPL90263",
                    "ABPL90130",
                    "ABPL90132",
                    "ABPL90131",
                    "ABPL90064",
                    "ABPL90048"
                ],
                "Year 4:",
                [
                    "ABPL90072",
                    "ABPL90396",
                    "ABPL90375",
                    "ABPL90397"
                ],
                "Electives (25 points)",
                [
                    "ABPL90009",
                    "ABPL90017",
                    "ABPL90022",
                    "ABPL90040",
                    "ABPL90055",
                    "ABPL90056",
                    "ABPL90065",
                    "ABPL90075",
                    "ABPL90077",
                    "ABPL90090",
                    "ABPL90173",
                    "ABPL90260",
                    "ABPL90266",
                    "ABPL90279",
                    "ABPL90280",
                    "ABPL90281",
                    "ABPL90283",
                    "ABPL90304",
                    "ABPL90305",
                    "ABPL90319",
                    "ABPL90320",
                    "ABPL90339",
                    "ABPL90340",
                    "ABPL90341",
                    "ABPL90366",
                    "ABPL90374",
                    "ABPL90377",
                    "ABPL90380",
                    "ABPL90384",
                    "ABPL90404",
                    "ABPL90405",
                    "ABPL90406",
                    "ABPL90407",
                    "ABPL90408",
                    "ABPL90409",
                    "ABPL90410",
                    "ABPL90417",
                    "ABPL90430",
                    "CVEN90048",
                    "CVEN90061",
                    "ENST90002",
                    "EVSC90015",
                    "EVSC90022",
                    "EVSC90023",
                    "FOOD90041",
                    "FRST90017",
                    "FRST90025",
                    "HORT90039",
                    "LARC90001",
                    "NRMT90003",
                    "PLAN90001",
                    "PLAN90002",
                    "PLAN90003",
                    "SOCI90011"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students undertaking the Master of Landscape Architecture/ Master of Urban Planning will undertake research subjects which enable progression to further studies as a PhD candidate."
    ]
}