{
    "Course name": "Master of International Relations",
    "Course code": "MC-IR",
    "Overview text": [
        "The Master of International Relations is offered collaboratively by several Schools in the Faculty of Arts. The degree is designed for graduates who are seeking careers in international affairs, in government, diplomacy, international business, non-government organisations (NGOs), international organisations, and the media. It is a program that combines advanced study in the field of international relations, with relevant professional skills development, and an electives program that is specifically designed to promote cross-cultural understanding. The elective program also reflects Australia’s geographic location and the University of Melbourne’s research strengths, notably in Asian and Islamic Studies, European Studies and global and regional governance in politics, society and culture. The program will also offer students exchange, internship and language study opportunities. The degree is specifically designed as a pathway to professional employment. There is a thesis option in the 200 point and 150 point programs for high achieving students who may wish to progress to a PhD."
    ],
    "Overview table": {
        "Award title": "Master of International Relations",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "068096C",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline with a weighted average mark of at least H2B (70%), or equivalent.",
            "Meeting this requirement does not guarantee selection.",
            "1. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "relevance of previous studies.",
            "1. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "2. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Applicants with the following may be awarded up to 50 points of credit:",
            "an undergraduate degree in a cognate discipline with a weighted average mark of at least H2B (70%), or equivalent.",
            "Applicants with the following may be awarded up to 100 points of credit:",
            "an honours degree in a cognate discipline, with a weighted average mark of at least H2B (70%), or equivalent."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students are required to complete the program requirements/structure from the year that they commenced their program.  All compulsory, core and capstone subjects must be completed to be eligible to graduate from the program.",
                "200 point program",
                "Duration:2 years full-time / 4 years part-time",
                "Coursework Option",
                [
                    "three compulsory subjects (37.5 points)",
                    "core subjects (minimum 12.5 points)",
                    "elective subjects (maximum 150 points)"
                ],
                "or",
                "Minor Thesis Option",
                [
                    "three compulsory subjects (37.5 points)",
                    "core subjects (minimum 12.5 points)",
                    "International Relations Thesis parts 1 and 2 (37.5 points total)",
                    "POLS40013 Social Sciences Research Seminar (12.5 points)",
                    "elective subjects (maximum 100 points)"
                ],
                "Languages:",
                "Students may enrol in up to 25 points of language study in the following areas:",
                [
                    "Arabic",
                    "Chinese",
                    "French",
                    "German",
                    "Hebrew",
                    "Indonesian",
                    "Italian",
                    "Japanese",
                    "Russian",
                    "Spanish"
                ],
                "150 Point Program",
                "Duration:1.5 years full-time / 3 years part-time",
                "Coursework Option",
                [
                    "core subjects (minimum 50 points)",
                    "elective subjects (maximum 100 points)"
                ],
                "or",
                "Minor Thesis Option",
                [
                    "core subjects (minimum 50 points)",
                    "minor thesis parts 1 and 2 (37.5 points total)",
                    "POLS40013 Social Sciences Research Seminar (12.5 points)",
                    "elective subjects (maximum 50 points)"
                ],
                "Languages:",
                "Students may enrol in up to 25 points of language study in the following areas:",
                [
                    "Arabic",
                    "Chinese",
                    "French",
                    "German",
                    "Hebrew",
                    "Indonesian",
                    "Italian",
                    "Japanese",
                    "Russian",
                    "Spanish",
                    "Swedish"
                ],
                "100 point program",
                "Duration:1 year full-time / 2 years part-time",
                "Coursework Option",
                [
                    "core subjects (minimum 37.5 points)",
                    "elective subjects (maximum 62.5 points)"
                ],
                "Languages:",
                "Students may enrol in up to 25 points of language study in the following areas:",
                [
                    "Arabic",
                    "Chinese",
                    "French",
                    "German",
                    "Hebrew",
                    "Indonesian",
                    "Italian",
                    "Japanese",
                    "Russian",
                    "Spanish"
                ],
                "Capstone Requirement:",
                "Capstone subject options must be completed in the final hundred points of the program.  All students are required to complete one Capstone subject option (at least 25 points).  This requirement cannot be waived or replaced in any circumstances:",
                "Capstone Stream 1: POLS90009 International Relations Internship:",
                "Purpose:An opportunity to apply knowledge and skills in international policy and practice to solve problems that arise in professional contexts and develop an integrated understanding of research and practice",
                "Capstone Stream 2: POLS90022 International Security and one of the following subjects:",
                [
                    "CRIM90015 Terror, Law and War",
                    "HIST90026 History, Memory and Violence in Asia",
                    "HIST90027 Middle Eastern Wars: Jihad & Resistance",
                    "POLS90007 US Foreign Policy",
                    "POLS90016 International Organisations",
                    "POLS90030 Nuclear Weapons and Disarmament",
                    "POLS90034 International Policymaking in Practice",
                    "POLS90035 Great Power Rivalry: Peace & War in 21C",
                    "POLS90060 Sex and Power in Global Politics"
                ],
                "Purpose:An opportunity to deepen understanding in one of three central fields of disciplinary specialization (International Security). Students will be required to tailor an assessed piece of work in the elective subject in ways that reflect their personal interests and draws on the subject matter of the core and linked international security-related elective subjects.",
                "Capstone Stream 3:POLS90023 International Governance and Law and one of the following subjects:",
                [
                    "ASIA90001 Human Rights in Southeast Asia",
                    "CRIM90015 Terror, Law and War",
                    "POLS90012 Trade Policy Politics & Governance",
                    "POLS90016 International Organisations",
                    "POLS90017 Europe and Asia: Competing Hegemons?",
                    "POLS90034 International Policymaking in Practice",
                    "POLS90038 Human Rights",
                    "POLS90043 Comparative Regional Governance"
                ],
                "Purpose:An opportunity to deepen understanding in one of three central fields of disciplinary specialization (International Governance and Law). Students will be required to tailor an assessed piece of work in the elective subject in ways that reflect their personal interests and draws on the subject matter of the core and linked international governance-related elective subjects.",
                "Capstone Stream 4:POLS90026 International Political Economy and one of the following subjects:",
                [
                    "INTS90007 Rising China in the Globalised World",
                    "POLS90012 Trade Policy Politics & Governance",
                    "POLS90013 Politics and Business in post-Mao China",
                    "POLS90017 Europe and Asia: Competing Hegemons?",
                    "POLS90034 International Policymaking in Practice",
                    "POLS90043 Comparative Regional Governance",
                    "POLS90060 Sex and Power in Global Politics\n"
                ],
                "Purpose:An opportunity to deepen understanding in one of three central fields of disciplinary specialization (International Political Economy). Students will be required to tailor an assessed piece of work in the elective subject in ways that reflect their personal interests and draws on the subject matter of the core and linked political economy-related elective subjects.",
                "External Subject Rule",
                "Student may undertake an external subject (not listed within the program structure) with the permission of the program and subject coordinator.  All external subject requests must be for the elective subject requirement, not as a compulsory, core or capstone subject. The maximum external subjects allowed are as follows:",
                [
                    "200 point program undertaken at University of Melbourne (2 years): maximum 25 points.",
                    "150 point program undertaken at University of Melbourne (1.5 years): maximum 12.5 points.",
                    "100* point program undertaken at University of Melbourne (1 year): 12.5 points",
                    "50*^ point program undertaken at University of Melbourne (0.5 years): 0 points."
                ],
                "* GC-ARTS, GD-ARTS, GCA-ARTS and GDA-ARTS students are not normally granted permission to undertake external subjects towards their degree.",
                "^ Exception: Students admitted to 50 point programs may apply to take LING90002, Presenting Academic Discourse, as an external subject.",
                "Please note that advanced standing contributes to a student’s remaining points undertaken at University of Melbourne, and may affect how many points the student can undertake outside the enrolled program.",
                "For policies that govern this degree, see theCourses, Subjects, Awards and Programs Policyin theUniversity Melbourne Policy Library. Students also should also refer to information in theEnrolment and Timetabling Policy."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who complete the minor thesis may be eligible for entry into the PhD."
    ]
}