{
    "Course name": "Master of Dance",
    "Course code": "MC-DNCE",
    "Overview text": [
        "The Master of Dance is dedicated to dance as a transcultural and interdisciplinary practice enmeshed with local and global crosscurrents of movement, dance and choreographic thinking. The course engages with Dance as an embodied experience that draws from a rich field of knowledge including contemporary aesthetics, philosophy, historiography, culture and the politics of the everyday.",
        "The Master of Dance will provide a vehicle for students to engage in theoretical and practice-based research and to explore dance practice through multiple modes. Taking place within an expanding field, the course addresses diverse ways of making through movement, dance, performance and related disciplines.",
        "The programme aims to offer pathways for dancers into specialised careers through its emphasis upon engagement with current thinking in dance and applied practice including through working in situ and through placements. The distinctiveness of this programme lies in its emphasis on informed practice through critical, historical, soma-scientific, cultural, educational and geo-political contexts. It prepares students for careers including in dance education, dance and community practice, dance health and wellbeing, cultural leadership and professional choreographic within various performance domains.",
        "Open to students with expertise in all forms of movement practice from any culture or geographical area, the Master of Dance is designed to attract students wishing to contextualize and extend their practice, as well as career changers with a specific interest in dance and recent developments in the field .",
        "Applying dance thinking to contemporary problems, sites of practice, situations and contexts, six subjects and an extended research project, empower students to develop multiple vocational routes through the dance and performance field. Inter-disciplinary, site-responsive, digitally enabled, somaticised and archived dance meets the world through critical and creative processes of making, writing, articulating and performing.",
        "Last updated: 3 May 2024"
    ],
    "Overview table": {
        "Award title": "Master of Dance",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "105697M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in dance; or",
            "at least six years of documented professional experience in dance and/or related performing arts; or",
            "an Honours degree in dance or a related field; and",
            "an interview (shortlisted applicants only).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking the applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "documented professional experience; and",
            "interview (shortlisted applicants only).",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Student Application and Selection Procedure.",
            "4. Applicants are required to satisfy the university's English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Notes:",
            "Successful applicants with an Honours Degree from an approved course may be granted up to 100 points of advanced standing for the year 1 subjects, commencing their Masters in year 2."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "200-point program of seven compulsory subjects.",
                [
                    "To progress from Year 1 to Year 2, students must complete 100 points of Year 1 compulsory subjects."
                ]
            ],
            "Year 1": {
                "overview": [
                    [
                        "DNCE90013",
                        "DNCE90014",
                        "DNCE90015",
                        "DNCE90016"
                    ]
                ]
            },
            "Year 2": {
                "overview": [
                    [
                        "DNCE90017",
                        "DNCE90018",
                        "DNCE90019"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}