{
    "Course name": "Master of Advanced Nursing Practice",
    "Course code": "MC-ANP",
    "Overview text": [
        "The Master of Advanced Nursing Practice is a graduate coursework degree consisting of 100 points, normally taking twelve months of full-time study or part-time equivalent. Masters prepared nurses assume responsibility for establishing new professional roles, devising new models of care and leading dynamic changes to practice.",
        "The first year of study provides the opportunity for students to extend their existing nursing knowledge and develop skills in specialty practice.",
        "The second year of study builds on specialisation by focusing on advanced practice skills and knowledge. Specifically, it will prepare students for clinical leadership roles in nursing and healthcare."
    ],
    "Overview table": {
        "Award title": "Master of Advanced Nursing Practice",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• a Graduate Certificate in Nursing Practice with a specialty; and• an undergraduate degree in nursing or a three-year diploma of nursing or equivalent; and• at least one year of documented postgraduate clinical experience within the past five years; and• Registration as a nurse with the Nursing and Midwifery Board of Australia.",
            "Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:• prior academic performance; and• the clinical experience.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Student Equity and Disability Support websitehttps://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Advanced Nursing Practice requires the successful completion of 100 credit points.",
                "The Master of Advanced Nursing Practice prepares graduates to be clinically proficient, professionally articulate and ready to assume a major responsibility in developing new professional roles, devising new models of care and overseeing dynamic changes to practice."
            ],
            "All students must complete:": {
                "overview": [
                    "Compulsory requirements",
                    [
                        "25 credit points of compulsory subjects",
                        "25 credit points of capstone subjects"
                    ],
                    "Remaining 50 credit points",
                    "Coursework option",
                    [
                        "50 credit points of core selective and elective subjects includingA minimum of 12.5 credit points of core selective subject\n",
                        "A minimum of 12.5 credit points of core selective subject"
                    ],
                    [
                        "A minimum of 12.5 credit points of core selective subject"
                    ],
                    "OR",
                    "Research option",
                    [
                        "25 credit points of compulsory subject",
                        "12.5 credit points of core selective subject",
                        "12.5 credit points of elective subject"
                    ]
                ]
            },
            "Subject Options": {
                "overview": []
            },
            "Compulsory Requirements": {
                "overview": [
                    "Compulsory subjects",
                    "Students must complete all of the compulsory subjects (25 credit points)",
                    [
                        "NURS90069",
                        "NURS90086"
                    ],
                    "Capstone subjects",
                    "Students must complete all of the capstone subjects (25 credit points)",
                    [
                        "NURS90070",
                        "NURS90120"
                    ]
                ]
            },
            "Coursework Option": {
                "overview": [
                    "Core selective subjects",
                    "Students must undertake one of the following subjects (12.5 credit points)",
                    [
                        "PHRM90002",
                        "NURS90012",
                        "NURS90075"
                    ],
                    "Elective subjects",
                    "Students must complete three elective subjects (37.5 credit points) as listed under the Elective subjects table."
                ]
            },
            "Research Option": {
                "overview": [
                    "Compulsory subject",
                    "Students must complete the below compulsory subject (25 credit points)",
                    [
                        "NURS90026"
                    ],
                    "Core selective subjects",
                    "Students must undertake one of the following core selective research subjects (12.5 credit points)",
                    [
                        "NURS90059",
                        "HLTH90002"
                    ],
                    "Elective subjects",
                    "Students must complete one elective subject (12.5 credit points) as listed under the Elective subjects table.",
                    "Students may also undertake an additional subject listed under Graduate Certificate Specialty Subjects as an elective.",
                    "Discipline Electives",
                    [
                        "NURS90012",
                        "NURS90018",
                        "NURS90067",
                        "NURS90068",
                        "NURS90072",
                        "NURS90075",
                        "NURS90077",
                        "NURS90078",
                        "NURS90079",
                        "NURS90084",
                        "NURS90085",
                        "NURS90087",
                        "NURS90088",
                        "NURS90093",
                        "NURS90094",
                        "NURS90101",
                        "NURS90104",
                        "NURS90119",
                        "NURS90121",
                        "NURS90122",
                        "NURS90138",
                        "NURS90139",
                        "NURS90141",
                        "NURS90142",
                        "NURS90147",
                        "NURS90149",
                        "NURS90151",
                        "NURS90152",
                        "NURS90076"
                    ],
                    "Other Electives",
                    [
                        "ABPL90377",
                        "EDUC90742",
                        "GENP90017",
                        "GENP90021",
                        "HLTH90001",
                        "HLTH90007",
                        "HLTH90008",
                        "HLTH90009",
                        "INFO90001",
                        "ISYS90069",
                        "MEDI90085",
                        "MEDI90107",
                        "MEDI90108",
                        "MEDI90109",
                        "MEDI90110",
                        "MEDI90111",
                        "NURS90105",
                        "PADM90024",
                        "PHRM90002",
                        "POPH90256",
                        "POPH90257",
                        "POPH90258",
                        "POPH90260",
                        "POPH90264",
                        "POPH90302",
                        "PSYT90092",
                        "PSYT90097",
                        "PSYT90103",
                        "PSYT90112",
                        "REHB90001",
                        "REHB90002",
                        "REHB90004",
                        "REHB90005",
                        "REHB90006",
                        "SCWK90027",
                        "EDUC90741"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of other graduate coursework programs as well as research higher degree programs including the Doctor of Philosophy."
    ]
}