{
    "Course name": "Master of Primary Health Care",
    "Course code": "546AA",
    "Overview text": [
        "The Master of Primary Health Care enables candidates to undertake a major research project on a primary health care topic of their choice. A candidate will have appropriately experienced supervisor/s and an Advisory Committee who in consultation with the candidate, arranges a course of supervised research designed to suit the individual requirements and interests of the candidate. A candidate may be required to supplement their research program by attendance at, or enrolment in, additional subjects if considered necessary by the supervisor(s). All students are required to attend departmental seminars over the period of their candidature. When students have completed their research, they should have developed competency in the conduct of research methodologies in the primary health care setting. Students will produce a 30,000-40,000 word thesis that is examined externally.",
        "Commencement periods",
        "Policies",
        "A range of University policies and procedures apply to Higher Degrees by Research and students should familiarise themselves with these policies via theUniversity Policy Library."
    ],
    "Overview table": {
        "Award title": "Master of Primary Health Care",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "046262J",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "9",
        "Duration": "2 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed (at minimum H2A standard or higher):",
            "Honours degree in a relevant field; or",
            "Postgraduate Diploma in Primary Health Care or relevant field; or",
            "A degree in a relevant field.",
            "plus",
            "At least two years' documented relevant professional or work experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the selection committee will consider:",
            "prior academic performance and, if relevant, professional qualifications;",
            "performance at interview;",
            "understanding of the research question to be explored;",
            "motivation and capacity to complete the course in a timely manner;",
            "relevant prior research and/or professional experience ; and",
            "referee reports.",
            "3. The selection committee may seek further information to clarify any aspect of an application in accordance with theSelection and Admission Policy.",
            "4. The minimum English language requirements for this course areBand 7."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser andStudent Equity and Disability Support.All candidates are required to complete the equivalent of at least six months full-time (12 months part-time) advanced study and research at the University unless studying at an outside institution approved by the Research Higher Degrees Committee (RHDC). The RHDC will not approve entirely distance supervision or entirely on-line supervision for research higher degree students.",
            "Throughout their candidature candidates are expected to attend the University in order to benefit from planning, conducting and writing up their research within a University community and environment.The residency requirement is deemed especially important during the first six months of candidature. During this time the student is expected to interact on a regular basis with the supervisor, the department (including staff and other research students) and the University, so as:",
            "to build the skills and knowledge necessary to carry out the proposed research program",
            "to acquire an understanding of the standards and requirements for a research higher degree awarded by the University",
            "to make use of support programs and facilities provided by the University throughout candidature."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                [
                    "Candidates enrol in a thesis subject for the duration of the degree and undertake a major research project on a primary health care topic of their choice.",
                    "The normal period of candidature is 18 months for full-time candidates with the possibility of up to 6 months extension.",
                    "All candidates are required to complete a minimum of 6 months full-time research at the University in order to benefit from planning, conducting and writing up their research within a University community and environment.",
                    "Normally the entire degree is undertaken at the University.",
                    "A candidate will have appropriately experienced supervisor/s and an Advisory Committee who in consultation with the candidate, arranges a course of supervised research designed to suit the individual requirements and interests of the candidate.",
                    "A candidate may be required to supplement their research program by attendance at, or enrolment in, additional subjects if considered necessary by the supervisor(s).",
                    "All candidates are expected to attend departmental seminars over the period of their candidature.",
                    "Academic progress is reviewed regularly throughout the degree.",
                    "All candidates for the degree will be examined on the basis of their thesis which is examined externally. The thesis should normally be between 30,000 and 40,000 words in length excluding tables, illustrations and bibliography.",
                    "Candidates should refer to the University policy library and the Graduate Research Hub for further information regarding candidature, academic progress, ethics, thesis preparation and examination.",
                    "To be eligible to submit a thesis for examination, students must be enrolled in their course for the minimum period of 6 months full-time equivalent."
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}