{
    "Course name": "Master of Psychology (Clinical Psychology)/Doctor of Philosophy",
    "Course code": "080CL",
    "Overview text": [
        "The clinical psychology program at the University of Melbourne began in the early 1970s. The program enjoys an excellent reputation as one of the premier clinical psychology programs in the country. The program aims to produce graduates with a strong knowledge base in psychopathology, combined with a high level of skill and acumen in culturally responsive assessment and treatment of psychological conditions that can present across the lifespan. Therapeutic skills are taught primarily within a broad cognitive-behavioural framework within didactic, individual and group-based clinical contexts.",
        "The course is accredited by theAustralian Psychology Accreditation Council (APAC),providing the required sequence of subjects for graduates wishing to attain generalist registration as a psychologist in Australia as well as competency in knowledge and skills relevant to the clinical psychology specialisation.",
        "The course is comprised of coursework subjects, practical experience through clinical placements and a major research thesis in an area relevant to clinical psychology.  All subjects are compulsory.  The academic members of the clinical teaching staff are active in both clinical work and research in a wide variety of clinical domains. Hence, the Program provides the opportunity to access a wide range of clinical placement settings and research programs.",
        "In their first year, all students assess and provide treatment for adult clients referred to the University of Melbourne Psychology Clinic. In addition, all students undertake two second year field placements- one where the focus is on assessment and treatment of children and/or adolescents and the other focussing on clinical work with adults.",
        "For the Doctor of Philosophy component of the course, please also refer to :",
        "http://mdhs-study.unimelb.edu.au/degrees/doctor-of-philosophy/overview",
        ""
    ],
    "Overview table": {
        "Award title": "Master of Psychology (Clinical Psychology)/Doctor of Philosophy",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "037232A",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "4 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "All applicants who wish to undertake the Master of Psychology (Clinical Psychology)/PhD combined program must first enrol in the singleMaster of Psychology (Clinical Psychology)and may then apply for entry to the combined program for the following year. Applicants must satisfy the Doctor of Philosophy - Medicine, Dentistry and Health Sciencesentry requirements"
        ],
        "Inherent requirements (core participation requirements)": [
            "Students must comply with Fitness to Practice Rules, which are accessible fromSchedule 1of theStudent Fitness to Practice Policy (MPF1345).",
            "The University of Melbourne is committed to providing students with reasonable adjustments to assessment and participation under the Disability Standards for Education (2005), and theAssessment and Results Policy (MPF1326). Students are expected to meet the core participation requirements for their course. These can be viewed under Entry and Participation Requirements for the course outlines in the Handbook.",
            "Further details on how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home",
            "PhD Component:",
            "All research candidates are required to complete the equivalent of at least six months full-time (12 months part-time) advanced study and research at the University unless studying at an outside institution approved by the Research Higher Degrees Committee (RHDC). The RHDC will not approve entirely distance supervision or entirely on-line supervision for research higher degree students.",
            "Throughout their candidature candidates are expected to attend the University in order to benefit from planning, conducting and writing up their research within a University community and environment.",
            "The residency requirement is deemed especially important during the first six months of candidature. During this time the student is expected to interact on a regular basis with the supervisor, the department (including staff and other research students) and the University, so as:",
            "to build the skills and knowledge necessary to carry out the proposed research program",
            "to acquire an understanding of the standards and requirements for a research higher degree awarded by the University",
            "to make use of support programs and facilities provided by the University throughout candidature."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Accredited by the Australian Psychological Accreditation Council and recognised by the Australian Health Practitioner Regulation Agency (AHPRA)"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "This course consists of the coursework and placement components of the Master of Psychology (Clinical) together with a full PhD research thesis in Psychology.",
                "Coursework consists of 18 classroom-based subjects taken over the first three years of this four-year course (see below) and 125 days of Placement (30 days in the first-year and 95 days spread over second and third-years).",
                "PhD:A range of University policies and procedures apply to students enrolled in Higher Degrees by Research. Students should familiarise themselves with these policies. Refer to thepolicy library"
            ]
        },
        "Subject options": {
            "overview": [
                "Master of Psychology/PhD",
                "In order to satisfy the requirements of the combined Master of Psychology (Clinical)/PhD students must complete the following subjects:",
                "First-year Subjects",
                [
                    "PSYC90003",
                    "PSYC90012",
                    "PSYC90006",
                    "PSYC90009",
                    "PSYC90023",
                    "PSYC90029",
                    "PSYC90030",
                    "PSYC90031",
                    "PSYC90007",
                    "PSYC90011",
                    "PSYC90015",
                    "PSYC90008",
                    "PSYC90125"
                ],
                "Second-year subjects",
                [
                    "PSYC80004",
                    "PSYC90077",
                    "PSYC90016",
                    "PSYC90027"
                ],
                "Third-year subjects",
                [
                    "PSYC80004",
                    "PSYC90078",
                    "PSYC90017",
                    "PSYC90010"
                ],
                "Fourth-year subjects",
                [
                    "PSYC80004"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}