{
    "Course name": "Master of Geography",
    "Course code": "MC-GEOG",
    "Overview text": [
        "The Master of Geography is a two-year, full-time degree that allows students to significantly extend their undergraduate specialisation in geography (or a related field). Students can specialise in one of three geography streams and chose either a coursework only option (no research project) or one of two coursework-plus-thesis options (with a 50 pt or 100 pt research project). The capstone experience is provided through the study of geography’s methods and techniques applied to various geographic problems, as well as either the Geography Practical or Research Project. Discipline electives include numerous field-based subjects, where students gain field skills, which are at the heart of applied geography. Students opting for coursework plus research project choose a topic in a field of their choice under the supervision of one or more academic supervisors. The Research Project lays the foundations for possible PhD study or research-related positions in the workforce. The coursework component of the degree can be taken part-time; however, the 50-pt or 100-pt research projects must be taken over two or four consecutive semesters (respectively).",
        "Last updated: 13 February 2024"
    ],
    "Overview table": {
        "Award title": "Master of Geography",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "092792A",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree with a course WAM of 70 or above, with a major in Geography or any of the following related disciplines: Ecology and Evolutionary Biology; Environmental Science; Earth, Ocean and/or Atmospheric Science; Zoology; Anthropology; Urban Studies; Social Science; Economics; Political Science.",
            "The field of Geography overlaps and complements many areas of study across both the social and physical sciences, so potential applicants who are in doubt about their background are strongly encouraged to contact the coordinator.",
            "Entry is subject to the capacity of the department to provide adequate supervision in, and resources for, a research project appropriate to the interests and preparation of the individual student, and may be subject to the agreement of a member of academic staff to supervise the project module.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "academic background;",
            "WAM;",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Master of Geography is a 200 point program. The course can be taken under one of three following structures:",
                "Coursework only",
                [
                    "Discipline Core (25 pt)",
                    "Geography Practical (12.5 pt)",
                    "Discipline electives (137.5 pt)",
                    "Professional Skills subjects (25 pt)"
                ],
                "Coursework plus minor research thesis",
                [
                    "Discipline core (25 pt);",
                    "Discipline electives (100 pt)",
                    "Professional skills subjects (25 pt)",
                    "Minor research thesis (50 pt)"
                ],
                "Coursework plus major research thesis",
                [
                    "Discipline core (25 pt);",
                    "Discipline electives (50 or 62.5 pt)",
                    "Professional skills subjects (12.5 or 25 pt)",
                    "Major research thesis (100 pt)"
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Discipline Core subjects": {
            "overview": [
                "All students must take both of the following:",
                [
                    "GEOG90018",
                    "GEOG90029"
                ]
            ]
        },
        "Additional Discipline Core": {
            "overview": [
                "Coursework-only students must also take the following:",
                [
                    "GEOG90028"
                ]
            ]
        },
        "Discipline Electives": {
            "overview": [
                "Students must complete Discipline Electives subject from within one of three geography streams:",
                [
                    "Physical Geography;",
                    "Human Geography;",
                    "Integrated Geography."
                ],
                "Note:At least 12.5pt of field classes is strongly recommended; students are permitted to take up to two 300-level subjects.",
                "Physical Geography Stream",
                [
                    "GEOG30021",
                    "GEOG30022",
                    "GEOG30027",
                    "ENST90004",
                    "ENST90005",
                    "EVSC90015",
                    "EVSC90014",
                    "FOOD90034",
                    "GEOG90003",
                    "GEOG90007",
                    "GEOG90022",
                    "GEOG90024",
                    "GEOG90026",
                    "GEOG90027",
                    "GEOM90006",
                    "ATOC90002",
                    "GEOG90019",
                    "GEOG90025",
                    "ENST90034",
                    "ENST90002",
                    "DEVT90003",
                    "GEOG30030",
                    "GEOG30033",
                    "GEOG90020",
                    "ATOC90017"
                ],
                "Human Geography Stream",
                [
                    "GEOG30019",
                    "GEOG30021",
                    "GEOG30022",
                    "GEOG30024",
                    "GEOG30027",
                    "DEVT90003",
                    "ENST90004",
                    "ENST90005",
                    "ENST90002",
                    "EVSC90015",
                    "EVSC90014",
                    "FOOD90034",
                    "GEOG90007",
                    "GEOG90020",
                    "GEOG90021",
                    "GEOG90022",
                    "GEOM90006",
                    "ATOC90002",
                    "GEOG90019",
                    "GEOG90025",
                    "ASIA90016",
                    "ENST90034",
                    "GEOG30029",
                    "UNIB30002",
                    "GEOG30031",
                    "GEOG30028",
                    "GEOG30030"
                ],
                "Integrated Geography stream",
                [
                    "GEOG30019",
                    "GEOG30021",
                    "GEOG30022",
                    "GEOG30024",
                    "GEOG30027",
                    "DEVT90003",
                    "ENST90004",
                    "ENST90005",
                    "ENST90002",
                    "EVSC90015",
                    "EVSC90014",
                    "FOOD90034",
                    "GEOG90003",
                    "GEOG90007",
                    "GEOG90020",
                    "GEOG90021",
                    "GEOG90022",
                    "GEOG90024",
                    "GEOG90026",
                    "GEOG90027",
                    "GEOM90006",
                    "ATOC90002",
                    "GEOG90019",
                    "GEOG90025",
                    "ASIA90016",
                    "ENST90034",
                    "GEOG30030",
                    "GEOG30033",
                    "ATOC90017",
                    "GEOG30029",
                    "UNIB30002",
                    "GEOG30001",
                    "GEOG30028"
                ]
            ]
        },
        "Professional Skills subjects": {
            "overview": [
                "Coursework onlyandCoursework with minor research thesisstudents much complete 25 points of the listed Professional Skills subjects.",
                "Coursework plus major research thesisstudents can complete between 12.5 to 25 points of the listed Professional Skills subjects.",
                [
                    "BUSA90403",
                    "MAST90045",
                    "SCIE90005",
                    "MAST90044",
                    "SCIE90012",
                    "SCIE90013",
                    "GEOM90007"
                ]
            ]
        },
        "Research Project": {
            "overview": [
                "Note: There is no research project for students taking the coursework-only option",
                "Coursework plus minor research thesis:",
                "Students wishing to undertake the 50-pt research project pathway must attain a WAM of at least 75 or, obtain permission from the Master of Geography coordinator.",
                "The minor thesis (50 pt) will be taken over the final two semesters of enrolment, beginning the Monday of the first semester of research project enrolment (semester 1 or 2) and continuing until the end of the final semester of research project enrolment. The research project work continues over summer or winter breaks, minus annual recreation leave of 4 weeks. For how long and at what time within the enrolment the actual period of leave is to be taken needs to be negotiated with a student's supervisor.",
                "The thesis will be due for submission by the end of the formal examination period of the final semester of research project enrolment (usually the fourth semester of the student’s M Geography candidature), if an earlier date is not specified. The assessment requirements below are applicable to the entire 50-point Research Project. All assessment pieces are individual tasks:",
                [
                    "A 4,000 word written research proposal modelled on a research grant application style, due by week 8 of the first semester of research project enrolment. 12.5% of final project mark.",
                    "A 20 minutes oral research proposal seminar due by week 8 of the first semester of research project enrolment. 12.5% of final project mark.",
                    "A 20 minute research results seminar due week 11 of the second semester of research project enrolment. 12.5% % of final project mark.",
                    "A 12,500-word thesis by the end of the formal examination period of the second semester of research project enrolment. 62.5% of final project mark."
                ],
                "Students select their research project load in consultation with their project supervisor and the program coordinator, and must enrol in at least 12.5 points of research project per semester except in extraordinary circumstances (e.g. supervisor being on sabbatical leave) where permission of the program coordinator is given. Therefore, in each semester students must be enrolled in one of the subjects listed below (all of which are offered in both semesters):",
                [
                    "GEOG90030",
                    "GEOG90031",
                    "GEOG90032",
                    "GEOG90033"
                ],
                "Coursework plus major research thesis:",
                "Students wishing to undertake the 100-pt research project pathway must attain a WAM of at least 75 or, obtain permission from the Master of Geography coordinator.",
                "The major thesis (100pt) will be taken over four consecutive semesters and will begin on the Monday of the first semester of research project enrolment (semester 1 or 2) and continue until the end of the final semester of research project enrolment. The research project work continues over summer and winter breaks, minus recreation leave of 4 weeks per year. For how long and at what time within the enrolment the actual period of leave is to be taken needs to be negotiated with a student's supervisor.",
                "The thesis will be due for submission at the end of the formal examination period of the final semester of research project enrolment (usually the fourth semester), if an earlier date is not specified. The assessment requirements below are applicable to the entire 100-point Research Project. All assessment pieces are individual tasks:",
                [
                    "A full literature review of 5,000 words, due at the end of the first semester of research: value 12.5% of final project mark",
                    "A research 4,000 word proposal modelled on a research grant application style, and research proposal seminar, due by week 4 and week 11 respectively of the second semester of research: value 12.5% of final project mark",
                    "A 20 minute research results seminar due week 11 of the final (fourth) semester of research project enrolment. 12.5% of final project mark.",
                    "A 25,000-word thesis by the end of the formal examination period of the final (fourth) semester of research project enrolment. 62.5% of final project mark."
                ],
                "Students select their research project load in consultation with their project supervisor and the program coordinator, and must enrol in at least 12.5 points of research project per semester except in extraordinary circumstances (e.g. supervisor being on sabbatical leave) where permission of the program coordinator is given.",
                "EXAMPLE:",
                [
                    "GEOG90036 Geography Research Project pt1 (12.5pts)",
                    "GEOG90040 Geography Research Project pt2 (12.5pts)",
                    "GEOG90045 Geography Research Project pt3 (25pts)",
                    "GEOG90051 Geography Research Project pt4 (50pts)"
                ],
                "Therefore, in each semester students must be enrolled in one of the subjects listed below (all of which are offered in both semesters):",
                [
                    "GEOG90036",
                    "GEOG90040",
                    "GEOG90045",
                    "GEOG90046",
                    "GEOG90050",
                    "GEOG90051"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}