{
    "Course name": "Master of Medicine (Radiology)",
    "Course code": "572RC",
    "Overview text": [
        "Master of Medicine (Radiology) is a part time program of study offered to trainees in accredited Radiology training positions.",
        "The course is designed to run in parallel with training for the fellowship of the Royal Australian and New Zealand College of Radiologists (FRANZCR).",
        "The course includes a two year lecture and tutorial program which leads to a revision program at the commencement of the third year.",
        "The course aims to supplement vocational training and is strategically aligned with the RANZCR curriculum in order to promote excellence in radiology training.",
        "Last updated: 28 May 2024"
    ],
    "Overview table": {
        "Award title": "Master of Medicine (Radiology)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree, or equivalent; in Medicine; and",
            "at least two years experience as a practicing doctor; and",
            "be accepted in an accredited training hospital in Victoria for the 5 year Radiology Registrar training programme; and",
            "have passed Part 1 of the RANZCR exams.",
            "Applicants are also required to nominate at least two professional referees.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "professional experience; and",
            "the referee reports.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7is required.",
            "Applicants may be granted exemption from Part I of the examination for the degree of Master of Medicine (Radiology) if they have passed a comparable examination offered in a relevant discipline by an approved body. The following has been approved to date as exemptions for the purpose of proceeding straight to Part II candidature and other relevant experience or examinations may also be approved for this purpose from time to time:• Royal Australian and New Zealand College of Radiologists (Part I, FRANZCR) – for Part II Radiology"
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support:http://services.unimelb.edu.au/disability"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Please see the relevant subject options below, which are dependent on whether the course is commenced before or after 2017.",
                "In order to obtain the Master of Medicine (Radiology), candidates will have to complete a minor thesis of 10,000 to 15,000 words."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Students who commenced before 2017": {
            "overview": [
                [
                    "RADI90004",
                    "RADI90003"
                ]
            ]
        },
        "Students who commenced 2017 or later": {
            "overview": [
                [
                    "RADI90011",
                    "RADI90012",
                    "RADI90013",
                    "RADI90014",
                    "RADI90015",
                    "RADI90016"
                ]
            ]
        },
        "Students who commence in 2018": {
            "overview": [],
            "Year 1": {
                "overview": [
                    [
                        "RADI90017",
                        "RADI90018"
                    ]
                ]
            },
            "Year 2": {
                "overview": [
                    [
                        "RADI90019",
                        "RADI90020"
                    ]
                ]
            },
            "Year 3": {
                "overview": [
                    [
                        "RADI90021",
                        "RADI90022",
                        "RADI90023"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}