{
    "Course name": "Master of Environment",
    "Course code": "441ME",
    "Overview text": [
        "This course will not be taking students from 2016. The program has been moved toMC-ENV",
        "The Master of Environment (441ME) is a flexible, multidisciplinary course that enables students to develop knowledge and skills for professional practice in environment or sustainability. Depending on their academic background, interests and career aspirations students can choose from over 200 subjects taught by 10 different faculties. The Master of Environment provides both specialisation in a field of environmental practice and capacity to work across disciplines for environmental decision making. Students are provided with the opportunity to participate in research projects, internship placements, overseas study, and collaborative problem-solving projects",
        "The Master of Environment is a postgraduate qualification of 200 points (typically 16 subjects), normally taken in two years of study fulltime or part-time equivalent. Admission is based on scores in a relevant undergraduate program. The qualification structure requires completion of two core multidisciplinary subjects. Students complete a stream (typically fourteen subjects) in a defined specialist field of environmental knowledge, or may complete a tailored specialisation in a relevant field."
    ],
    "Overview table": {
        "Award title": "Master of Environment",
        "Year & campus": "2024",
        "CRICOS code": "076197J",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in a cognate discipline with at least an H3 (65%) weighted average, or equivalent;",
            "OR",
            "an undergraduate degree in any discipline with at least an H3 (65%) weighted average, or equivalent; and",
            "two years of documented professional work experience since graduation related to the degree.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and, if relevant",
            "professional experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Admission and Selection into Course Policy.",
            "4. The minimum English language requirements for this course are Band 6.5.",
            "Note:",
            "Students Completing the Graduate Certificate in Environment will be eligible for 50 points of credit into the Graduate Diploma of Environment or the Master of Environment.",
            "Students completing the Graduate Diploma in Environment will be eligible for 100 points of credit into the Master of Environment."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Graduate School of Science (GSS) welcomes applications from students with disabilities. It is University and School policy to take reasonable steps to make reasonable adjustments so as to enable the student’s participation in the School’s programs. GSS contributes to the New Generation degrees and offers a broad range of programs across undergraduate and post-graduate levels many of which adopt a multi-disciplinary approach.",
            "Students of the School’s courses must possess intellectual, ethical, and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the School. Candidates must have abilities and skills in observation; motor in relevant areas; communication; in conceptual, integrative, and quantitative dimensions; and in behavioural and social dimensions.",
            "Adjustments can be provided to minimise the impact of a disability, however students need to be able to participate in the program in an independent manner and with regard to their safety and the safety of others.",
            "I. Observation:In some contexts, the student must be able to observe demonstrations and experiments in the basic and applied sciences. More broadly, observation requires reading text, diagrams, maps, drawings and numerical data. The candidate should be able to observe details at a number of scales and record useful observations in discipline dependant contexts.",
            "II. Communication:A candidate should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. A candidate must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.",
            "III. Motor:Candidates should have sufficient motor function necessary for participation in the inherent discipline-related activities. The practical work, design work, field work, diagnostic procedures, laboratory tests, require varying motor movement abilities. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments.",
            "IV. Intellectual-Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving, the critical skill demanded of professionals in land and environment industries, requires all of these intellectual abilities. In addition, the candidate should be able to comprehend three-dimensional relationships and to understand the spatial relationships of structures.",
            "V. Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel their disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students who undertake the Master of Environment may either pursue one of thirteen major fields of study, or the tailored specialisation, subject to approval by an academic advisor.",
                "Specialist Majors",
                "The major fields of study offered in the Master of Environment degree have been designed by experts in the field and approved by academic and external advisors affiliated with the Office for Environmental Programs. The major discipline areas include:",
                [
                    "Development",
                    "Conservation, Restoration and Landscape Management",
                    "Integrated Catchment Management",
                    "Energy Studies",
                    "Waste Management",
                    "Public Health",
                    "Education",
                    "Governance, Policy and Communication",
                    "Sustainable Cities Sustainable Regions",
                    "Sustainable Forests",
                    "Energy Efficiency Modelling and Implementation",
                    "Climate Change",
                    "Environmental Science",
                    "Tailored SpecialisationEach major offers a specific choice of subjects, in addition to two core subjects which all students must complete."
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who undertake research projects of 25 points or more may be eligible for research higher degree study."
    ]
}