{
    "Course name": "Master of Philosophy - Law",
    "Course code": "MR-PHILLAW",
    "Overview text": [
        "The degree of Master of Philosophy (MPhil) signifies that the holder has undertaken a substantial piece of original research, which has been conducted and reported by the holder under proper academic supervision and in a research environment for a prescribed period.",
        "The MPhil is an internationally recognised masters by research degree. It is designed for students to develop advanced skills in carrying out independent and sustained research. The thesis should demonstrate a critical application of specialist knowledge and make an independent contribution to existing scholarship in the area of research. It is written succinctly, in English, unless approval has been given for the thesis to be written in a language other than English.",
        "Duration of candidature is 1.5 years for full-time candidates (3 years part-time equivalent). One extension of 6 months (12 months) may be permitted with advisory committee approval, equating to a maximum course duration of 2 years (4 years).",
        "The normal length of an MPhil thesis is 40,000 words, exclusive of words in tables, maps, bibliographies and appendices. Footnotes are included as part of the word limit. The thesis should not exceed 50,000 words (or equivalent) without special approval from the Higher Degree Research Committee (HDRC).",
        "Candidates are expected to commence in February of their enrolling year."
    ],
    "Overview table": {
        "Award title": "Master of Philosophy",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "061967F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "9",
        "Duration": "2 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "The criteria for assessing applicants' eligibility for MPhil candidature are:",
            "1. \nMinimum qualifications Applicants are normally required to have completed at least a four-year honours degree at H2A standard from an Australian university, or a qualification or combination of qualifications considered by the Higher Degree Research Committee to be equivalent.\n",
            "2. \nMinimum level of academic achievementApplicants should have achieved an overall H1 (80-100%) or H2A (75-79%) grade in the relevant honours or Masters degree.\n",
            "3. \nRelevance of the degree The completed degree must be in an area that is relevant to the intended MPhil, including sufficient specialisation such that the applicant will have already developed an understanding and appreciation of a body of knowledge relevant to the intended MPhil.\n",
            "4. \nEvidence of research ability Applicants are normally required to have completed a research project/component that accounts for at least 25% of their year's work at fourth year or at Masters level.\n",
            "5. \nCurrency of applicant's knowledge of the discipline The applicant's degree(s) and/or professional experience must demonstrate that their knowledge of the discipline in which they plan to undertake their graduate research degree is current.\n",
            "6. \nAssessment of level of suitabilityBased on interview or other verbal communication, an assessment should be made of the level of understanding, motivation and time commitment of the applicant for the proposed program of study. For example, a full-time MPhil candidate would be expected to devote at least 40 hours a week to study and a part-time candidate about half of this.\n",
            "7. \nEnglish language requirementsApplicants must meet the University’s English language requirements."
        ],
        "Inherent requirements (core participation requirements)": [
            "All MPhil candidates are required to complete the equivalent of at least 6 months of full-time advanced study and research (12 months part-time) in the University unless studying at an outside institution approved by the Higher Degree Research Committee (HDRC). The HDRC will not approve entirely distance supervision or entirely online supervision for graduate researchers.",
            "Throughout their candidature, MPhil candidates are expected to attend the University in order to benefit from planning, conducting and writing up their research within a University community and environment.",
            "The residency requirement is deemed especially important during the period of probationary candidature. During probationary candidature the candidate is expected to interact on a regular basis with the supervisors, the Law School (including staff and other graduate researchers) and the University, so as:",
            "to build the skills and knowledge necessary to carry out the proposed research program;",
            "to acquire an understanding of the standards and requirements for an MPhil awarded by the University; and",
            "to make use of support programs and facilities provided by the University throughout candidature.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a candidate’s participation in the University’s programs. Graduate researchers who feel their disability will impact on meeting the requirements of this course are encouraged to discuss this matter with a Graduate Research Officer andStudent Equity and Disability Services."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "A candidate will have appropriately experienced supervisors and an advisory committee who, in consultation with the candidate, arrange a course of supervised research designed to suit the individual requirements and interests of the graduate researcher."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}