{
    "Course name": "Master of Arts (Advanced Seminar & Shorter Thesis)",
    "Course code": "MR-ARTSAST",
    "Overview text": [
        "The Master of Arts by Research (Advanced Seminar and Shorter Thesis) is a graduate research degree designed for students to develop advanced skills in carrying out independent and sustained research. The program also includes 25 point of coursework subjects. The thesis should demonstrate a critical application of specialist knowledge and skills in a chosen area of study and make an original contribution to the discipline.",
        "",
        "Last updated: 6 September 2024"
    ],
    "Overview table": {
        "Award title": "Master of Arts",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "080605G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "9",
        "Duration": "2 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a four-year honours degree in a relevant discipline which includes a substantial research component, equivalent to at least 25% of one year of full-time study. Applicants should have achieved a minimum weighted average of 70% in the final year subjects, or (University of Melbourne) equivalent, with a minimum result of 75% for the research component; or",
            "a Masters degree in a relevant discipline which includes a substantial research component, equivalent to at least 25% of one year of full-time study. Applicants should have achieved a minimum weighted average of 70% or (University of Melbourne) equivalent with a minimum result of 75% for the research component; or",
            "a qualification and professional experience considered to be equivalent;",
            "and",
            "a research proposal;",
            "referee reports (except for applicants who have graduated from the University of Melbourne within the last 5 years); and",
            "the endorsement of a prospective supervisor.",
            "Meeting these requirements does not guarantee selection",
            "2. In selecting applicants, the selection committee will consider applicants’:",
            "prior academic performance and, if relevant, professional qualifications;",
            "understanding of the research question to be explored;",
            "demonstrated ability in academic writing;",
            "performance at an interview;",
            "motivation and capacity to complete the course in a timely manner;",
            "relevant prior research and/or professional experience; and",
            "referee reports.",
            "3. The selection committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. The minimumEnglish language requirementsfor this course are: Band 7."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Description, Course Objectives and Generic Skills of this entry. The University is dedicated to provide support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Duration:1.5 years full-time / 3 years part-time",
                "Program Requirements -",
                [
                    "25 points of coursework subject/s",
                    "20,000 to 22,000 word thesis"
                ],
                "Please note:",
                [
                    "Students are required to enrol into the minor thesis subject (as per their specialisation) for 3 semesters full time (or part time equivalent).",
                    "The expected length of an MA shorter thesis is 20,000 to 22,000 words. Permission is required from the Associate Dean (Graduate Studies) if a thesis is to exceed 22,000 words."
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Master of Arts (Advanced Seminar and Shorter Thesis) graduates may proceed to further research in a Doctor of Philosophy degree."
    ]
}