{
    "Course name": "Master of TESOL",
    "Course code": "MC-TESOL",
    "Overview text": [
        "The Master of TESOL (Teaching English to Speakers of Other Languages) is designed for people wishing to teach* English as an Additional Language (EAL). It focuses on the curriculum, pedagogy, and language as they apply to classroom instruction and the provision of TESOL education within a variety of educational settings relevant to both local and international contexts.",
        "The two-year program is designed for people with little or no prior education qualifications or experience and includes studies in educational theories, policies, and approaches. Students in the two-year program will gain practical TESOL skills and knowledge to apply to a variety of educational settings*.",
        "The one-year fast-track program is for people with an education background, and provides options to focus on school or other educational settings. Qualified teachers may choose to complete the ‘EAL Teaching specialisation’ to add EAL as a specialist area for teaching in schools. Note that eligibility for teacher registration with the Victorian Institute of Teaching (VIT) is required to take this specialisation. Applicants who do not hold current teacher registration with the VIT are encouraged to contact theVITto determine eligibility.",
        "*Please note that this course is not an initial teacher education qualification and does not provide eligibility for registration to teach in Australian schools. For information on becoming a teacher, please visit theBecome a Teacherpage"
    ],
    "Overview table": {
        "Award title": "Master of TESOL",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "095992B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "A three-year undergraduate degree or equivalent in any discipline area.",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7is required.",
            "Note:",
            "a) Successful applicants with the following may be granted up to 100 credit points of advanced standing:",
            "A four-year education degree, or equivalent; or",
            "An undergraduate degree in any discipline and at least 100 credit points, or equivalent, of graduate study in education.",
            "b) Applicants who have completed the University of Melbourne Graduate Certificate in TESOL may be eligible to apply for entry to the Master of TESOL with 100 points of advanced standing, plus receive 50 points of credit for the ‘EAL Teaching’ specialisation subjects.",
            "c) Successful applicants with advanced standing who intend to complete the ‘EAL Teaching specialisation’ must be eligible for teacher registration with the Victorian Institute of Teaching (VIT). Applicants who do not hold current VIT registration are encouraged to contact theVITto determine eligibility.",
            "d) Credit is not normally granted for studies completed more than ten years prior to the course commencement. You may be eligible for advanced standing if your previous studies are more than ten years prior to the course commencement on the basis of substantial, relevant and documented professional work experience where recent prior learning can be demonstrated. Further information is contained in the University of MelbourneCredit, Advanced Standing and Accelerated Entry Policy."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.The core participation requirements for study in the Faculty of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching.",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. In courses requiring students to undertake practicum placements\n",
            "4. The ability to undertake professional practice placements independently, including:a. the ability based on personal maturity to establish a professional relationship with students and interact with them appropriately;b. the ability to communicate to students the subject matter being taught with clarity and in a way that is age-sensitive;c. the ability to model literacy and numeracy skills independently for students and in all their interactions meet community expectations of the literacy and numeracy skills teachers should have;d. the ability to demonstrate skilfully and safely activities required in particular discipline areas being taught (e.g. physical education activities, science laboratory techniques);e. the ability to create, monitor and maintain a safe physical environment, a stable and supportive psychological environment, and a productive learning environment in their classroom;f. the ability to establish effective relationships with all members of the school community, including colleagues, students, and caregivers;g. the ability based on mental and physical health to exercise sound judgment and respond promptly to the demands of classroom situations, and the personal resilience to cope and maintain their wellbeing under stress.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": []
        },
        "200POINT PROGRAM": {
            "overview": [
                "Students complete 200 points of study over two years of full time study (or part time equivalent). The compulsory subjects and education electives completed in the first year of the course provide a foundation in education studies. Students can choose from a range of education and additional languages electives. In the final semester of the course, students undertake aCapstoneProfessional Project option**; or may choose to complete theResearch option***(conditional upon meeting the eligibility criteria)."
            ],
            "": {
                "overview": []
            }
        },
        "100 POINT PROGRAMS": {
            "overview": [
                "Students with 100 points of advanced standing complete 100 points of study over one year of full time study (or part time equivalent). The 100 Point Program may be completed with or without an EAL Teaching specialisation (conditional upon meeting the eligibility criteria)."
            ],
            "100 Point Program with EAL Teaching Specialisation^": {
                "overview": [
                    "4 xEAL Teaching specialisationSubjects (50 points), and either theCapstone Professional Project**orResearch***option",
                    "^Students in the 100-point program who are eligible for teacher registration with the Victorian Institute of Teaching(VIT) may select theEAL Teaching specialisation. The specialisation comprises 4 core subjects, and includes 22 days of supervised teaching placement at a school or similar setting during school hours. Contact theVictorian Institute of Teaching (VIT)to determine eligibility if you do not already hold current registration."
                ]
            },
            "100 Point Program without EAL Teaching Specialisation": {
                "overview": [
                    "Students complete either",
                    "Capstone Professional Project**and 6x Additional Languages Elective subjects* orResearch***option, and 4x Additional Languages Elective subjects*"
                ]
            },
            "ALTERNATIVE EXIT POINT": {
                "overview": [
                    "An early exit point is available for students who commence the Masters, but later decide to not complete the whole course. These students may exit the Master of TESOL^^, and apply to graduate with one of the following awards:",
                    [
                        "Students in the 200-point program may exit this course early and apply to graduate with a Graduate Diploma in Educational Studies (GD-EDST), if they have satisfied the requirements for that award during their enrolment in this master degree course (i.e., successfully completed the first 100 credit points of study of the 200-credit point master degree).",
                        "Students that complete the EAL Teaching specialisation may exit this course early and apply to graduate with a Graduate Certificate in TESOL, if they have satisfied the requirements for that award during their enrolment in this master degree course (i.e., successfully completed all four EAL Teaching specialisation subjects)."
                    ],
                    "^^Students must discontinue their enrolment in the MC-TESOL without completing the award, to be conferred the exit award."
                ]
            }
        },
        "Subject options": {
            "overview": []
        },
        "200 POINT PROGRAM": {
            "overview": [],
            "First 50 Points": {
                "overview": [
                    "4 x compulsory subjects:",
                    [
                        "EDUC90930",
                        "EDUC90929",
                        "EDUC91029",
                        "EDUC91030"
                    ]
                ]
            },
            "Second 50 Points": {
                "overview": [
                    "4 x subjects chosen from theMC-ED Master of Education(includes Specialisation subjects, General Elective subjects, and Education Level 3 Elective subjects - up to 25 credit points; conditional to meeting subject prerequisites)."
                ]
            },
            "Final 100 Points": {
                "overview": [
                    "either:",
                    "Capstone Professional Project option",
                    [
                        "6 x Additional Languages electives* (75 points); and ",
                        "1 x capstone project subject**, taken in the final semester (25 points); or "
                    ],
                    "Research option",
                    [
                        "4 x Additional Languages electives* (50 points); and ",
                        "2 x research subjects*** (50 points). "
                    ]
                ]
            }
        },
        "100 POINT PROGRAM With EAL Teaching Specialisation": {
            "overview": [
                "Students with 100 points of advanced standing complete 100 points of study over one year of full time study (or part time equivalent). This program is includes undertaking an EAL Teaching Specialisation (students must meet eligibility criteria* to undertake this program).",
                "*Students undertaking this program (with EAL Teaching Specialisation) must be eligible for teacher registration with the Victorian Institute of Teaching (VIT). Contact theVictorian Institute of Teaching (VIT)to determine eligibility if you do not already hold current registration.",
                "4 xEAL Teaching specialisationcore subjects, and either:",
                "CapstoneProfessionalProject option",
                [
                    "2x Additional Languages electives* (25 points); and",
                    "1 x capstone project subject**, taken in the final semester (25 points)"
                ],
                "Researchoption",
                [
                    "2 x research subjects*** (50 points)"
                ]
            ]
        },
        "100 POINT PROGRAM (Without EAL Teaching Specialisation)": {
            "overview": [
                "Students with 100 points of advanced standing complete 100 points of study over one year of full time study (or part time equivalent). Students complete either theCapstoneorResearchoption:",
                "CapstoneProfessionalProject option",
                [
                    "6 x Additional Languages electives* (75 points); and",
                    "1 x capstone project subject**, taken in the final semester (25 points); or"
                ],
                "Researchoption",
                [
                    "4 x Additional Languages electives* (50 points); and",
                    "2 x research subjects*** (50 points)."
                ]
            ]
        },
        "": {
            "overview": []
        },
        "*Additional Languages Electives": {
            "overview": [
                [
                    "EDUC90101",
                    "EDUC90481",
                    "EDUC90109",
                    "EDUC90482",
                    "EDUC90587",
                    "EDUC90048",
                    "EDUC90096",
                    "EDUC90631",
                    "EDUC90996"
                ]
            ]
        },
        "**Capstone Professional Project": {
            "overview": [
                "Students complete an independent investigation of a topic that they regard as directly related to their own professional practice and/or within their area of specialisation in the 25-point Capstone Professional Project subject. The subject must be taken in the final semester of the course.",
                [
                    "EDUC90989"
                ]
            ]
        },
        "***Research Option": {
            "overview": [
                "The research subjects are designed for students intending to later pursue a graduate research degree, such as a PhD (please note that entry to graduate research degrees is dependent on a range of selection criteria and is competitive). They provide a grounding in educational research methodology and include the design and completion of a research project in education.",
                "The research subjects must be undertaken in the final 50 points of study, and the following eligibility criteria must be met to enrol into the subjects.",
                [
                    "Students in the 200-point program must achieve an average of at least H2A (75%) in the first 125 points of the course;",
                    "Students in the 100-point program must achieve an average of at least H2A (75%) in their first 50 points of their course."
                ],
                "The research methodology (EDUC90419) and research project in education (either EDUC91197 or EDUC91198 & EDUC91199) subjects can be taken in sequence, or together.",
                [
                    "EDUC90419",
                    "EDUC91197",
                    "EDUC91198",
                    "EDUC91199"
                ]
            ],
            "": {
                "overview": []
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduate Research Degrees",
        "The Faculty of Education is widely recognised as a leader in Australian and international education research.",
        "Graduates interested in graduate research with the Faculty of Education may have several options, depending on their prior qualifications, academic achievement, research experience and professional experience.",
        "Graduates who have completed the Capstone option in this course (MC-TESOL) may be eligible to apply to:",
        [
            "the Graduate Certificate in Educational Research, or",
            "the Master of Education (Research), or",
            "the Doctor of Education\n"
        ],
        "Graduates who have completed:",
        [
            "the 50 credit-point Research option in this course (MC-TESOL), or",
            "the Graduate Certificate in Educational Research, or",
            "the Master of Education (Research), or",
            "an undergraduate Honours degree,"
        ],
        "may be eligible to apply to one of the following research degrees:",
        [
            "Doctor of Philosophy - Education (PhD)",
            "Doctor of Education",
            "Master of Philosophy - Education"
        ],
        "Entry to these courses is a competitive process and each course has additional entry requirements such as minimum academic entry scores which must be met. ​Please check the Handbook course entry for details of entry requirements.",
        "For more information about graduate research study in Education see theFaculty of Education Research Degreespage."
    ]
}