{
    "Course name": "Master of Science (Physics)",
    "Course code": "MC-SCIPHY",
    "Overview text": [
        "The Master of Science (Physics) is a coursework masters degree incorporating a substantial research project.",
        "The School of Physics is well established and is internationally respected for its research excellence, broad-based undergraduate courses, and a challenging and rewarding postgraduate experience. Programs in astrophysics, theoretical particle and experimental particle physics explore questions relating to the origin, evolution and fate of our universe, addressing some of the most important and fundamental problems of our age. Research collaborations include the Large Hadron Collider at CERN in Geneva, the LIGO gravitational wave detector, and the MWA low frequency radio telescope.",
        "The Master of Science (Physics) gives students the opportunity to undertake a substantive research project in a field of choice as well as a broad range of coursework subjects including a professional skills component, as a pathway to PhD study or to the workforce"
    ],
    "Overview table": {
        "Award title": "Master of Science (Physics)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "094600J",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.  In order to be considered for entry, applicants must have completed:",
            "Meeting these requirements does not guarantee selection.",
            "1.  In ranking applications, the Selection Committee will consider:",
            "1.  The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "1.  Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note:"
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Science - Physics program offers students an exciting array of topics designed to prepare students for a career as a professional physicist and beyond. Students must complete 200 pts comprising:",
                [
                    "Discipline Component subjects (87.5 points);",
                    "Professional Skills subject (12.5 points);",
                    "Research Project (100 points)."
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Discipline Component": {
            "overview": [
                "Students must select seven of the following subjects:",
                [
                    "PHYC90007",
                    "PHYC90008",
                    "PHYC90012",
                    "PHYC90010",
                    "PHYC90009",
                    "PHYC90011",
                    "PHYC90013",
                    "PHYC90006",
                    "PHYC90056",
                    "PHYC90057"
                ],
                "*Students may substitute at most two approved subjects at 300 level or higher. It will be compulsory to take 300-level Statistical Physics or 300-level Electrodynamics if the student did not take these subjects (or their equivalent at another institution) during undergraduate studies. Please contact course coordinator for approval."
            ]
        },
        "Professional Skills": {
            "overview": [
                "Students must take one of the following subjects:",
                [
                    "MAST90044",
                    "MAST90045",
                    "SCIE90005",
                    "BUSA90403",
                    "MAST90007",
                    "SCIE90013",
                    "SCIE90012",
                    "COMP90072",
                    "MULT90063",
                    "LAWS90203",
                    "SCIE90026"
                ]
            ]
        },
        "Research Project": {
            "overview": [
                "Students will gain research experience in Physics by completing a 100 point Research Project comprising:",
                [
                    "Satisfactory outcomes for Progress Review Reports completed at the end of each semester (pass/fail);",
                    "Group seminar (15 min + 5 min questions) or preliminary research report (5 pages of mixed text, diagrams, and mathematical formulas) due after the student has enrolled in 25 points of Research Project (pass/fail); ",
                    "A preliminary literature survey and research plan at the end of year one or after the student has enrolled in 25 points of Research Project, (10 pages of mixed text, diagrams, and mathematical formulas) (pass/fail);",
                    "Major thesis, comprising up to 50 pages of mixed text, diagrams, and mathematical formulas, due at the end of the final semester of Research Project enrolment (70% of the final grade);",
                    "Assessment of research performance based on attendance, application, initiative and demonstrated skills (20% of the final grade);",
                    "An oral presentation lasting up to 30 minutes, given at the end of the final semester of Research Project enrolment (10% of the final grade);",
                    "Successful completion of a seminar series and/or reading course (depending on the research stream) providing advanced theoretical and/or practical training, marked on a pass/fail basis. Enrolment in the seminar series is required after completion of 25pts of Research Project.  "
                ],
                "The research project will be taken over consecutive semesters (to a maximum of four) and will begin on the Monday of the first semester of research project enrolment (semesters 1 or 2) and continue until the end of the final semester of research project enrolment. The research project work continues over summer and winter breaks, minus recreation leave of 4 weeks per yearFor how long and at what time within the enrolment the actual period of leave is to be taken needs to be negotiated with a student's supervisor.The thesis will be due for submission at the end of the formal examination period of the final semester of research project enrolment (usually fourth semester) if an earlier date is not specified.Students may enrol in a combination of research project subjects and coursework subjects as long as once the Research Project is commenced, the consecutive enrolment requirement is met and to ensure they have completed a total of 100 points for the research project by the end of their course.You must consult your supervisor to discuss an appropriate study plan prior to enrolling in your subjects online through the Student Portal. In particular, it is important that you agree an appropriate combination of research project points and coursework point enrolment each semester.",
                "The research project can be sequenced according to one of the following streams:",
                "STREAM A (FOUR SEMESTERS)",
                [
                    "PHYC90029",
                    "PHYC90033",
                    "PHYC90038",
                    "PHYC90044"
                ],
                "STREAM B (THREE SEMESTERS)",
                [
                    "PHYC90029",
                    "PHYC90035",
                    "PHYC90040"
                ],
                "STREAM C (THREE SEMESTERS)",
                [
                    "PHYC90030",
                    "PHYC90034",
                    "PHYC90040"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The Master of Science offers a pathway to a PhD."
    ]
}