{
    "Course name": "Master of Digital Infrastructure Engineering",
    "Course code": "MC-DINFENG",
    "Overview text": [
        "The professional Master of Digital Infrastructure Engineering is a degree that provides students with the necessary knowledge and skills to enter the international workplace where engineering and information technology meet: Graduates are skilled in connecting the physical world with digital world principles, and in applying these skills to complex, open-ended engineering tasks and problems.",
        "Within the course, students will learn how to capture built and natural environments in digital representations and how to accurately position in these environments using satellites, robots, laser scanning, or radio-based methods. They will study how to sense these environments and integrate semantic data into consistent multi-scale models. They will apply statistical and machine learning for data analysis for pattern recognition, prediction, and simulation-based engineering. They will also gain knowledge on how to visualise and communicate spatial and temporal information, and to conceptualise and use the digital models of the physical world in an ethical manner. They apply this knowledge for interaction between this information and the physical world in digital twins, resource-aware management, resilient communities, and simulation-based engineering, supporting a more sustainable and liveable future. Students may choose to specialize in one of these application areas, including land, construction, cities, mobility, energy, water, data, information technology, information systems, business, and more.",
        "The Master of Digital Infrastructure Engineering (Land) is fully accredited by the Surveyors Registration Board Victoria.",
        "Distinction",
        "Upon completion of the Master of Digital Infrastructure Engineering, it is possible for a student to be awarded Master of Digital Infrastructure Engineering with Distinction provided a student has achieved a high level of academic performance. Eligibility of the Distinction award is dependent on a calculated distinction score.",
        "The distinction score will only take into account Level 9 subjects undertaken at the University of Melbourne. This means Study Abroad and Exchange subjects will not be considered. One 12.5 point subject with the lowest mark will be omitted in the calculation of the distinction score. All level 9 subjects with credit points of more than 12.5 points must be included in the calculations.",
        "Only marks from the first attempt at a subject will be used. The average mark will be weighted by the credit points of the subjects. A Master of Engineering with Distinction will be awarded if the score is 80 or above.",
        "Hurdle Requirement",
        "In order to achieve the Engineering Practice Hurdle requirement, students will need to document the attainment of professional skills at an adequate level. This may include the successful completion of any of the following:",
        "Completion of the degree will not be approved until this requirement has been met."
    ],
    "Overview table": {
        "Award title": "Master of Digital Infrastructure Engineering",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "108720D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time or 72 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree with a weighted average mark of at least H3 (65%) or equivalent; andAt least 25 points of any tertiary-level Mathematics; andAt least 25 points of any tertiary-level Physics, Geography, Chemistry, Biology or Computer Science.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider;Prior academic performance; and if relevant Professional experience",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the University’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note:Applicants with the following may be awarded up to 100 points of credit:• University of Melbourne graduates who completed a Bachelor of Science or Bachelor of Design with a major in Digital Infrastructure Engineering Systems or Spatial Engineering Systems with a weighted average mark of at least H3 (65%) or equivalent; or• A Bachelor of Engineering, or equivalent as recognised by the Faculty of Engineering and Information Technology, in a cognate discipline* appropriate to the Master of Digital Infrastructure Engineering with a weighted average mark of at least H3 (65%) or equivalent.",
            "Available credit for other University of Melbourne graduates and graduates of other universities is normally evaluated on a case-by-case basis, but the Academic Board may approve standard credit arrangements for specified entry pathways.",
            "Graduate Degree Packages for School Leavers",
            "The University of Melbourne offers Graduate Degree Packages to high achieving school leavers, allowing them to secure places (Commonwealth Supported Places for domestic students or International fee places) in the Master of Engineering provided that they meet certain requirements.",
            "For a Commonwealth Supported Place or an International Fee Place, the applicant must:",
            "Complete an Australian Year 12 or the International Baccalaureate (IB) in 2018 or later either:In Australia; orOutside Australia and be an Australian citizen;Achieve an ATAR (or notional ATAR) of at least 96.00;Apply for a University of Melbourne Graduate Degree Packages for commencement in the year following completion of Year 12 or IB via VTAC;Enrol immediately or be granted deferral in the year following Year 12;Successfully complete a Bachelor of, Commerce, Design or Science at the University of Melbourne including all the specified prerequisite subjects; andCommence the Master of Engineering within 18 months of completing the undergraduate degree.Applicants should refer to the University handbook for the additional entry requirements for the undergraduate degrees in the Graduate Degree Packages.* Cognate discipline, such as geomatics, computer science, urban planning, or geography"
        ],
        "Inherent requirements (core participation requirements)": [
            "The Master of Digital Infrastructure Engineering welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree.",
            "The Master of Digital Infrastructure Engineering requires all students to enrol in subjects where they will require:",
            "the ability to comprehend complex science, technology and engineering related information;",
            "the ability to clearly and independently communicate a knowledge and application of science, technology and engineering principles and practices during assessment tasks; and,",
            "the ability to actively and safely contribute in laboratory, and fieldwork/excursion activities.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "There may be additional inherent academic requirements for some subjects, and these requirements are listed within the description of the requirements for each of these subjects.",
            "Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the relevant Subject Coordinator and Student Equity and Disability Support:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Engineers Australia and Surveyors Registration Board Victoria",
            "Accreditation will be sought from Engineers Australia and EUR-ACE (EURopean- ACcredited Engineer).",
            "The Master of Digital Infrastructure Engineering (Land) is fully accredited by the Surveyors Registration Board Victoria."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Digital Infrastructure Engineering requires the successful completion of 300 credit points.",
                "The Master of Digital Infrastructure Engineering is a three-year degree (full time)."
            ],
            "To obtain the degree (no specialisation) students must complete:": {
                "overview": [
                    [
                        "87.5 credit points of Year 1 compulsory subjects",
                        "12.5 credit points of Year 1 selectives",
                        "87.5 credit points of Year 2 compulsory subjects",
                        "12.5 credit points of Year 2 selectives",
                        "12.5 credit points of Year 3 compulsory subjects",
                        "25 credit points of Year 3 capstone subjects",
                        "12.5 credit points of Year 3 general selectives",
                        "50 credit points of Year 3 electives"
                    ]
                ]
            },
            "To obtain the degree with a specialisation, students must instead complete:": {
                "overview": [
                    [
                        "87.5 credit points of Year 1 compulsory subjects",
                        "12.5 credit points of Year 1 selectives",
                        "87.5 credit points of Year 2 compulsory subjects",
                        "12.5 credit points of Year 2 selectives",
                        "12.5 credit points of Year 3 compulsory subjects",
                        "25 credit points of Year 3 capstone subjects",
                        "12.5 credit points of Year 3 general selectives",
                        "50 credit points of Specialisation subjects"
                    ],
                    "50 credit points of Specialisation subjects"
                ]
            },
            "To complete this degree students should complete in the following order:": {
                "overview": [
                    "Year 1",
                    [
                        "87.5 credit points of Year 1 compulsory subjects",
                        "12.5 credit points of Year 1 selectives"
                    ],
                    "Year 2",
                    [
                        "87.5 credit points of Year 2 compulsory subjects",
                        "12.5 credit points of Year 2 selectives"
                    ],
                    "Year 3",
                    [
                        "12.5 credit points of Year 3 compulsory subjects",
                        "25 credit points of Year 3 capstone subjects",
                        "12.5 credit points of Year 3 general selectives",
                        "50 credit points of Year 3 electives for course option without specialisation or 50 credit points of Specialisation subjects for course option with a specialisation"
                    ],
                    "50 credit points of Year 3 electives for course option without specialisationor50 credit points of Specialisation subjects for course option with a specialisation",
                    "Note:",
                    "For specialisations, please refer to the individual specialisation page.",
                    "Progression:",
                    "The core subject lists are divided into specific year levels, reflecting the recommended order of completing the course. There may be, however, be some flexibility between Year 2 and 3 core subjects, depending on the requisites set between them. Check the individual Handbook entries of these subjects for more detail.",
                    "Engineering Practice Hurdle Requirement",
                    "Students enrolled in the master of engineering degree will need to satisfy the requirements of the Engineering Practice hurdle prior to being awarded the degree. Students will be introduced early in their degree to the online e-portfolio system as a way of documenting their attainment of graduate attributes which accord with University and professional accreditation standards. Students will keep a record of their stepwise attainment of these capabilities throughout their engineering studies at Melbourne. The artifacts recorded in the e-portfolio may include formal study elements, such as design reports, as well as reflections on extracurricular activities such as employment and volunteering activities.",
                    "Hurdle Requirement",
                    "In order to achieve the Engineering Practice Hurdle requirement, students will need to document the attainment of professional skills at an adequate level. This may include the successful completion of any of the following:",
                    "Skills Towards Employment Program (STEP)",
                    "ENGR90033 Internship subject",
                    "CHEN90028 Industry Project subject",
                    "An agreed level of internship at an approved engineering form (without receiving University credit)",
                    "Completion of the degree will not be approved until this requirement has been met."
                ]
            },
            "Study options": {
                "overview": [],
                "Year 1 compulsory subjects": {
                    "overview": [
                        [
                            "CVEN20001",
                            "CVEN30008",
                            "GEOM20013",
                            "GEOM20015",
                            "GEOM30009",
                            "GEOM30012",
                            "GEOM30014"
                        ]
                    ]
                },
                "Year 1 selectives": {
                    "overview": [
                        [
                            "COMP20005",
                            "ENGR20005"
                        ]
                    ]
                },
                "Year 2 compulsory subjects": {
                    "overview": [
                        [
                            "CVEN90062",
                            "GEOM90005",
                            "GEOM90006",
                            "GEOM90007",
                            "GEOM90008",
                            "GEOM90033",
                            "GEOM90038"
                        ]
                    ]
                },
                "Year 2 selectives": {
                    "overview": [
                        [
                            "COMP90087",
                            "LAWS90203"
                        ]
                    ]
                },
                "Year 3 compulsory subjects": {
                    "overview": [
                        [
                            "CVEN90045"
                        ]
                    ]
                },
                "Year 3 capstone subjects": {
                    "overview": [
                        [
                            "ENGR90037",
                            "ENGR90038"
                        ]
                    ]
                },
                "Year 3 general selectives": {
                    "overview": [
                        [
                            "ENGR90021",
                            "ENGR90034",
                            "ENGR90039"
                        ]
                    ]
                },
                "Year 3 electives for course option without specialisation": {
                    "overview": [
                        [
                            "ABPL90041",
                            "ABPL90064",
                            "ABPL90130",
                            "ABPL90131",
                            "ABPL90246",
                            "ABPL90290",
                            "ABPL90292",
                            "ABPL90293",
                            "ABPL90312",
                            "ABPL90313",
                            "ABPL90324",
                            "ABPL90335",
                            "ATOC90002",
                            "BUSA90473",
                            "BUSA90485",
                            "COMP90007",
                            "COMP90015",
                            "COMP90038",
                            "COMP90049",
                            "COMP90051",
                            "COMP90054",
                            "COMP90074",
                            "COMP90086",
                            "CVEN90048",
                            "CVEN90061",
                            "CVEN90063",
                            "ELEN90054",
                            "ELEN90057",
                            "ELEN90061",
                            "ENEN90006",
                            "ENEN90011",
                            "ENEN90014",
                            "ENEN90027",
                            "ENEN90029",
                            "ENEN90031",
                            "ENEN90032",
                            "ENEN90033",
                            "ENGM90006",
                            "ENGM90011",
                            "ENGM90012",
                            "ENGM90013",
                            "ENGR90026",
                            "ENGR90033",
                            "EVSC90033",
                            "GEOG90003",
                            "GEOG90019",
                            "GEOG90020",
                            "GEOM90041",
                            "GEOM90045",
                            "ISYS90026",
                            "ISYS90038",
                            "ISYS90048",
                            "ISYS90050",
                            "MCEN90028",
                            "MCEN90032",
                            "MGMT90225",
                            "PLAN90003",
                            "ELEN90088",
                            "ABPL90090",
                            "COMP90024",
                            "ABPL90282",
                            "ERTH90063",
                            "ABPL90075",
                            "ABPL90355",
                            "ERTH90062",
                            "CVEN90075",
                            "ABPL90405",
                            "ABPL90020"
                        ],
                        "Note:",
                        "To obtain the degree with a specialisation, please refer to the individual specialisation page for full detail of Year 3 specialisation subjects."
                    ]
                }
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}