{
    "Course name": "Master of Marketing",
    "Course code": "294FN",
    "Overview text": [
        "The Master of Marketing (MMktg) aims to equip marketing managers with an understanding of the issues involved in the analysis, planning, implementation, and control of marketing programs. Graduates will gain an in-depth understanding of the primary tasks and functions used to achieve the fundamental objectives of marketing management, which are attracting and retaining customers.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Master of Marketing",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "055075D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "162.5 credit points",
        "Duration": "12 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "• an undergraduate degree; and",
            "• two years of full-time work experience; and",
            "• a personal statement outlining why they wish to be considered for the course; and",
            "• referees' reports",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "• prior academic performance; and",
            "• the professional experience; and",
            "• the personal statement; and",
            "• the referee's report",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments",
            "4. The minimum English language requirements for this course are Band 6.5 English language requirements."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Marketing is a 13 subject program, comprising two initial integrative unit subjects, followed by a core of eight subjects. Six of these subjects/units are General Management subjects and the remainder are Marketing Management subjects."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Required Subjects": {
            "overview": [
                [
                    "BUSA90480",
                    "BUSA90481",
                    "BUSA90001",
                    "BUSA90224",
                    "BUSA90060",
                    "BUSA90193",
                    "BUSA90243",
                    "BUSA90042",
                    "BUSA90258",
                    "BUSA90261"
                ]
            ]
        },
        "Electives": {
            "overview": [
                "The remaining four subjects must be chosen from a range of marketing and marketing-related electives and should include subjects such as:",
                [
                    "BUSA90172",
                    "BUSA90248",
                    "BUSA90273",
                    "BUSA90299",
                    "BUSA90013"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}