{
    "Course name": "Master of Psychology (Clinical Psychology)",
    "Course code": "527CL",
    "Overview text": [
        "The clinical psychology program at the University of Melbourne began in the early 1970s. The program enjoys an excellent reputation as one of the premier clinical psychology programs in the country. The program aims to produce graduates with a strong knowledge base in psychopathology, combined with a high level of skill and acumen in culturally responsive assessment and treatment of psychological conditions that can present across the lifespan. Therapeutic skills are taught primarily within a broad cognitive-behavioural framework within didactic, individual and group-based clinical contexts.",
        "The course is accredited by theAustralian Psychology Accreditation Council (APAC),providing the required sequence of subjects for graduates wishing to attain generalist registration as a psychologist in Australia as well as competency in knowledge and skills relevant to the clinical psychology specialisation.",
        "The course is comprised of coursework subjects, practical experience through clinical placements and a research thesis in an area relevant to clinical psychology. All subjects are compulsory. The academic members of the clinical teaching staff are active in both clinical work and research in a wide variety of clinical domains. Hence, the Program provides the opportunity to access a wide range of clinical placement settings and research programs.",
        "In their first year, all students assess and provide treatment for adult clients referred to the University of Melbourne Psychology Clinic. In addition, all students undertake two second year field placements- one where the focus is on assessment and treatment of children and/or adolescents and the other focussing on clinical work with adults."
    ],
    "Overview table": {
        "Award title": "Master of Psychology (Clinical Psychology)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "009681G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "within the last 10 years, an Australian Psychology Accreditation Council (APAC) accredited four-year undergraduate sequence in psychology (namely a three-year major in psychology as part of an undergraduate degree plus a fourth year Honours specialisation in psychology or equivalent) with a weighted average mark of at least H2A (75%) or equivalent. The weighted average is calculated one third from third year (Level 3) psychology subjects and two thirds from fourth year (Level 4) psychology subjects; and",
            "a personal statement of no more than 500 words; and",
            "two referee reports to be submitted online; and",
            "attend a selection interview (short-listed applicants only).",
            "For applicants with results from the University of Melbourne for subjects undertaken in Semester 1, Winter Term and/or Semester 2, 2020, the following will apply:",
            "A Psychology Benchmark will be established based on all psychology subjects completed any time other than Semester 1, Winter Term and Semester 2, 2020.",
            "Subjects undertaken in Semester 1, Winter Term and/or Semester 2, 2020, for which results are lower than the Psychology Benchmark will be excluded from the entry score calculation.",
            "The above changes do not apply to yearlong subjects undertaken in 2020; such results will be included in the entry score calculation.",
            "In the case that applying this rule results in no eligible Level 3 and Level 4 marks for inclusion, then the Psychology Benchmark will be used as the entry score.",
            "For external applicants, the benchmark will not apply and we will use numerical scores for all available level 3 and level 4 psychology subjects in the selection formula. Pass/fail grades will be excluded from the selection formula. In the case that excluding pass/fail subjects from the selection formula leaves either the Level 3 or Level 4 terms in the formula empty, the entry score will be the non-empty term (i.e., average of eligible Level 3 subjects if no Level 4 marks are eligible for inclusion; average of eligible Level 4 subjects if no Level 3 marks are eligible for inclusion).",
            "For the avoidance of doubt, the exclusion of results based on the Psychology Benchmark does not apply to any study periods other than those listed above.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "suitability for clinical training as determined by the interview, personal statement and referee reports.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required.",
            "Notes.",
            "The weighted average is calculated one third from third year psychology subjects and two thirds from fourth year psychology subjects.",
            "Selection into the two Master of Psychology courses associated with a PhD place in Psychology requires the approval of the intended PhD supervisor, the Faculty of Medicine, Dentistry and Health Sciences, and the Melbourne School of Graduate Research.",
            "Applicants must enrol in the Masters programme (Clinical Psychology or Clinical Neuropsychology) and then apply to articulate to the combined PhD programme towards the end of their first year in the Masters programme."
        ],
        "Inherent requirements (core participation requirements)": [
            "Students must comply with Fitness to Practice Rules, which are accessible fromSchedule 1of theStudent Fitness to Practice Policy (MPF1345).",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.",
            "The University is dedicated to provide support to those with special requirements, Further details on the disability support scheme can be found at the Disability Liaison Unit website:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Psychology Accreditation Council",
            "Accredited by the Australian Psychology Accreditation Council and recognised by the Australian Health Practitioner Regulation Agency (AHPRA)"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "This course consists of coursework, placement and a minor research thesis (6,000 to 10,000 words).",
                "Coursework consists of 14 classroom-based subjects taken over the two years of the course (see below) and 125 days of Placement (30 days in the first-year and 95 days in the second-year)."
            ]
        },
        "Subject options": {
            "overview": [
                "In order to satisfy the requirements of the Master of Psychology (Clinical) students must complete the following subjects:",
                "First-year subjects",
                [
                    "PSYC90003",
                    "PSYC90012",
                    "PSYC90006",
                    "PSYC90009",
                    "PSYC90023",
                    "PSYC90029",
                    "PSYC90030",
                    "PSYC90031",
                    "PSYC90007",
                    "PSYC90011",
                    "PSYC90015",
                    "PSYC90008",
                    "PSYC90125"
                ],
                "Second-year subjects",
                [
                    "PSYC90077",
                    "PSYC90078",
                    "PSYC90016",
                    "PSYC90017",
                    "PSYC90010",
                    "PSYC90027",
                    "PSYC90095",
                    "PSYC90096"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}