{
    "Course name": "Master of Business Analytics",
    "Course code": "MC-BUSANA",
    "Overview text": [
        "The goal of this course is to equip its graduates with the capabilities to apply data analytic techniques to a variety of business problems. The knowledge and skills required to apply data analytic techniques to business problems are multi-disciplinary, drawing on mathematics, statistics, computer science, and business and economics. The course will cover foundation and advanced data analytic techniques, as well as frameworks for applying those techniques to a variety of business contexts.",
        "Last updated: 24 May 2024"
    ],
    "Overview table": {
        "Award title": "Master of Business Analytics",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "084058J",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "12 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have:",
            "completed an undergraduate degree of 3 or 4 years minimum in one of the relevant areas listed below, taken at a third-year university level from a recognised institution, with a minimum weighted average mark (WAM) of 65% or equivalent.",
            "o Commerceo Mathematics and/or Physicso Computer Science or Information Systemso Engineering and/or Science",
            "Interviews will be required for applicants who are shortlisted; and",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "an interview for short-listed applicants;",
            "The work experience (only applicable to part-time applicants)",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.0 is required. International students must demonstrate proficiency in English either through IELTS score (minimum score requirement of 7.0 overall with no individual score less than 7) or TOEFL IBT score (minimum of 94, and a written score minimum of 27 and no band less than 24).",
            "Note:GMAT scores may be required if a University of Melbourne credit average equivalence is difficult to obtain."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": []
        },
        "Full-time and Part-time – 150 credit pts": {
            "overview": [
                [
                    "BUSA90539"
                ],
                [
                    "BUSA90537"
                ],
                [
                    "BUSA90538"
                ],
                [
                    "BUSA90536"
                ],
                [
                    "BUSA90542"
                ],
                [
                    "BUSA90540"
                ],
                [
                    "BUSA90541"
                ],
                [
                    "BUSA90543"
                ],
                [
                    "BUSA90544"
                ],
                [
                    "BUSA90545"
                ],
                "Capstone subjects:",
                "Standard pathway",
                [
                    "BUSA90546"
                ],
                "And",
                [
                    "BUSA90547"
                ],
                "* (part-time)",
                "Or",
                [
                    "BUSA90550"
                ],
                [
                    "BUSA90551"
                ],
                "* (full-time)",
                "Research pathway",
                [
                    "BUSA90504"
                ],
                "*Note: Students who would like to take Research Pathway are required to acquire the approval of course coordinator prior to enrolment."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}