{
    "Course name": "Master of Software Engineering",
    "Course code": "MC-SOFTENG",
    "Overview text": [
        "The Master of Software Engineering is an entry-to-practice degree that provides students with the necessary knowledge and skills to enter the international workplace as software engineers. Graduates are skilled in software engineering principles and have the ability to apply these skills to complex, open-ended engineering tasks and problems. The degree provides sequential study in the software engineering discipline, building on a solid foundation in mathematics and programming. Within the degree, students acquire core skills in the areas of software processes, project management, requirement analysis, design and architecture, implementation, testing, communication and teamwork. Students may also choose to undertake specialisations in business, artificial intelligence, distributed computing, cyber security and human computer interaction. The degree culminates in a capstone experience in which students will work on a software engineering project involving real-life clients. Students have the opportunity to participate in overseas study, industry-based projects and supervised research.",
        "Distinction",
        "Upon completion of the Master of Software Engineering, it is possible for a student to be awarded Master of Software Engineering with Distinction provided a student has achieved a high level of academic performance. Eligibility of the Distinction award is dependent on a calculated distinction score.",
        "The distinction score will only take into account Level 9 subjects undertaken at the University of Melbourne. This means Study Abroad and Exchange subjects will not be considered. One 12.5 point subject with the lowest mark will be omitted in the calculation of the distinction score. All level 9 subjects with credit points of more than 12.5 points must be included in the calculations. Only marks from the first attempt at a subject will be used. The average mark will be weighted by the credit points of the subjects. A Master of Engineering with Distinction will be awarded if the score is 80 or above.",
        "Hurdle Requirement",
        "In order to achieve the Engineering Practice Hurdle requirement, students will need to document the attainment of professional skills at an adequate level. This may include the successful completion of any of the following:",
        "1. Skills Towards Employment Program (STEP)",
        "2. ENGR90033 Internship subject",
        "3. CHEN90028 Industry Project subject",
        "4. An agreed level of internship at an approved engineering form (without receiving University credit)",
        "Completion of the degree will not be approved until this requirement has been met."
    ],
    "Overview table": {
        "Award title": "Master of Software Engineering",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "106110B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time or 72 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree with a weighted average mark of at least H3 (65%) or equivalent; and",
            "At least 25 points of any tertiary-level Mathematics; and",
            "At least 25 points of any tertiary-level Computer Programming",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider;",
            "Prior academic performance; and if relevant",
            "Professional experience",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the University’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note:",
            "Applicants with the following may be awarded up to 100 points of credit:",
            "Graduates of Melbourne Model BSc undergraduate degree who complete the Computing and Software Systems majors with a weighted average mark of at least H3 (65%) or equivalent;",
            "A Bachelor of Engineering, or equivalent as recognised by the Melbourne School of Engineering, in a cognate discipline appropriate to the stream of the Master of Engineering into which entry is sought with a weighted average mark of at least H3 (65%) or equivalent.",
            "Available credit for other University of Melbourne graduates and graduates of other universities is normally evaluated on a case-by-case basis, but the Academic Board may approve standard credit arrangements for specified entry pathways.",
            "Graduate Degree Packages for School Leavers",
            "The University of Melbourne offers Graduate Degree Packages to high achieving school leavers, allowing them to secure places (Commonwealth Supported Places for domestic students or International fee places) in the Master of Engineering provided that they meet certain requirements.",
            "For a Commonwealth Supported Place or an International Fee Place, the applicant must:",
            "Complete an Australian Year 12 or the International Baccalaureate (IB) in 2018 or later either:\n\nIn Australia; or\nOutside Australia and be an Australian citizen;\n\n",
            "In Australia; or",
            "Outside Australia and be an Australian citizen;",
            "Achieve an ATAR (or notional ATAR) of at least 96.00;",
            "Apply for a University of Melbourne Graduate Degree Packages for commencement in the year following completion of Year 12 or IB via VTAC;",
            "Enrol immediately or be granted deferral in the year following Year 12;",
            "Successfully complete a Bachelor of Biomedicine, Commerce, Design or Science at the University of Melbourne including all the specified prerequisite subjects; and",
            "Commence the Master of Engineering within 18 months of completing the undergraduate degree.",
            "In Australia; or",
            "Outside Australia and be an Australian citizen;",
            "Applicants should refer to the University handbook for the additional entry requirements for the undergraduate degrees in the Graduate Degree Packages."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Master of Software Engineering welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree.",
            "The Master of Software Engineering requires all students to enrol in subjects where they will require:",
            "The ability to comprehend complex science, technology and engineering related information;",
            "The ability to clearly and independently communicate a knowledge and application of science, technology and engineering principles and practices during assessment tasks; and,",
            "The ability to actively and safely contribute to computer laboratory base project activities in team settings.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "There may be additional inherent academic requirements for some subjects, and these requirements are listed within the description of the requirements for each of these subjects.",
            "Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the relevant Subject Coordinator and Student Equity and Disability Support:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Software Engineering requires the successful completion of 300 credit points.",
                "The Master of Software Engineering is a three year degree (full time)."
            ],
            "To obtain the degree (no specialisation) students must complete:": {
                "overview": [
                    [
                        "50 credit points of Year 1 compulsory subjects",
                        "12.5 credit points of Year 1 Software Engineering Group A selectives",
                        "12.5 credit points of Year 1 Software Engineering Group B selectives",
                        "25 credit points of Year 1 Group A (Level 2 & 3 B-SCI Discipline subjects) and Group B (Level 3 COMP subjects) electives includingA minimum of 12.5 credit points of Year 1 Group B (Level 3 COMP) electives\n",
                        "A minimum of 12.5 credit points of Year 1 Group B (Level 3 COMP) electives",
                        "75 credit points of Year 2 compulsory subjects",
                        "50 credit points of Year 3 compulsory subjects",
                        "75 credit points of electives including\nA minimum of 62.5 credit points of Software Engineering electives\nA maximum of 12.5 credit points of Approved electives\n\n",
                        "A minimum of 62.5 credit points of Software Engineering electives",
                        "A maximum of 12.5 credit points of Approved electives"
                    ],
                    [
                        "A minimum of 12.5 credit points of Year 1 Group B (Level 3 COMP) electives"
                    ],
                    [
                        "A minimum of 62.5 credit points of Software Engineering electives",
                        "A maximum of 12.5 credit points of Approved electives"
                    ]
                ]
            },
            "To obtain the degree with a specialisation, students must instead complete:": {
                "overview": [
                    [
                        "50 credit points of Year 1 compulsory subjects",
                        "12.5 credit points of Year 1 Software Engineering Group A selectives",
                        "12.5 credit points of Year 1 Software Engineering Group B selectives",
                        "25 credit points of Year 1 Group A (Level 2 & 3 B-SCI Discipline subjects) and Group B (Level 3 COMP subjects) electives includingA minimum of 12.5 credit points of Year 1 Group B (Level 3 COMP) electives\n",
                        "A minimum of 12.5 credit points of Year 1 Group B (Level 3 COMP) electives",
                        "75 credit points of Year 2 compulsory subjects",
                        "50 credit points of Year 3 compulsory subjects",
                        "\n75 credit points of Year 2 and 3 specialisation subjects including:\n\n\nBetween 12.5 and 62.5 credit points of core specialisation subjects depending on respective specialisation requirements AND Between 12.5 and 62.5 credit points of specialisation electives and/or Software Engineering/Approved electives depending on respective specialisation requirements\n"
                    ],
                    [
                        "A minimum of 12.5 credit points of Year 1 Group B (Level 3 COMP) electives"
                    ],
                    "75 credit points of Year 2 and 3 specialisation subjects including:",
                    "Between 12.5 and 62.5 credit points of core specialisation subjects depending on respective specialisation requirements",
                    "AND",
                    "Between 12.5 and 62.5 credit points of specialisation electives and/or Software Engineering/Approved electives depending on respective specialisation requirements",
                    "Note:",
                    "To obtain the degree with a specialisation, please refer to the individual specialisation page for full detail.",
                    "Note:",
                    "Students entering the course with advanced standing who plan on completing a specialisation may need to enrol in core specialisation subjects in their commencing semester. Please check and follow the structure outlined for your intended specialisation and seek course planning advice."
                ]
            },
            "To complete this degree without specialisation students should complete in the following order:": {
                "overview": [
                    "Year 1",
                    [
                        "50 credit points of Year 1 compulsory subjects",
                        "12.5 credit points of Year 1 Software Engineering Group A selectives",
                        "12.5 credit points of Year 1 Software Engineering Group B selectives",
                        "12.5 credit points of Year 1 Group A electives",
                        "12.5 credit points of Year 1 Group B electives"
                    ],
                    "Year 2",
                    [
                        "75 credit points of Year 2 compulsory subjects",
                        "25 credit points of Software Engineering electives"
                    ],
                    "Year 3",
                    [
                        "50 credit points of Year 3 compulsory subjects",
                        "50 credit points of electives including\nA minimum of 37.5 credit points of Software Engineering electives\nA maximum of 12.5 credit points of Approved electives\n\n",
                        "A minimum of 37.5 credit points of Software Engineering electives",
                        "A maximum of 12.5 credit points of Approved electives"
                    ],
                    [
                        "A minimum of 37.5 credit points of Software Engineering electives",
                        "A maximum of 12.5 credit points of Approved electives"
                    ],
                    "Note:",
                    "For specialisations, please refer to the individual specialisation page.",
                    "Progression:",
                    "The core subject lists are divided into specific year levels, reflecting the recommended order of completing the course. There is, however, some flexibility between Year 2 and 3 core subjects, depending on the requisites set between them. Check the individual Handbook entries of these subjects for more detail.",
                    "Engineering Practice Hurdle Requirement",
                    "Students enrolled in the master of engineering degree will need to satisfy the requirements of the Engineering Practice hurdle prior to being awarded the degree. Students will be introduced early in their degree to the online e-portfolio system as a way of documenting their attainment of graduate attributes which accord with University and professional accreditation standards. Students will keep a record of their stepwise attainment of these capabilities throughout their engineering studies at Melbourne. The artifacts recorded in the e-portfolio may include formal study elements, such as design reports, as well as reflections on extracurricular activities such as employment and volunteering activities.",
                    "Hurdle Requirement",
                    "In order to achieve the Engineering Practice Hurdle requirement, students will need to document the attainment of professional skills at an adequate level. This may include the successful completion of any of the following:",
                    "Skills Towards Employment Program (STEP)",
                    "ENGR90033 Internship subject",
                    "CHEN90028 Industry Project subject",
                    "An agreed level of internship at an approved engineering form (without receiving University credit)",
                    "Completion of the degree will not be approved until this requirement has been met."
                ]
            },
            "Study options (without specialisation)": {
                "overview": [
                    "Year 1 compulsory subjects",
                    [
                        "COMP30026",
                        "INFO20003",
                        "SWEN20003",
                        "SWEN30006"
                    ],
                    "Year 1 Software Engineering Group A selectives",
                    [
                        "ENGR90021",
                        "ENGR90034",
                        "ENGR90039"
                    ],
                    "Year 1 Software Engineering Group B selectives",
                    [
                        "COMP20003",
                        "COMP20007"
                    ],
                    "Year 1 Group A electives",
                    "Any level 2 or 3 subject drawn from the Bachelor of Science program",
                    "Year 1 Group B electives",
                    "12.5 credit points ofLevel 3 Computer Science subject",
                    "Year 2 compulsory subjects",
                    [
                        "COMP30023",
                        "SWEN90004",
                        "SWEN90006",
                        "SWEN90009",
                        "SWEN90014",
                        "SWEN90016"
                    ],
                    "Year 3 compulsory subjects",
                    [
                        "SWEN90007",
                        "SWEN90010",
                        "SWEN90017",
                        "SWEN90018"
                    ],
                    "Software Engineering electives",
                    [
                        "COMP90048",
                        "COMP90049",
                        "COMP90050",
                        "COMP90053",
                        "COMP90054",
                        "COMP90056",
                        "COMP90057",
                        "COMP90073",
                        "COMP90074",
                        "COMP90077",
                        "COMP90085",
                        "COMP90086",
                        "COMP90087",
                        "ENGR90033",
                        "ENGR90036",
                        "COMP90084",
                        "COMP90014",
                        "COMP90015",
                        "COMP90016",
                        "COMP90017",
                        "COMP90018",
                        "COMP90020",
                        "COMP90024",
                        "COMP90025",
                        "COMP90042",
                        "COMP90043",
                        "COMP90044",
                        "COMP90045",
                        "COMP90046",
                        "COMP90051",
                        "COMP90083",
                        "COMP90089",
                        "ISYS90070",
                        "INFO90003",
                        "INFO90006",
                        "INFO90007",
                        "GEOM90007",
                        "INFO90004",
                        "INFO90005",
                        "COMP90090",
                        "ISYS90069"
                    ],
                    "Approved electives",
                    [
                        "BUSA90473",
                        "BUSA90485",
                        "ENGM90006",
                        "ENGM90011",
                        "ENGM90013",
                        "ENGM90014",
                        "ENGR90026",
                        "MCEN90031",
                        "ENGM90012",
                        "ELEN90095",
                        "ELEN90096"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}