{
    "Course name": "Master of Narrative Therapy and Community Work",
    "Course code": "MC-NTCW",
    "Overview text": [
        "The Master of Narrative Therapy and Community Work is a specialist graduate qualification for professionals interested in enhancing their clinical and practice-research skills. The degree prepares graduates for working with narrative approaches with individuals, families and communities, particularly in the areas of trauma and recovery.",
        "Narrative therapy is a respectful, non-blaming approach to counselling and community work, which centres people as the experts in their own lives. It views problems as separate from people and assumes people have many skills, competencies, beliefs, values, commitments and abilities that will assist them to reduce the influence of problems in their lives. Narrative approaches to therapy and community work are used by social workers, psychologists, community development workers, nurses, teachers, doctors, and other health professionals in a wide range of practice settings.",
        "The Master of Narrative Therapy and Community Work provides formal training and recognition for narrative therapy and is delivered as a joint initiative of the Department of Social Work (The University of Melbourne) and The Dulwich Centre, Adelaide. The Dulwich Centre is the international centre for narrative therapy training, established in 1984. Since this time the Dulwich Centre has led the development of narrative therapy that is now considered a mainstream modality in many contexts."
    ],
    "Overview table": {
        "Award title": "Master of Narrative Therapy and Community Work",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 12 months full-time or 24 months part-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• an undergraduate degree in a cognate discipline, or equivalent; and• at least two years of documented, relevant work experience; and• evidence of completion of prior narrative therapy studies at Dulwich Centre, or equivalent; and• a personal statement outlining why they wish to be considered for the course; andApplicants must also nominate a professional referee from whom a report may be sought.Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:• prior academic performance; and• the work experience; and• the personal statement; and• the professional referee report.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Counselling Association",
            "The Master of Narrative Therapy and Community Work is accredited by the Australian Counselling Association (ACA).",
            "Master of Narrative Therapy and Community Work graduates are eligible to apply for full membership and registration with ACA."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Narrative Therapy and Community Work is comprised of three compulsory subjects, all at level 9:",
                [
                    "SCWK90060"
                ],
                [
                    "SCWK90062"
                ],
                [
                    "SCWK90061"
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                [
                    "SCWK90060",
                    "SCWK90062",
                    "SCWK90061"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}