{
    "Course name": "Master of Sports Rehabilitation",
    "Course code": "MC-SPREHAB",
    "Overview text": [
        "The Master of Sports Rehabilitation is a 150-credit point, fully online program designed to produce graduates with extended knowledge and skills for professional practice in the areas of sports and rehabilitation. The curriculum is internationally relevant, fosters interdisciplinary communication and embraces the specialised requirements of different health professionals. It is designed for practicing professionals as it can be studied part time or full time. Graduate attributes are aligned with those of The Melbourne Graduate.",
        "A wholly online Master of Sports Rehabilitation is inherently innovative and combines knowledge fundamental to rehabilitation, sports and exercise and is based on three overlapping foundational pillars incorporated within learning, teaching and assessment tasks. The program has:",
        "This approach is pedagogically robust and embraces the progressing international climate of flexible, sustainable, distance learning models. Assessment tasks can be completed at a distance and submitted electronically, encompassing a variety of written and presentation formats relevant to clinicians in demonstrating knowledge, clinical reasoning, communication and reflective skills in academic and practice contexts.",
        "The Master of Sports Rehabilitation is designed for professionals across degree-qualified health professional disciplines, throughout career stages and internationally. Post-graduates striving to achieve best practice professionally in Sports Rehabilitation will be able to embrace community health through working with recreational athletes to the elite athletes across the lifespan, inclusive of adolescent, adult and senior athletes. The program challenges and extends clinicians to anticipate, enhance and advance best practice internationally.",
        "The curriculum is designed around three elements which will be covered explicitly within learning outcomes in each subject throughout the program: 1) Theory and Practice, 2) Evidence and Innovation and 3) Clinical Practice in Context. Linking theory, research and practice is emphasised, utilising scientific evidence to underpin clinical practice and decisions. The Masters in Sports Rehabilitation core subjects explore professional and clinical practice relating to sport and rehabilitation across the lifespan and across variable levels of abilities. Alongside 8 core (including a capstone) subject, the course includes 3 elective subjects enabling students to scaffold their learning according to their interest areas and practice context. These subjects all require analysis, synthesis and creative problem solving within a range of practice contexts; extending knowledge and understanding, research principles and new innovations that are necessary to undertake sports rehabilitation practice in different environments.",
        "The capstone component is designed to demonstrate the application of knowledge and skills to: plan and execute a substantial research-based project, OR capstone experience OR piece of scholarship, in the area of sports medicine, ensuring that this program meets AQF level 9 requirements. A research project or a professional project can be selected for theCapstoneproject. The Research Capstone allows students to engage with a research team and more explicitly examine a sports rehabilitation relevant research question in some depth. The professional project capstone will allow the student to complete a professional project in the area of sports rehabilitation practice. They will design and evaluate a professional project in a practice context with the support of an academic mentor.",
        "Last updated: 4 July 2024"
    ],
    "Overview table": {
        "Award title": "Master of Sports Rehabilitation",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a bachelor degree or equivalent in the discipline of Physiotherapy, Medicine, Exercise Science, Podiatry, or another relevant discipline; and",
            "at least 2 years of relevant post-entry to practice professional experience in clinical, sport, health or exercise science.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applicants, the Selection Committee will consider:",
            "prior academic performance; and",
            "professional experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.0 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Student Equity and Disability Support website.http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                [
                    "75 points of compulsory subjects",
                    "50 points of electives",
                    "25 points of capstone"
                ],
                "Students may take subjects in any sequence subject to availability, however, all core subjects must be completed prior to commencing the Capstone projects."
            ],
            "Compulsory": {
                "overview": [
                    [
                        "REHB90001",
                        "REHB90007",
                        "MEDI90092",
                        "SMED90001",
                        "HLTH90001",
                        "REHB90010"
                    ]
                ]
            },
            "Electives": {
                "overview": [
                    [
                        "REHB90003",
                        "REHB90006",
                        "REHB90005",
                        "REHB90008",
                        "REHB90011",
                        "REHB90002",
                        "REHB90009",
                        "RADI90024",
                        "PSYC90108"
                    ]
                ]
            },
            "Capstone options": {
                "overview": [
                    [
                        "REHB90012",
                        "REHB90013"
                    ]
                ]
            },
            "": {
                "overview": []
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The Physiotherapy Department also offers other Masters by Coursework in other specialist fields and Research Higher Degrees at PhD and Masters level."
    ]
}