{
    "Course name": "Master of Applied Psychology",
    "Course code": "MC-AP",
    "Overview text": [
        "The Master of Applied Psychology (MAP) is designed for psychology graduates who want to develop practical skills in the applications of psychology and to employ them in the world of business; government; the non-profit sector; marketing, consumer and social research; and health. The MAP is an innovative 1.5 year (full-time) program that includes subjects from the School of Psychological Sciences, the Faculty of Business and Economics, and the School of Population and Global Health. Subjects will cover social psychology, influence and persuasion, the psychology of advertising and communications, judgement and decision-making, attitude and behaviour change, consumer psychology, research methods and data analysis in addition to an industry internship or research project in the final semester.",
        "The Master of Applied Psychology does not carry professional accreditation and is not a pathway to professional registration as a psychologist.",
        "Last updated: 11 April 2024"
    ],
    "Overview table": {
        "Award title": "Master of Applied Psychology",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "096378E",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "• an undergraduate degree with a major in psychology or a Graduate Diploma in Psychology.",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applicants, the Selection Committee will consider:• prior academic performance. This is based on a weighted average of psychology subjects. In computing the weighted average, the average of the third year (Level 3) Psychology subjects is assigned twice the weight of the average of the second year (Level 2) Psychology subjects.",
            "For applicants with results from the University of Melbourne for subjects undertaken in Semester 1, Winter Term and/or Semester 2, 2020, the following will apply:",
            "\nA Psychology Benchmark will be established based on all psychology subjects completed any time other than Semester 1, Winter Term and Semester 2, 2020.• Subjects undertaken in Semester 1, Winter Term and/or Semester 2, 2020, for which results are lower than the Psychology Benchmark will be excluded from the entry score calculation\n",
            "The above changes do not apply to yearlong subjects undertaken in 2020; such results will be included in the entry score calculation.",
            "In the case that applying this rule results in no eligible Level 2 and Level 3 marks for inclusion, then the Psychology Benchmark will be used as the entry score.",
            "For external applicants, the benchmark will not apply and we will use numerical scores for all available level 2 and level 3 psychology subjects in the selection formula.",
            "Pass/fail grades will be excluded from the selection formula.",
            "In the case that excluding pass/fail subjects from the selection formula leaves either the Level 2 or Level 3 terms in the formula empty, the entry score will be the non-empty term (i.e.,average of eligible Level 2 subjects if no Level 3 marks are eligible for inclusion; average of eligible Level 3 subjects if no Level 2 marks are eligible for inclusion).",
            "For the avoidance of doubt, the exclusion of results based on the Psychology Benchmark does not apply to any study periods other than those listed above.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 or equivalent is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Student Equity and Disability websitehttp://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete 125 points of compulsory subjects, and 25 points of Capstone requirements (PSYC90106 Research Project OR PSYC90107 Internship).",
                "Completion of the following subjects prior to undertaking the Group Research Project or Internship:",
                [
                    "PSYC90100 Applied Research Methods",
                    "PSYC40005 Advanced Design and Data Analysis"
                ]
            ],
            "Year 1, Semester 1": {
                "overview": [
                    [
                        "PSYC40005",
                        "PSYC90101",
                        "PSYC90103"
                    ],
                    "And one of:",
                    [
                        "MKTG90008",
                        "MKTG90004"
                    ]
                ]
            },
            "Year 1, Semester 2": {
                "overview": [
                    [
                        "PSYC90102",
                        "PSYC90100",
                        "PSYC90124",
                        "POPH90231"
                    ]
                ]
            },
            "Year 2, Semester 1": {
                "overview": [
                    [
                        "PSYC90104",
                        "PSYC90105"
                    ]
                ],
                "Capstone Requirement": {
                    "overview": [
                        "One of:",
                        [
                            "PSYC90106",
                            "PSYC90107"
                        ]
                    ]
                }
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}