{
    "Course name": "Master of Commerce (Finance)",
    "Course code": "MC-COMFIN",
    "Overview text": [
        "The Master of Commerce (Finance) represents Years 1 & 2 of the 5-year Doctoral Program in Finance and is only available to students pursuing the doctoral program.",
        "Last updated: 4 April 2024"
    ],
    "Overview table": {
        "Award title": "Master of Commerce (Finance)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "092762G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "In order to be considered for entry, applicants must have completed:",
            "A four-year undergraduate degree in finance or a quantitative discipline, or equivalent, with a University of Melbourne equivalent weighted average mark of least 75% (H2A) or equivalent; or",
            "qualification and professional experience considered to be equivalent;",
            "And",
            "successfully completed university level subjects in Calculus and Linear Algebra;",
            "and submit:",
            "a personal statement outlining why they wish to be considered for the course (maximum of 1,000 words); and",
            "a Graduate Management Admission Test (GMAT) or Graduate Record Examination (GRE) test, unless the applicant has met one of the Faculty’s doctoral-level conditions for GMAT/GRE exemption; and",
            "academic referee reports (except for applicants who have graduated from the University of Melbourne within the last 5 years).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applicants, the selection committee will consider:",
            "prior academic performance; and",
            "the results of a Graduate Management Admission Test (GMAT) or Graduate Record Examinations (GRE) test completed within the last 5 years. No minimum GMAT or GRE score is required. The average score of successful applicants is around 680-700 (GMAT) and 324 (GRE).**The following applicants for this course are exempt from submitting a GMAT or GRE test: ◦Those who have completed an undergraduate degree in Australia or New Zealand within the 18 months prior to the date of application; or◦Those who face significant humanitarian issues;",
            "Performance in an interview during which the applicant’s level of understanding, motivation and time commitment will be assessed; and",
            "relevant prior research and/or professional experience; and",
            "referee reports; and",
            "the personal statement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Commerce (Finance) consists of 16 subjects comprising 9 compulsory Finance subjects, 1 Derivative subject, 1 Economics subject, 1 Econometrics subject, 1 Mathematics subject and either 3 or 4 constrained choice electives.",
                "Progression from Year 1to Year 2 of the Master of Commerce (Finance) requires:",
                [
                    "A minimum average of 75% overall in the subjects taken during Year 1; and",
                    "a minimum average of 75% for the compulsory Finance subjects taken in Year 1."
                ],
                "Students who discontinue from the Master of Commerce (Finance) after Year 1 but have successfully completed the requirements of the Graduate Diploma in Commerce (Finance) will be eligible to receive the Graduate Diploma in Commerce (Finance) as an exit award.",
                "Progression from Year 2of the Master of Commerce (Finance) to the Doctor of Philosophy (Business and Economics) requires:",
                [
                    "A minimum average of 75% overall in the subjects taken during Year 2; and",
                    "a minimum average of 75% for the compulsory Finance subjects taken in Year 2."
                ]
            ]
        },
        "Subject options": {
            "overview": [],
            "Year One": {
                "overview": [
                    [
                        "FNCE90002",
                        "FNCE90009",
                        "FNCE90041",
                        "FNCE90042"
                    ],
                    [
                        "FNCE90005",
                        "MAST30001"
                    ],
                    [
                        "ECON90063",
                        "ECON90002",
                        "ECON90062",
                        "ECON30024",
                        "ECON90022",
                        "ECON30022"
                    ],
                    [
                        "ECOM90002",
                        "ECOM90013"
                    ],
                    [
                        "ECON90053",
                        "MAST20026",
                        "MAST90057",
                        "MAST90058",
                        "MAST90059",
                        "MAST90027",
                        "MAST90051"
                    ]
                ]
            },
            "Year Two": {
                "overview": [
                    "All students must complete the following subjects:",
                    [
                        "FNCE90076",
                        "FNCE90077",
                        "FNCE90007",
                        "FNCE90090",
                        "FNCE90091"
                    ],
                    [
                        "ECON90063",
                        "ECON90002",
                        "ECON90012",
                        "ECON90062",
                        "ECON30024",
                        "ECON90022",
                        "ECON30022",
                        "ECON90003",
                        "ECOM90013",
                        "ECOM90005",
                        "ECOM90003",
                        "ECOM90014",
                        "ECOM90011"
                    ],
                    "And students must select one of the following options:",
                    "Option One:One additional 12.5-point elective from the Year 1 or Year 2 Economics, Econometrics or Mathematics elective subjects listed above;",
                    "or",
                    [
                        "FNCE90043",
                        "FNCE90044"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}