{
    "Course name": "Master of Architectural Engineering",
    "Course code": "MC-ARCHENG",
    "Overview text": [
        "The Master of Architectural Engineering will produce graduates with a capacity to operate across the complementary disciplines of Architecture and Engineering. This program is distinct in its ambition to achieve dual accreditation and provide pathways to both professions.",
        "Master of Architectural Engineering students will be taught by staff from the Melbourne School of Engineering and the Faculty of Architecture, Building and Planning. The two main areas of study will be investigated via discipline¬ based subjects, while the linkages between the two will be explored via a dedicated architectural engineering capstone/thesis subject.",
        "Students entering via an undergraduate major in architecture will initially complete an 8 subject sequence in engineering. Students entering from engineering major will complete an 8 subject sequence in architecture. At the completion of first year, both groups will commence a shared second year sequence.",
        "Note:All students will enter the course with 100 points advanced standing for either the architecture or engineering first year sequence of subjects (depending on their background). i.e. Engineering graduates will be granted advanced standing for the engineering first year subjects; Architecture graduates will be granted advanced standing for the architecture first year subjects.",
        "Last updated: 16 July 2024"
    ],
    "Overview table": {
        "Award title": "Master of Architectural Engineering",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "089660F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "450 credit points",
        "Duration": "42 months full-time or 84 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "The entry requirements for the Master of Architectural Engineering are:",
            "For students coming from an Engineering undergraduate degree:",
            "Completion of an undergraduate degree in Engineering with a minimum GPA of 65%",
            "Meet the University of Melbourne's English language requirements ()",
            "Design Folio (it is recommended that in order to produce a folio, students undertake a second year Architecture design studio subject)",
            "One Architectural History subject",
            "For students coming from an Architecture undergraduate degree:",
            "Completion of an undergraduate degree in Architecture with a minimum GPA of 65%",
            "Maths attainment equivalent to Calculus 2 + Linear Algebra + two Science subjects",
            "Design folio",
            "Rationale: Maths requirements are necessary to ensure that students have the minimum requisites required to undertake engineering subjects. These requisites are also reflected in the single Master of Engineering degree.",
            "As students will enter the degree with an Engineering or Architecture undergraduate major, students will be granted 100 points of advanced standing upon entry, meaning that the Master of Architectural Engineering will require the completion of only a further 350 points.",
            "Master of Architectural Engineering1. In order to be considered for entry applicants must have completed:",
            "an undergraduate degree in an architecture or engineering discipline with a weighted average mark of at least H3 (65%), or equivalent; and",
            "a design portfolio in a format as specified by the Selection Committee; and",
            "a personal statement outlining relevant prior study and work experience, and motivation to undertake the course; and",
            "at least 25 points of appropriate tertiary level Mathematics and at least 25 points of appropriate tertiary level Science.",
            "Applicants who are completing pre-requisite subjects as single subject study in order to meet the Mathematics and/or Science entry requirements will be required to achieve a grade of at least H3 (65%) or equivalent in each individual prerequisite subject to satisfy this entry requirement.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the personal statement; and",
            "the design portfolio.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university's English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approve by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Master of Architectural Engineering welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the degree.A candidate for the Master of Architectural Engineering must have abilities and skills which include the following: observation, communication, motor, conceptual, integrative, and quantitative, and behavioural and social. Adjustments can be provided to minimise the impact of a disability, however, particularly at Masters level, students need to be able to participate in programs in an independent manner and with regard to their safety and the safety of others.(i)Observation:Candidates must be able to read text, diagrams, maps, drawings and numerical data. Candidates should be able to observe details at a number of scales and to record useful observations of environmental contexts:(ii)Communication:Candidates should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. Candidates must be able to communicate effectively and sensitively. Candidates should be able to clearly and independently communicate a knowledge and application of science, technology and engineering principles and practices during assessment tasks. Communication includes not only speech but also reading and writing, presenting one's own work in front of a large group, receiving and responding to feedback about one's own work in a public setting. Assessment in architecture design studio subjects will involve 'crits' where students present their own work in front of a large group, where they will receive and respond to feedback about their work in a public setting. Grits are an integral part of working in the industry and are an inherent requirement of the course.(iii)Motor:Candidates should have sufficient motor function to elicit information from environmental contexts. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments. Candidates should have sufficient motor ability to prepare documentation of analytic texts, drawings and models of findings and for the reparation of proposals for environmental interventions via digital or other means. Candidates should have the ability to actively participate in appropriate site and/or design studio-based activities.(iv)Intellectual-Conceptual:Integrative and Quantitative Abilities: These abilities include measurement, calculation, reasoning, analysis, synthesis and, importantly, the ability to interpret results of such work. Problem resolution, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, given the disciplines pursued in the SD, candidates should be able to comprehend three­ dimensional relationships and to understand the spatial relationships in environmental structures of a wide range of scales - from smaller than the individual through individual buildings and urban spaces to large geographic areas. The ability to comprehend complex science, technology and engineering related information Further, graduate study entails learning to master one's own abilities and skills and to deploy them strategically. This requires further developing skills in both reflective and reflexive thinking and being able to practice these skills.(v)Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. Assessment in architectural design studio subjects will involve 'crits' where students presenttheir own work in front of a large group, where they will receive and respond to feedback about their work in a public setting. Grits are an integral part of working in the industry and are an inherent requirement of the course. In some areas of study, the ability to actively and safely contribute in clinical, laboratory, and fieldwork/excursion activities is required.There are additional inherent academic requirements for some subjects, and these requirements are listed within the description of the requirements for each of these subjects.Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the relevant Subject Coordinator and the Disability Liaison Unit:",
            "http://services.unimelb.edu.au/disability"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Engineers Australia",
            "This course is fully accredited by Engineers Australia at the level of professional engineer Washington Accord.",
            "Architects Registration Board of Victoria",
            "Completion of the Master of Architectural Engineering meets the academic requirements for registration as an architect under the Architects Registration Board of Victoria.  In addition, professional experience post-graduation is required to sit the registration examination."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "All students are granted 100 points of advanced standing (appropriate for their background), and then must complete a further 350 points:",
                [
                    "100 points core in the first year, and",
                    "250 points in second and third year, including 25 points Capstone Project."
                ],
                "Students entering via an undergraduate major in architecture will initially complete an 8 subject sequence in Engineering (100 points core, pathway for architecture graduates). Students entering from an engineering major will complete an 8 subject sequence in architecture (100 points core pathway for engineering graduates). At the completion of first year, all students commence a shared second year sequence."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "First year pathway for architecture graduates (core)": {
            "overview": [
                "Students in this pathway must complete the following subjects (100 points):",
                [
                    "ENGR20004",
                    "ENGR20003",
                    "MAST20029",
                    "ENGR90021",
                    "ENEN20002",
                    "CVEN30009",
                    "CVEN30010",
                    "ENGR30002"
                ]
            ]
        },
        "First year pathway for Engineering graduates (core)": {
            "overview": [
                "Students in this pathway must complete the following subjects (100 points):",
                [
                    "ABPL90284",
                    "ABPL90285",
                    "ABPL90286",
                    "ABPL90287",
                    "ABPL90288",
                    "ABPL90289"
                ]
            ]
        },
        "Common second and third year (core)": {
            "overview": [
                "All students must complete the following subjects (250 points):",
                [
                    "ABPL90390",
                    "CVEN90043",
                    "CVEN90044",
                    "CVEN90050",
                    "CVEN90045",
                    "CVEN90051",
                    "CVEN90049",
                    "CVEN90058",
                    "CVEN90060",
                    "ABPL90437",
                    "ABPL90438",
                    "ABPL90439",
                    "ABPL90117",
                    "ABPL90118",
                    "ABPL90140",
                    "ABPL90424"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a wide range of other graduate coursework degrees as well as research higher degree programs, including the Doctor of Philosophy."
    ]
}