{
    "Course name": "Master of Creative Arts Therapy",
    "Course code": "MC-CAT",
    "Overview text": [
        "The Master of Creative Arts Therapy is a blended learning program offering students a specialisation in either drama or dance movement therapy. Students undertake supervised creative arts therapies industry placements in various contexts including, community, health, and education",
        "The Master of Creative Arts Therapy has been developed specifically for arts educators, community arts workers, health workers and therapists who are interested in training to practice as a drama or dance movement therapist. The creative arts therapies are a form of psychotherapy utilising creative modalities within a therapeutic relationship to improve and inform physical, mental and emotional well-being.",
        "It provides students with studies in theory, methods, research and professional practice across health, educational and community contexts. There is an emphasis on how each artistic modality is employed in teams with groups and individuals. The teaching method incorporates experiential, theoretical and practice-based learning approaches.",
        "This course has been developed in collaboration with National Australian Music Therapy Research Unit and the Creative Arts Therapy Research Unit advisory Board.",
        "Note: Additional requirement:Before commencement of the course, applicants are required to obtain a police check and a valid Working with Children Check.",
        "Last updated: 13 September 2024"
    ],
    "Overview table": {
        "Award title": "Master of Creative Arts Therapy",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "0100983",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a bachelor degree or equivalent; or at least six years of documented relevant work experience; AND ",
            "a written proposal; and ",
            "a portfolio; and ",
            "an interview (shortlisted applicants only).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic achievement; or documented relevant work experience; AND",
            "the written proposal; and ",
            "the portfolio; and ",
            "performance in an interview (shortlisted applicants only). ",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the University’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required.",
            "Notes:",
            "Details for the written proposal, portfolio and interview (shortlisted applicants only) can be found on the Fine Arts and Music Study website  ",
            "Successful applicants will be required to hold a current Working with Children Check and current police check and these must remain current for the duration of the course. "
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes.",
            "Students who have a disability which may prevent them from participating in tasks involving these inherent academic requirements are encouraged to contact Student Equity and Disability Services:https://students.unimelb.edu.au/student-support/student-equity-and-disability-support"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "200-point program:",
                [
                    "150 points of compulsory subjects",
                    "50 points of subjects compulsory to one of the following specialisations:\n\n",
                    [
                        [
                            "Drama Therapy (50 credit points); or",
                            "Dance Movement Therapy (50 credit points)."
                        ]
                    ]
                ]
            ],
            "Year 1": {
                "overview": [
                    [
                        "CREA90002",
                        "CREA90003",
                        "CREA90004",
                        "CREA90008",
                        "CREA90009",
                        "CREA90012"
                    ],
                    "PLUS",
                    "Two compulsory subjects according to the specialisation being undertaken."
                ]
            },
            "Year 2": {
                "overview": [
                    [
                        "CREA90013",
                        "CREA90014",
                        "CREA90017",
                        "CREA90007",
                        "CREA90018",
                        "CREA90019"
                    ],
                    "PLUS",
                    "Two compulsory subjects according to the specialisation being undertaken."
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}