{
    "Course name": "Master of Engineering Management",
    "Course code": "761EM",
    "Overview text": [
        "The Master of Engineering Management has been developed in conjunction with Melbourne Business School to offer broader business study opportunities to our students. Students will choose from selected Master of Management subject offerings.",
        "Graduates may then be eligible for advanced standing into the Master of Management if they choose to continue their business studies.",
        "The Master of Engineering Management is offered in two specialisations: Project Management and Change Management.",
        "Last updated: 6 September 2024"
    ],
    "Overview table": {
        "Award title": "Master of Engineering Management",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "054325K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• either– a four year undergraduate degree in engineering or a cognate discipline with a weighted average mark of at least H3 (65%) average, or equivalent, or– an undergraduate degree in an appropriate discipline with a weighted average mark of at least H3 (65%) average, or equivalent, and at least two years documented relevant work and/or professional experience since graduation.Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:• prior academic performance; and where relevant• the professional experience.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 6.5is required.For more information on meeting the University's English language requirements, see:http://futurestudents.unimelb.edu.au/info/international/english_and_foundation_programs"
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Student Support and Engagement Policy, academic requirements for this subject are articulated in the Subject Overview, Learning Outcomes, Assessment and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the University’s programs. Students who feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and the Disability Liaison Unit:",
            "http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Association to Advance Collegiate Schools of Business",
            "The Master of Engineering Management is accredited by the Association to Advance Collegiate Schools of Business (AACSB)."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Engineering Management is a100 Point Program,and students will have a choice of two specialisations: Project Management or Change Management."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects (12.5 points)": {
            "overview": [
                "All students will complete the following Engineering Capstone Project",
                [
                    "ENGM90016"
                ]
            ]
        },
        "Elective Subjects (37.5 points)": {
            "overview": [
                "Students must selectthreeelectives from the below list:",
                [
                    "MGMT90026",
                    "MGMT90140",
                    "ACCT90004",
                    "MGMT90141",
                    "FNCE90060",
                    "ECON90015",
                    "MGMT90032",
                    "MGMT90015"
                ]
            ]
        },
        "And the following Capstone Project (12.5 points)": {
            "overview": [
                [
                    "MGMT90146"
                ]
            ]
        },
        "Plus one specialisation (37.5 points)": {
            "overview": [
                "See links to specialisations below (Change Management and Project Management)."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}