{
    "Course name": "Master of Clinical Rehabilitation",
    "Course code": "MC-CLINRHB",
    "Overview text": [
        "The Master of Clinical Rehabilitation is a fully online graduate program that is designed to support students at different stages in their careers, including career starters and those with clinical experience seeking to improve their practice and gain further qualification. The online delivery model allows this course to be structured to suit student study preferences and individual needs. This Masters program supports independent and collaborative learning and offers a strong cohort experience with both asynchronous and synchronous learning experiences.",
        "The emphasis in this course is on promoting contemporary best practice rehabilitation in multiple clinical and community contexts in both national and global settings. This course builds on students’ knowledge and skills to identify and analyse the multiple determinants of health that influence wellbeing, and to design and implement rehabilitation strategies in a holistic, person-centred manner at both an individual and group level.",
        "Students will learn about the principles of rehabilitation and habilitation, the physiology of fitness and conditioning and the pathophysiology of selected conditions and specific needs in different chronic disease populations. The use of evidence informed clinical decision-making, emerging technologies and rehabilitation approaches, and strategies for the effective and safe implementation of rehabilitation in a range of practice contexts will be examined. Specifically, students will learn techniques including exercise prescription, goal setting and health behaviour modification, measurement of physical activity and sedentary behaviours, fitness evaluation and the selection of appropriate outcome measurements and indicators. At a group level, students will learn to complete a health needs analysis for rehabilitation programs, write grant applications for funding of rehabilitation programs and measure group outcomes.",
        "Students have the option of enrolling in a Masters degree (150 points of study) or one of the nested awards; Specialist Certificate of Clinical Rehabilitation (25 points), Graduate Certificate of Clinical Rehabilitation (50 points), or the Graduate Diploma of Clinical Rehabilitation (100 points).",
        "Last updated: 4 July 2024"
    ],
    "Overview table": {
        "Award title": "Master of Clinical Rehabilitation",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• an undergraduate degree in the discipline of Physiotherapy, Medicine, Exercise Science, Occupational Therapy or Nursing; and• at least 2 years of relevant post-entry to practice professional work experience.Meeting these requirements does not guarantee selection.",
            "2. In ranking applicants, the Selection Committee will consider:• prior academic performance; and• professional work experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.0 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Student Support and Engagement Policy, academic requirements for this subject are articulated in the Subject Overview, Learning Outcomes, Assessment and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support:http://services.unimelb.edu.au/disability"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students are required to complete six compulsory subjects, four electives and one capstone subject."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Compulsory Subjects": {
            "overview": [
                "Students take all:",
                [
                    "REHB90001",
                    "REHB90002",
                    "HLTH90001",
                    "REHB90003",
                    "REHB90009",
                    "REHB90010"
                ]
            ]
        },
        "Elective Subjects": {
            "overview": [
                "Students choose four:",
                [
                    "REHB90004",
                    "REHB90005",
                    "REHB90006",
                    "REHB90007",
                    "REHB90008",
                    "POPH90256",
                    "POPH90257",
                    "POPH90258",
                    "POPH90260",
                    "RADI90024",
                    "PHTY90114",
                    "HLTH90018",
                    "MEDI90092",
                    "SCWK90067",
                    "SCWK90068"
                ]
            ]
        },
        "Capstone Subjects": {
            "overview": [
                "Students choose one:",
                [
                    "REHB90012",
                    "REHB90013"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The Master of Rehabilitation Science can form a pathway to a research higher degree at the Doctoral level through 1) completion of the ‘Research and Evidence’ compulsory subject (12.5 credit points) or equivalent subject and 2) completion of the research option for their capstone project (25 credit points)."
    ]
}