{
    "Course name": "Master of Actuarial Science",
    "Course code": "MC-ACTSC",
    "Overview text": [
        "The overall aim of the Masters of Actuarial Science is to provide graduates who have a bachelor’s degree that includes a strong mathematical component with a one and a half year program that provides a pathway to a professional actuarial career. Graduates of the degree will be well placed to undertake further graduate work in actuarial studies, or to enter the actuarial profession. The Master of Actuarial Science provides the fastest graduate pathway to professional entry to the actuarial profession.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Master of Actuarial Science",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "0101265",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.In order to be considered for entry, applicants must have completed:",
            "an undergraduate or postgraduate degree with the equivalent of a major in mathematically based subjects, for example, studies in mathematics, statistics, physics, engineering;",
            "MAST20004 Probability and MAST20005 Statistics or subjects in probability and statistics at an equivalent level;",
            "a personal statement outlining why they wish to be considered for the course.",
            "Meeting these requirements does not guarantee selection.2.In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the personal statement.",
            "3.The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4.Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, the following performance bands are required:",
            "IELTS: 6.5 (with no band less than 6.0)",
            "TOEFL (paper test): 577 with TWE 4.5",
            "TOEFL (internet): 79 with Writing 21, Speaking 18, Reading 13, Listening 13",
            "Pearson Test of English (Academic): 58-64 inclusive and no communicative skill below 50",
            "Notes:",
            "Students who successfully complete the Graduate Diploma in Actuarial Science may be eligible to progress to the Master of Actuarial Science with 100 points credit.",
            "Students enrolled in the Master of Actuarial Science who are either unable, or who choose not to continue with their studies, may be eligible to exit with a Graduate Diploma in Actuarial Science. Students must have successfully completed four core subjects and four elective subjects and be in good standing to be eligible to be awarded the Graduate Diploma in Actuarial Science.",
            "Students who successfully complete the Master of Actuarial Science may be eligible to progress to the Master of Actuarial Science (Enhanced) with 150 points credit."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Business and Economics welcomes applications from students with disabilities. It is University and Faculty policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.",
            "The BCom and Masters degrees of the Faculty of Business and Economics equip graduates with the knowledge and technical skills necessary to understand and participate in the modern business world. The degrees include the following academic requirements for study:",
            "(1) The ability to explain and evaluate concepts, theories, institutional arrangements and operations of modern mixed economies;(2) The ability to critically evaluate the economy, commerce and business in the broader social and political context;(3) The ability to explain and apply concepts across a range of commerce and business disciplines in solving business and policy problems; and(4) The ability to contribute positively to the development of organisations and society in relation to business, government and the commercial professions.",
            "All students of the Faculty’s courses must possess intellectual, ethical, and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the Faculty. Candidates for the BCom degree and for FBE Masters degrees must have abilities and skills in communication; in conceptual, integrative, and quantitative dimensions; and in behavioural and social dimensions.",
            "I. Communication: The student must be able to communicate effectively and efficiently in oral and/or written form. A student must have the ability to clearly and independently communicate knowledge and application of a discipline, principles or practices during assessment tasks, and in some discipline streams.",
            "II. Intellectual‐Conceptual, Integrative and Quantitative Abilities: The student is expected to have the ability to develop problem‐solving skills and demonstrate the ability to establish study plans and priorities. These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving requires all of these intellectual abilities. Students should also have the ability to comprehend complex disciplinary and cross disciplinary information related to the BCom and Masters degrees.",
            "III. Behavioural and Social Attributes: A student must possess behavioural and social attributes that enable them to participate in a complex learning environment and the emotional health required for full utilisation of his/her intellectual abilities. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. Integrity, concern for others, interpersonal skills, interest, and motivation are all personal qualities that are deemed necessary for students enrolled in FBE courses.",
            "Students who feel their disability will prevent them from participating in tasks involving the inherent academic requirements of the BCom and FBE Masters courses are encouraged to contact the Disability Liaison Unit. Adjustments can be provided to minimise the impact of a disability, but students should participate in the course in an independent manner."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "If students obtain a sufficiently high pass in the program, they will receive some exemptions from the professional actuarial examinations conducted by the Actuaries Institute and the Institute and Faculty of Actuaries (UK)."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The degree is designed to be completed in one and a half years of full-time study and requires the completion of 150 points. The degree consists of 12 semester-length subjects comprising 6 compulsory core subjects, 2 capstone subjects and 4 elective subjects."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Year 1": {
            "overview": [],
            "Semester 1": {
                "overview": [],
                "CORE SUBJECTS": {
                    "overview": [
                        [
                            "ACTL90001",
                            "ACTL90006"
                        ]
                    ]
                },
                "ELECTIVE SUBJECTS": {
                    "overview": [
                        "Twoelective subjects (25 points) approved by the Program Director.",
                        "The following two electives are recommended for Professional Accreditation exemptions:",
                        [
                            "ACCT90042",
                            "ACTL90023"
                        ]
                    ]
                }
            },
            "Semester 2": {
                "overview": [],
                "CORE SUBJECTS": {
                    "overview": [
                        [
                            "ACTL90002",
                            "ACTL90007",
                            "ACTL90021"
                        ]
                    ]
                },
                "CAPSTONE SUBJECT": {
                    "overview": [
                        [
                            "ACTL90005"
                        ]
                    ]
                }
            }
        },
        "Year 2": {
            "overview": [],
            "Semester 1": {
                "overview": [],
                "CORE SUBJECT": {
                    "overview": [
                        [
                            "ACTL90003"
                        ]
                    ]
                },
                "CAPSTONE SUBJECT": {
                    "overview": [
                        [
                            "ACTL90020"
                        ]
                    ]
                },
                "ELECTIVE SUBJECTS": {
                    "overview": [
                        "Twoelective subjects (25 points) approved by the Program Director.",
                        "The following two electives are recommended for Professional Accreditation exemptions:",
                        [
                            "ACTL90008",
                            "ACTL90022"
                        ],
                        "Optional elective, subject to Program Director's approval:",
                        [
                            "BUSA90525"
                        ]
                    ]
                }
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}