{
    "Course name": "Master of Clinical Optometry",
    "Course code": "MC-CLINOPT",
    "Overview text": [
        "THIS COURSE IS NOT TAKING APPLICATIONS FOR 2024.",
        "The Department of Optometry and Vision Sciences has a long history of engagement in postgraduate training programs for professional optometrists. Our current offerings include the Master of Clinical Optometry (MClinOptom) and six Specialist Certificates.",
        "The courses are offered part-time and with an optimum balance of formal education and flexible study options. Local optometrists, from both Australian and New Zealand, can easily satisfy the compulsory 40 points CPD and each subject lists therapeutics points earned on completion. Suitably qualified overseas candidates can take advantage of the flexible, time independent, online delivery of the course and subjects.",
        "To gain the Master of Clinical Optometry (100 points) qualification, candidates must successfully complete 1 x 25-point compulsory subject (Research Studies in Optometry) and 3 x 25-point elective subjects."
    ],
    "Overview table": {
        "Award title": "Master of Clinical Optometry",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applications must have completed: ",
            "a four-year undergraduate degree in Optometry, or equivalent or;",
            "professional experience deemed by the Selection Committee to be equivalent to a four-year Australian degree in Optometry ",
            "Meeting this requirement does not guarantee selection",
            "1.  In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and, if relevant",
            "any documented relevant professional experience. ",
            "1. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instructions. ",
            "1. Applicants are required to satisfy the university’s English language requirements for postgraduate courses.  For those applications seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "One compulsory subject (25 points) plus three electives (75 points)."
            ]
        },
        "Elective subjects": {
            "overview": [
                "Choose three of the following electives:",
                [
                    "OPTO90006",
                    "OPTO90009",
                    "OPTO90010",
                    "OPTO90015",
                    "OPTO90016",
                    "OPTO90007"
                ]
            ]
        },
        "Compulsory research subject": {
            "overview": [
                [
                    "OPTO90031"
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "": {
            "overview": []
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}