{
    "Course name": "Master of Commerce (Accounting)",
    "Course code": "MC-COMACT",
    "Overview text": [
        "The Master of Commerce (Accounting) represents years 1 and 2 of the new 5 year doctoral program in Accounting and is only available to students pursuing the doctoral program.",
        "Last updated: 4 April 2024"
    ],
    "Overview table": {
        "Award title": "Master of Commerce (Accounting)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "092763F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.In order to be considered for entry, applicants must have completed:",
            "a four-year undergraduate degree in accounting, finance, economics or other quantitative discipline with a University of Melbourne equivalent weighted average mark of least 75% (H2A) or equivalent; or",
            "a qualification and professional experience considered to be equivalent; and submit:",
            "a personal statement outlining why they wish to be considered for the course (maximum of 1,000 words); and",
            "a Graduate Management Admission Test (GMAT) or Graduate Record Examination (GRE) Test unless the applicant has met one of the Faculty’s doctoral-level conditions for GMAT/GRE exemption; and",
            "academic referee reports (except for applicants who have graduated from the University of Melbourne within the last 5 years).",
            "Meeting these requirements does not guarantee selection.",
            "2.In ranking applicants, the selection committee will consider:",
            "prior academic performance; and",
            "the results of a Graduate Management Admission Test (GMAT) of a Graduate Record Examinations (GRE) test completed within the last 5 years. No minimum GMAT or GRE score is required. The average score of successful applicants is around 680-700 (GMAT) and 324 (GRE). The following applicants for this course are exempt from submitting a GMAT or GRE test:\n\n",
            [
                [
                    "Those who have completed an undergraduate degree in Australia or New Zealand within the 18 months prior to the date of application; or",
                    "Those who face significant humanitarian issues;"
                ]
            ],
            "performance in an interview during which the applicant’s level of understanding, motivation and time commitment will be assessed; and",
            "relevant prior research and/or professional experience; and",
            "referee reports; and",
            "the personal statement.",
            "Those who have completed an undergraduate degree in Australia or New Zealand within the 18 months prior to the date of application; or",
            "Those who face significant humanitarian issues;",
            "3.The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4.Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students in the Master of Commerce (Accounting) will need to complete 16 subjects, comprising ten compulsory accounting subjects, one economics subject, one econometric subject and four electives.",
                "Progression from Year 1 to Year 2 of the Master of Commerce (Accounting) requires:",
                [
                    "An average of no less than 80% in all compulsory subjects in Year 1; and",
                    "An overall average grade of 75% or higher in year 1 subjects"
                ],
                "Students who discontinue from the Master of Commerce (Accounting) after Year 1 but have successfully completed the requirements of the Graduate Diploma in Commerce (Accounting) will be eligible to receive the Graduate Diploma in Commerce (Accounting) as an exit award.",
                "Progression from Year 2 of the Master of Commerce (Accounting) to the Doctor of Philosophy (Business and Economics) requires:",
                [
                    "An average of no less than 75% overall in all subjects taken in Years 1 and 2; and",
                    "an average of no less than 80% in all compulsory subjects in Years 1 and 2; and",
                    "an average of no less than 80% in ACCT90003 Accounting Research Report and ACCT90043 Advanced Accounting Research Report"
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Year One": {
            "overview": [],
            "Core Subjects": {
                "overview": [
                    "All students must take the following subjects:",
                    [
                        "ACCT90019",
                        "ACCT90020",
                        "ECON90062",
                        "ACCT90039",
                        "ACCT90011"
                    ],
                    "All students must takeone ofthe following subjects:",
                    [
                        "ECON90063",
                        "ECON90002",
                        "ECON90012"
                    ],
                    "All students must takeone ofthe following subjects:",
                    [
                        "ECOM90002",
                        "ECOM90013"
                    ]
                ]
            },
            "Elective subject": {
                "overview": [
                    "Students must completeoneelective that must be approved by the Program Director."
                ]
            }
        },
        "Year Two": {
            "overview": [],
            "Core Subjects": {
                "overview": [
                    "All students must complete the following subjects:",
                    [
                        "ACCT90003",
                        "ACCT90043",
                        "ACCT90044",
                        "ACCT90045"
                    ]
                ]
            },
            "Elective Subjects": {
                "overview": [
                    "Students must completefourelectives that must be approved by the Program Director."
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}