{
    "Course name": "Master of Construction Management",
    "Course code": "MC-CM",
    "Overview text": [
        "Construction Management is a discipline that incorporates any area of technical endeavour seeking to improve our ability to manage industrial structures, fabrication and procurement processes, and the output of buildings. In line with the mission of the Melbourne School of Design, graduate studies within Construction Management integrates the present requirements of professional training and education with the future needs of the industry, domestically as well as internationally. To this end, the Master of Construction Management at the University of Melbourne rests as much on practice as it does on theory: it is a professional degree for graduates who not only want to gain employment in the construction industry, but also want to contribute to tackling its social, technological, financial and environmental challenges.",
        "The Master of Construction Management provides students with the possibility to organise their studies and concentrate their curricula in three different areas of specialisation:",
        "These areas provide graduates with the foundation for a future career in construction or academia. They are also designed for those returning to study from the industry, who are interested in further developing their expertise by accessing knowledge frameworks not yet broadly available in practice. Each area has its own list of core and selective subjects.",
        "Depending on their specialisation, graduates are prepared to work with general construction companies, quantity surveying organisations, project management firms, trade specialists, specialised consultants, institutional bodies, government, and research institutions.",
        "Course duration may not be reduced as a result of receiving advanced standing. For further details contact the Faculty."
    ],
    "Overview table": {
        "Award title": "Master of Construction Management",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "061198J",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "300 credit points",
        "Duration": "36 months full-time or 72 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry applicants must have completed:",
            "an undergraduate degree in any area with a weighted average mark of at least H3 (65%), or equivalent; and",
            "a personal statement outlining relevant prior study and work experience, and motivation to undertake the course in a format as specified by the Selection Committee",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the personal statement",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note.",
            "Applicants with the following may be awarded up to 100 points of credit:",
            "an undergraduate degree in a cognate area with a weighted average mark of at least H3 (65%), or equivalent.",
            "Graduate Degree Packages for School Leavers",
            "The University of Melbourne offers Graduate Degree Packages to high achieving school leavers, allowing them to secure places (Commonwealth Supported Places for domestic students or International fee places) in the Master of Construction Management provided that they meet certain requirements.",
            "For a Commonwealth Supported Place or an International Fee Place, the applicant must:",
            "• complete an Australian Year 12 or the International Baccalaureate (IB) in 2018 or later either:— in Australia; or— outside Australia and be an Australian citizen;• achieve an ATAR (or notional ATAR) of at least 96.00;• apply for a University of Melbourne Graduate Degree Package for commencement in the year following completion of Year 12 or IB via VTAC;• enrol immediately or be granted deferral in the year following Year 12;• successfully complete a Bachelor of Design (majoring in Construction) at the University of Melbourne including all the specified prerequisite subjects;• achieve a minimum weighted average mark of H3 (65%) in their undergraduate degree; and• commence the Master of Construction Management within 18 months of completing the undergraduate degree.",
            "Applicants eligible for entry via a Graduate Degree Package will not be required to complete a personal statement as part of their application.",
            "Applicants should refer to the University handbook for the additional entry requirements for the Bachelor of Design.",
            "Additional notes:",
            "(a) The personal statement may include images and details of work undertaken, including the role performed by the applicant.",
            "Guaranteed Transfer into Commonwealth Supported Place",
            "Students with a fee place in this course who complete 100 points of the course with a weighted average mark of at least H2A (75%) and who are eligible for a Commonwealth Supported Place will be guaranteed a transfer to a Commonwealth Supported Place for the remainder of the course.",
            "For information about how to applyclick here."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne School of Design is the graduate school of the Faculty of Architecture, Building and Planning. It offers professional entry programs in Architecture, Construction Management, Landscape Architecture, Property and Urban Planning. It offers specialist development programs in Property Valuation, Planning and Design and in Urban Design.The Melbourne School of Design welcomes applications from students with disabilities. It is the University and Faculty (Architecture, Building and Planning) policy to take reasonable steps to make reasonable adjustments so as to enable students’ participation in degrees offered by the Melbourne School of Design (MSD).A candidate for degrees offered in the MSD must have abilities and skills which include the following: observation; communication; motor; conceptual, integrative, and quantitative; and behavioural and social. Adjustments can be provided to minimise the impact of a disability, however, particularly at Masters level, students need to be able to participate in programs in an independent manner and with regard to their safety and the safety of others.(i)Observation: Candidates must be able to read text, diagrams, maps, drawings and numerical data. Candidates should be able to observe details at a number of scales and to record useful observations of environmental contexts.(ii)Communication: Candidates should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. Candidates must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.(iii)Motor: Candidates should have sufficient motor function to elicit information from environmental contexts. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments. Candidates should have sufficient motor ability to prepare documentation of analytic texts, drawings and models of findings and for the preparation of proposals for environmental interventions via digital or other means. Candidates should have the ability to actively participate in appropriate site and/or design studio-based activities.(iv)Intellectual-Conceptual, Integrative and Quantitative Abilities: These abilities include measurement, calculation, reasoning, analysis, synthesis and, importantly, the ability to interpret results of such work. Problem resolution, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, given the disciplines pursued in the MSD, candidates should be able to comprehend three-dimensional relationships and to understand the spatial relationships in environmental structures of a wide range of scales – from smaller than the individual through individual buildings and urban spaces to large geographic areas. Further, graduate study entails learning to master one’s own abilities and skills and to deploy them strategically. This requires further developing skills in both reflective and reflexive thinking and being able to practice these skills.(v)Behavioural and Social Attributes: A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            ".",
            "Graduates of the Master of Construction Management will be accredited by:",
            "Australian Institute of Building (AIB)",
            "Australian Institute of Quantity Surveyors (AIQS)",
            "Royal Institution of Chartered Surveyors (RICS)",
            "Chartered Institute of Building (CIOB)",
            "In addition, the Master of Construction Management is endorsed by the Australian Institute of Project Management (AIPM)."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Construction Management provides 300 and 200 entry point programs.",
                "Completion of one specialisation is required.",
                "300 Point Entry",
                "All students must complete:",
                [
                    "100 points of Year 1 core subjects",
                    "125 points of core specialisation subjects",
                    "25 points of specialisation electives",
                    "50 points of multidisciplinary electives."
                ],
                "200 Point Entry",
                "All students must complete:",
                [
                    "125 points of core specialisation subjects",
                    "25 points of specialisation electives",
                    "50 points of multidisciplinary electives."
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "NOTE :",
        [
            "Completion of both ABPL90358 Research in Construction and ABPL90359 Research Practicum in Construction is necessary research preparation for doctoral stud",
            "From time to time, a selection of student work completed as part of this program will be reviewed by the relevant accreditation panel(s) as a requirement of the accreditation process."
        ],
        ""
    ]
}