{
    "Course name": "Master of Environmental Science",
    "Course code": "MC-ENVSC",
    "Overview text": [
        "The Master of Environmental Science gives student the opportunity to undertake intensive study in environmental science at a graduate level. It is designed for students with existing undergraduate studies in the life, chemical, physical, earth or environmental sciences to extend their environmental scientific knowledge, and to facilitate the development of professional scientific skills in environmental analysis and risk assessment.",
        "The program offers students the flexibility to develop their own interests by selection from a multi-disciplinary range of coursework subjects including: 1) core science discipline study, 2) policy, planning, ethical broadening studies and 3) professional skills that provide high-level training in the areas of communication, business and science application. Students integrate their knowledge and skills in an industry-based project or a research project for their capstone experience.",
        "",
        "Last updated: 2 February 2024"
    ],
    "Overview table": {
        "Award title": "Master of Environmental Science",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "092793M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in an appropriate scientific discipline, with a course weighted average mark of at least H3 (65%)",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note 1: Appropriate scientific disciplines are any Environmental Science, Environmental Engineering, Bioscience, Chemistry, Physics, Earth Science, Forestry or Ecosystem Science, Geography, Mathematics and Statistics and Agricultural Science.",
            "Note 2: Students who have completed an undergraduate degree in another science discipline may be considered for entry if they have completed at least 100 points of study up to second year level in the any combination of Environmental Science, Environmental Engineering, Bioscience, Chemistry, Physics, Earth Science, Forestry or Ecosystem Science, Geography, Mathematics and Statistics and Agricultural Science.",
            "Notes:",
            "Quotas may be applied to the degree as a whole, or to an individual stream, and preference may be given to applicants with evidence of appropriate preparation or potential to undertake research.",
            "Entry into a stream of the Master of Science is subject to the capacity of the department(s) or schools(s) offering the program stream to provide adequate supervision in a research project appropriate to the interests and preparation of the individual student and may be subject to the agreement of a member of academic staff to supervise the project module."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete a total of 200 credit points, comprised of:",
                [
                    "Core Subjects (62.5 credits points)",
                    "Environmental Science Discipline Subjects (87.5 to 112.5 points)",
                    "Broadening Environmental Studies Subjects (up to 25 points)",
                    "Professional Skills (between 25 and 37.5 points)"
                ],
                "Course structure notes:",
                [
                    "EVSC90017 Global Environmental Change and  EVSC90014 Environmental Risk Assessment must be taken in the   of enrolment.",
                    "firstyear",
                    "EVSC90019 Graduate Seminar: Environmental Science and Industry Project in EnvironmentalSci Pt1 & Pt2 will be taken in the of study. ",
                    " second year",
                    "Outstanding students may replace the Industry Project with EVSC90034 Environmental Sci. Research Project Pt 1 and EVSC90035 Environmental Sci. Research Project Pt 2 depending upon the availability of a suitable project and supervisor."
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects (62.5 points)": {
            "overview": [],
            "Year 1:(25 credit points)": {
                "overview": [
                    [
                        "EVSC90017",
                        "EVSC90014"
                    ]
                ]
            },
            "Year 2: (37.5 points)": {
                "overview": [
                    [
                        "EVSC90019"
                    ],
                    "AND",
                    [
                        "EVSC90034",
                        "EVSC90035"
                    ],
                    "OR",
                    [
                        "EVSC90036",
                        "EVSC90037"
                    ]
                ]
            }
        },
        "Environmental Science Discipline Subjects (between 87.5 to 112.5 credit points)": {
            "overview": [
                "Students will select between 87.5 and 112.5 points of elective subjects. Students may be eligible to take up to 25 points of undergraduate subjects to meet prerequisite requirements. These electives can be chosen from the following subjects:",
                [
                    "ABPL90086",
                    "ANSC90001",
                    "ATOC30003",
                    "ATOC30004",
                    "ATOC30008",
                    "ATOC90010",
                    "ATOC90011",
                    "ATOC90013",
                    "ATOC90016",
                    "ATOC90017",
                    "BCMB30002",
                    "BIOL90002",
                    "BOTA30004",
                    "BOTA90005",
                    "BTCH90009",
                    "CHEM30012",
                    "CHEM20011",
                    "CHEM90041",
                    "CHEM90043",
                    "CHEM90047",
                    "CHEM90048",
                    "CHEM90051",
                    "CHEM90052",
                    "CHEM90053",
                    "CHEM90064",
                    "CHEM90065",
                    "CHEN90011",
                    "ECOL30005",
                    "ENEN90006",
                    "ENEN90011",
                    "ENEN90027",
                    "ENEN90029",
                    "ENEN90031",
                    "ENEN90033",
                    "ENEN90038",
                    "ENGR90030",
                    "ENST30004",
                    "ENST90044",
                    "ENST90045",
                    "ERTH90026",
                    "ERTH90028",
                    "ERTH90029",
                    "ERTH90034",
                    "ERTH90062",
                    "EVSC30006",
                    "EVSC90015",
                    "EVSC90020",
                    "EVSC90025",
                    "EVSC90026",
                    "EVSC90033",
                    "FOOD90034",
                    "FRST90015",
                    "FRST90022",
                    "FRST90025",
                    "FRST90032",
                    "FRST90034",
                    "FRST90078",
                    "GEOG30001",
                    "GEOG30019",
                    "GEOG30021",
                    "GEOG90003",
                    "GEOG90026",
                    "GEOG90027",
                    "GEOG90052",
                    "GEOL30002",
                    "GEOL30003",
                    "GEOL30007",
                    "GEOL90005",
                    "GEOL90043",
                    "GEOL90046",
                    "GEOL90051",
                    "HORT90038",
                    "NRMT90002",
                    "NRMT90007",
                    "POPH90014",
                    "SCIE90014"
                ]
            ]
        },
        "Broadening Environmental Studies Subjects (up to 25 points)": {
            "overview": [
                "These electives can be chosen from the following subjects:",
                [
                    "ABPL90022",
                    "ABPL90064",
                    "ABPL90337",
                    "ATOC90002",
                    "ECON90016",
                    "ENEN90028",
                    "ENST90002",
                    "ENST90004",
                    "ENST90005",
                    "ENST90032",
                    "ENST90033",
                    "ENST90034",
                    "FRST90017",
                    "FRST90030",
                    "GEOG90007",
                    "GEOG90021",
                    "GEOG90025",
                    "HORT90004",
                    "HORT90033",
                    "HORT90039",
                    "HORT90046",
                    "MULT90004",
                    "ENST90043",
                    "MGMT90165",
                    "CHEN90041"
                ]
            ]
        },
        "Professional Skills (between 25 and 37.5 credit points)": {
            "overview": [
                "Students will select at least 25 points of the following professional skills elective subjects:",
                [
                    "ACTL90004",
                    "BUSA90403",
                    "COMP90038",
                    "COMP90059",
                    "COMP90072",
                    "EDUC90839",
                    "ENEN90032",
                    "ENGR90029",
                    "GEOM30009",
                    "GEOM90005",
                    "GEOM90006",
                    "LING90002",
                    "MAST30025",
                    "MAST90007",
                    "MAST90044",
                    "MAST90045",
                    "PHYC30021",
                    "SCIE90005",
                    "SCIE90012",
                    "SCIE90017",
                    "CHEN90031",
                    "CHEN30001",
                    "CHEN90007",
                    "ENGR30002",
                    "SCIE90034",
                    "AGRI90075",
                    "CHEN90010",
                    "CHEN90040",
                    "SKILS90004"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Upon successful completion of the Research Project, students may be eligible to apply to study for a PhD at the University of Melbourne."
    ]
}