{
    "Course name": "Master of Education in Evidence-Based Teaching",
    "Course code": "MC-EDEBT",
    "Overview text": [
        "The aim of the course is to build the knowledge and skills of educational practitioners so that they can develop, critique and utilise a range of data and draw on the latest educational research to devise interventions that improve student outcomes at the individual, group, team and school levels. The course will explore the nature of evidence and clinical teaching and the development and use of data, supporting candidates to acquire the skills to generate, interpret and evaluate various forms of student data. It will introduce candidates to key theories around how students learn and recent research on how to identify accurately student learning needs and provide instruction that is targeted to those needs. Course candidates will engage in a range of activities designed to draw upon and enable them to understand more fully their own particular experiences and roles in school and preschool education.",
        "Last updated: 1 August 2024"
    ],
    "Overview table": {
        "Award title": "Master of Education in Evidence-Based Teaching",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree and a fourth-year level education qualification, or equivalent; or",
            "a four-year education degree",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required.",
            "Note: Previous graduates of the Melbourne Graduate School of Education’s Master of Teaching will not be eligible for entry to this course."
        ],
        "Inherent requirements (core participation requirements)": [
            "The core participation requirements for study in the Faculty of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching.2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning.",
            "They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "In courses requiring students to undertake practicum placements",
            "4. The ability to undertake professional practice placements independently, including:a. the ability based on personal maturity to establish a professional relationship with students and interact with them appropriately;b. the ability to communicate to students the subject matter being taught with clarity and in a way that is age-sensitive;c. the ability to model literacy and numeracy skills independently for students and in all their interactions meet community expectations of the literacy and numeracy skills teachers should have;d. the ability to demonstrate skilfully and safely activities required in particular discipline areas being taught (e.g. physical education activities, science laboratory techniques);e. the ability to create, monitor and maintain a safe physical environment, a stable and supportive psychological environment, and a productive learning environment in their classroom;f. the ability to establish effective relationships with all members of the school community, including colleagues, students, and caregivers;g. the ability based on mental and physical health to exercise sound judgment and respond promptly to the demands of classroom situations, and the personal resilience to cope and maintain their wellbeing under stress.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact Disability Liaisonhttp://services.unimelb.edu.au/disability."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "In order to be eligible to take the Research Pathway option, students must attain an average of H2A or above (i.e. 75% or above) in the first four compulsory subjects.",
                "Full-time students complete four compulsory 12.5 point subjects in the first two terms, part-time students complete four compulsory subjects in the first four terms. These four subjects comprise the first 50 points of the course.",
                "The final 50 points of the course can be completed as either the Coursework or the Research Pathway option.",
                "In order to be eligible to take the Research Pathway option, students must attain an average of H2A or above (i.e. 75% or above) in the first four compulsory subjects."
            ]
        },
        "Subject options": {
            "overview": [
                "First 50 points:",
                [
                    "EDUC90828",
                    "EDUC90862",
                    "EDUC90830",
                    "EDUC90832"
                ]
            ],
            "Second 50 points Coursework Option:": {
                "overview": [
                    "Two electives, and EDUC90926 followed by EDUC90978. Part-time students must take the electives before EDUC90926.",
                    [
                        "EDUC90926",
                        "EDUC90978"
                    ]
                ]
            },
            "Second 50 points Research Option:": {
                "overview": [
                    "One elective, and EDUC90848 and then EDUC90945. Full time students may take EDUC90848 and EDUC90945 together.",
                    [
                        "EDUC90848",
                        "EDUC90945"
                    ]
                ]
            },
            "Electives:": {
                "overview": [
                    [
                        "EDUC90859",
                        "EDUC90900",
                        "EDUC90831",
                        "EDUC90975"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates from this program are eligible to apply for entry to a Doctor of Education program provided they meet other entry requirements and subject to achievement of an H2A grade average. To be eligible to apply for a PhD following achievement of an H2A grade average, a further 50-point Postgraduate Certificate in Educational Research or equivalent will be necessary. Please note also that graduates of an undergraduate Honours degree may already be eligible for doctoral studies, subject to the same entry and achievement requirements."
    ]
}