{
    "Course name": "Master of Theatre (Writing)",
    "Course code": "MC-THTRWRI",
    "Overview text": [
        "This one-year Master of Theatre (Writing) focuses on developing the skills and emerging aesthetic of the individual and collaborative writer for diverse forms of contemporary live performance. Practice in both solo and collaborative writing are supported by an analysis of, and practice in, both traditional dramaturgical principles and play structures based in character, dramatic action, conflict, dialogue, action and causal logic, as well as more experimental, non-linear writing based on principles of montage, association and intuition, and postdramatic writing in which conventions of dramatic writing are evoked only to be discarded.",
        "Through a combination of writing workshops, critical seminars, collaborative group dramaturgy, performance making and discussions students will develop skills in writing for the diverse contexts in which live performance can be made, alongside a deeper understanding of the relationship between between playwrights and the cultural contexts in which they write.",
        "The course focuses on contemporary writing in both Australia and overseas, but with particular attention to a new diversity of voices and cultures in Australian writing. The student is also equipped with research skills for developing and reflecting on their own work as well as that of others, and the academic writing skills to articulate their own practice in the context of contemporary cultural and performance theory.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Master of Theatre (Writing)",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "075502B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• either– a bachelor honours degree or equivalent in a cognate area;– a three-year undergraduate qualification and at least 50 credit points, or equivalent, of graduate study in a cognate area;– a three-year undergraduate qualification in a cognate area and at least two years of documented, relevant work experience;or– a minimum of eight years of documented relevant professional experience, with evidence of artistic ability and achievement or practice comparable to that expected of honours degree holders in relevant disciplines;and• a curriculum vitae; and• a portfolio of relevant work; and• an interview.Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:• prior academic performance; and• the curriculum vitae; and• the portfolio of relevant work; and• the interview.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "100-point program of compulsory subjects",
                [
                    "THTR90018",
                    "THTR90019",
                    "THTR90020",
                    "DRAM90019",
                    "DRAM90012",
                    "THTR90021"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}