{
    "Course name": "Master of Contemporary Chinese Studies",
    "Course code": "MC-CONTCS",
    "Overview text": [
        "The Master of Contemporary Chinese Studies at the University of Melbourne is a vibrant interdisciplinary program designed to accommodate a wide range of interests and to provide a broad understanding of the people, environment, cultures, society, politics, and economy of contemporary China. A flexible and varied course of instruction affords students interested in a professional career of engagement with China an opportunity to pursue their passions in business, media, government service, or non-governmental organisations (NGO). With expert tuition from China specialists, it also serves as an academic bridge for students who wish to enter a PhD program but require further background training or have yet to choose a discipline for doctoral studies.",
        "In this program you may put your China knowledge into practice through optional internships in international organisations, government, business, media and NGOs, or pursue a research thesis option to better prepare you for doctoral studies. Regardless of how you structure your Master’s journey, you’ll graduate able to make sense of contemporary China on its own terms and to understand better its changing role in the region and the world. Offering a world-class education, we expect our graduates will enjoy distinguished careers in public service, the private sector, academia, and other fields of meaningful endeavour."
    ],
    "Overview table": {
        "Award title": "Master of Contemporary Chinese Studies",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "114286M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline with a weighted average mark of at least H2B (70%), or equivalent WAM.",
            "Meeting this requirement does not guarantee selection.",
            "1. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "relevance of previous studies.",
            "1. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "2. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Applicants with the following may be awarded up to 50 points of credit:",
            "a bachelor degree in a cognate discipline with a weighted average mark of at least H2B (70%), or equivalent WAM.",
            "Applicants with the following may be awarded up to 100 points of credit:",
            "an honours degree in a cognate discipline, with a weighted average mark of at least H2B (70%), or equivalent WAM."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students are required to complete the program requirements/structure from the year that they commenced their program. All compulsory and capstone subjects must be completed to be eligible to graduate from the program.",
                "200 Point Program",
                [
                    "Foundational Subjects (50 points)  Must be completed in the first 100 points of the program",
                    "Compulsory subjects (25 points)",
                    "Capstone Subjects (minimum 25 points up to a maximum of 50 points) Must be taken in the final 100 points of the program",
                    "Elective Subjects (minimum 75 points up to a maximum of 100 points)  "
                ],
                "150 Point Program",
                [
                    "Compulsory subjects (25 points)",
                    "Capstone Subjects (minimum 25 points up to a maximum of 50 points) Must be taken in the final 100 points of the program",
                    "Elective Subjects (minimum 75 points up to a maximum of 100 points)"
                ],
                "100 Point Program",
                [
                    "Compulsory subjects (25 points)",
                    "Capstone Subjects (minimum 25 points up to a maximum of 50 points) ",
                    "Elective Subjects (minimum 25 points up to a maximum of 50 points) "
                ],
                "Students may enrol in up to 25 points of Chinese language study as electives at a suitable proficiency level determined by alanguage placement test. This will count towards the elective subject requirement. Students undertaking Chinese language subjects must be enrolled in either CHIN90005 Graduate Chinese A and/or CHIN90006 Graduate Chinese B and will be placed in the appropriate classes according to their placement test results.",
                "Capstone Requirement",
                "Students must complete one of the three available Capstone streams for this degree.",
                "Capstone Stream 1: Contemporary Chinese Studies Project (25 points)",
                "CHIN90011 Research Design and Methods (12.5 points)CHIN90008 Contemporary Chinese Studies Project (12.5 points)",
                "Purpose: To enhance career-readiness and employability by equipping students with the ability to conduct evidence-based research and apply specialist knowledge through practical experience.",
                "Whereas Methods in Contemporary Chinese Studies addresses integrated skills in conducting evidence-based research, Contemporary Chinese Studies Project aims at applying acquired knowledge in real-world situations through working on individual or team-based projects.",
                "Capstone Stream 2: Contemporary Chinese Studies Minor Thesis (total 50 points)",
                "CHIN90011 Research Design and Methods (12.5 points)CHIN90009 Contemporary Chinese Studies Thesis 1 (18.75 points)CHIN90010 Contemporary Chinese Studies Thesis 2 (18.75 points)",
                "Purpose:To advance students' critical and analytical skills for career development in academia.",
                "Students should contact their thesis subject coordinator or the course convenor prior to the commencement of the semester to apply for the minor thesis pathway. Students will be matched with a supervisor appropriate to their needs and research interests. Under the guidance of this supervisor, students will produce a text of 12,000 words comprising an independent, original research project in a specialised area of Contemporary Chinese Studies. The specific focus of the research project will be initiated by the student arising from their keen interests and consultations with other networks and academic staff with relevant expertise.",
                "Capstone Stream 3: Contemporary Chinese Studies Internship (25 points)",
                "CHIN90007 Contemporary Chinese Studies Internship (25 points)",
                "Purpose:An experiential learning opportunity for students to gain exposure to professional environments and to put the theory, knowledge and skills developed through their degree into practice in a workplace setting.",
                "External Subject Rule",
                "Student may undertake an external subject (not listed within the program structure) with the permission of the program and subject coordinator. All external subject requests must be for the elective subject requirement, not as a compulsory, core or capstone subject. The maximum external subjects allowed are as follows:",
                [
                    " 200 point program undertaken at University of Melbourne (2 years): maximum 25 points",
                    " 150 point program undertaken at University of Melbourne (1.5 years): maximum 12.5 points",
                    " 100* point program undertaken at University of Melbourne (1 year): 12.5 points",
                    " 50*^ point program undertaken at University of Melbourne (0.5 years): 0 points"
                ],
                "* GC-ARTS, GD-ARTS, GCA-ARTS and GDA-ARTS students are not normally granted permission to undertake external subjects towards their degree.",
                "^ Exception: Students admitted to 50 point programs may apply to take LING90002, Presenting Academic Discourse, as an external subject.",
                "Please note that advanced standing contributes to a student’s remaining points undertaken at University of Melbourne, and may affect how many points the student can undertake outside the enrolled program.",
                "For policies that govern this degree, see the Courses, Subjects, Awards and Programs Policy [https://policy.unimelb.edu.au/MPF1327#section-4.15] in the University Melbourne Policy Library [https://policy.unimelb.edu.au/]. Students also should also refer to information in the Enrolment and Timetabling Policy. [https://policy.unimelb.edu.au/MPF1294#section-4.1]"
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Completion of the Master of Contemporary Chinese Studies prepares graduates to pursue further study at the doctoral level in a variety of social science and humanities discipline."
    ]
}