{
    "Course name": "Master of Education",
    "Course code": "MC-ED",
    "Overview text": [
        "The Master of Education is directed at individuals wanting to develop specialised knowledge and skills in educational theories, policies and approaches at the graduate level. The course has been designed to meet the needs of a wide variety of individuals who are wanting to develop and/or extend their expertise in pedagogy and assessment, arts and/or STEM education, international policies and comparative education, literacy education, student wellbeing, and/or leadership and management. The degree will meet the needs of practising teachers as well as those who are interested and/or involved in youth work, policy making, health education, and/or educational administration within the wider educational community, including government and non-government organisations (NGOs), as well as private providers.",
        "Please note that this course will not provide you with registration to teach in Australia."
    ],
    "Overview table": {
        "Award title": "Master of Education",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "095802B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "A three-year undergraduate degree or equivalent in any discipline area.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university'sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7is required.",
            "Note:",
            "a) Successful applicants with the following may be granted up to 100 credit points of advanced standing:",
            "a four-year education degree, or equivalent; or",
            "an undergraduate degree in any discipline and at least 100 credit points, or equivalent, of graduate study in education.",
            "b) Credit is not normally granted for studies completed more than ten years prior to the course commencement. You may be eligible for advanced standing if your previous studies are more than ten years prior to the course commencement on the basis of substantial, relevant and documented professional work experience where recent prior learning can be demonstrated. Further information is contained in the University of MelbourneCredit, Advanced Standing and Accelerated Entry Policy."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student's participation in the Faculty's programs.The core participation requirements for study in the Faculty of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching;2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines;3. Behavioural and social attributes that enable a student to participate in a complex learning environment.",
            "Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "In courses requiring students to undertake practicum placements",
            "4. The ability to undertake professional practice placements independently, including:a. the ability based on personal maturity to establish a professional relationship with students and interact with them appropriately;b. the ability to communicate to students the subject matter being taught with clarity and in a way that is age-sensitive;c. the ability to model literacy and numeracy skills independently for students and in all their interactions meet community expectations of the literacy and numeracy skills teachers should have;d. the ability to demonstrate skilfully and safely activities required in particular discipline areas being taught (e.g. physical education activities, science laboratory techniques);e. the ability to create, monitor and maintain a safe physical environment, a stable and supportive psychological environment, and a productive learning environment in their classroom;f. the ability to establish effective relationships with all members of the school community, including colleagues, students, and caregivers;g. the ability based on mental and physical health to exercise sound judgment and respond promptly to the demands of classroom situations, and the personal resilience to cope and maintain their wellbeing under stress.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact Student Equity and Disability Supporthttp://services.unimelb.edu.au/student-equity"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [],
            "2 Year Program (200 credit points)": {
                "overview": [
                    "The course requires the completion of 200 credit points of study over two years full time (or part time equivalent). The compulsory subjects completed in the first semester of the course provide a foundation in education studies. Students can choose to complete up to two specialisations in an area(s) of interest, or tailor the course from a wide selection of subjects.",
                    "In the final semester of the course, students undertake a capstone professional project; or may choose to complete a research option (conditional upon meeting the eligibility criteria).",
                    "In Year 1, Semester 1 (or the first 50 points of study), students must complete:",
                    [
                        "4 x compulsory subjects (50 points)."
                    ],
                    "In Year 1, Semester 2 (or the second 50 points of study), students must complete:",
                    [
                        "4 x electives/specialisation subjects (50 points)"
                    ],
                    "In Year 2 (or the final 100 points), students must complete:",
                    [
                        "6 x electives/specialisation subjects (75 points); and",
                        "1 x capstone professional project subject, in the final semester of the course (25 points)"
                    ],
                    "Alternatively, students who meet the eligibility criteria may enrol into the Research* option. For those students, the Year 2 structure comprises:",
                    [
                        "4 x electives/specialisation subjects (50 points); and",
                        "2 x research subjects, taken in the final 50 points of study (50 points)"
                    ]
                ]
            },
            "1 Year Program (100 credit points)": {
                "overview": [
                    "Students with 100 points of advanced standing complete 100 points of study over one year full time (or part-time equivalent).",
                    "Students must follow the 'Year 2' course structure, taking either the Capstone Professional Project option or the Research option."
                ]
            },
            "Specialisations": {
                "overview": [
                    "Students can obtain a specialisation by satisfactorily completing Specialisation subjects in that area (totalling 50 points). Up to two specialisations can be obtained in the 200-point program.",
                    [
                        "Arts Education",
                        "Assessment and Pedagogy",
                        "Equity, Diversity and Social Change",
                        "Leadership and Management",
                        "Literacy Education",
                        "Mathematics and Science Education",
                        "Policy in a Global Context",
                        "Student Wellbeing"
                    ]
                ]
            },
            "Electives": {
                "overview": [
                    "Electives may be chosen from:",
                    [
                        "Education Level 3 Electives (up to 25 points, and taken in Year 1 of the 200-point program only);",
                        "General Electives;",
                        "Specialisation subjects (subjects listed within a specialisation may be taken as a single elective subject)."
                    ],
                    "Students may also complete up to 25 points of the following types of subjects as part of their elective study component, with the permission of the Master of Education course coordinator:",
                    [
                        "Relevant postgraduate subjects from one of the Faculty of Education specialist master degrees for which the student meets the requisites (with permission of the relevant subject coordinator, and the Master of Education course coordinator);",
                        "Relevant postgraduate subjects from another Faculty/Graduate School for which the student meets the requisites (with permission of the relevant subject coordinator, and the Master of Education course coordinator)."
                    ]
                ]
            },
            "Capstone Professional Project": {
                "overview": [
                    "Students complete an independent investigation of a topic that they regard as directly related to their own professional practice and/or within their area of specialisation in the 25-point Capstone Professional Project subject. The subject must be taken in the final semester of the course."
                ]
            },
            "*Research Subjects": {
                "overview": [
                    "The research subjects are designed for students intending to later pursue a graduate research degree, such as a PhD. They provide a grounding in educational research methodology and include the design and completion of a research project in education.",
                    "The two research subjects must be undertaken in the final 50 points of study, and the following eligibility criteria must be met to enrol in the subjects:",
                    [
                        "Students in the 200-point program must achieve an average of at least H2A (75%) in the first 125 points of the course;",
                        "Students in the 100-point program must achieve an average of at least H2A (75%) in their first 50 points of their course."
                    ]
                ]
            },
            "Alternative Exit Point": {
                "overview": [
                    "An early exit point is available for students who commence the Masters, but later decide to not complete the whole course. These students may exit the Master of Education^, and apply to graduate with one of the following awards:",
                    [
                        "A Graduate Diploma in Educational Studies (GD-EDST), if they have satisfied the requirements for that award during their enrolment in this master's course (i.e., successfully completed the prescribed first 100 credit points of study of the 200-credit point master degree); or",
                        "A Graduate Certificate in Education (GC-EDGEN), if they have satisfied the requirements for that award during their enrolment in this master degree course (i.e. successfully completed 50 credit points of study)."
                    ],
                    "^Students must discontinue their enrolment in the MC-ED without completing the award, to be conferred the exit award."
                ]
            }
        },
        "Subject options": {
            "overview": []
        },
        "2 Year Program (200 credit points)": {
            "overview": [],
            "YEAR 1 / FIRST 50 POINTS": {
                "overview": []
            },
            "Compulsory subjects": {
                "overview": [
                    "4 x compulsory subjects",
                    [
                        "EDUC90930",
                        "EDUC90929",
                        "EDUC91029",
                        "EDUC91030"
                    ]
                ]
            },
            "YEAR 1 / SECOND 50 POINTS": {
                "overview": []
            },
            "Electives/Specialisation subjects": {
                "overview": [
                    "4 x subjects chosen from:",
                    [
                        "Specialisation subjects (Students who wish to obtain a specialisation must complete 4 Specialisation subjects as prescribed in that area, totalling 50 points); and/or",
                        "Education Level 3 Electives (up to 25 points); and/or",
                        "General Electives."
                    ]
                ]
            },
            "Specialisation subjects": {
                "overview": [
                    "Refer toMajors, minors & specialisations."
                ]
            },
            "Education Level 3 Electives": {
                "overview": [
                    [
                        "EDUC30065",
                        "EDUC30071",
                        "EDUC30073",
                        "EDUC30076",
                        "EDUC30067"
                    ]
                ]
            },
            "General electives": {
                "overview": [
                    [
                        "EDUC90873",
                        "EDUC90642",
                        "EDUC91017",
                        "EDUC90006",
                        "EDUC90933",
                        "EDUC90850",
                        "EDUC90872",
                        "EDUC90937",
                        "EDUC90686",
                        "EDUC90685",
                        "EDUC90946",
                        "EDUC90290"
                    ]
                ]
            },
            "YEAR 2 / SECOND 100 POINTS": {
                "overview": [
                    "Students can undertake either of the following two options:"
                ]
            },
            "Capstone Professional Project Option": {
                "overview": [
                    "6 x subjects chosen from:",
                    [
                        "General Electives; and/or",
                        "\n (Students who wish to obtain a specialisation must complete 4 Specialisation subjects as prescribed in that area, totalling 50 points);"
                    ],
                    "and",
                    [
                        "EDUC90989, which must be taken in the final semester of the course."
                    ],
                    [
                        "EDUC90989"
                    ]
                ]
            },
            "Research Option": {
                "overview": [
                    "The eligibility requirement must be met to enrol in the research subjects (refer to Course Structure), and they must be taken in the final 50 points of study.",
                    "4 x subjects chosen from:",
                    [
                        "General Electives; and/or",
                        "Specialisation subjects (Students who wish to obtain a specialisation must complete 4 Specialisation subjects as prescribed in that area, totalling 50 points);"
                    ],
                    "And the 2 x research subjects:",
                    [
                        "The research methodology (EDUC90419) and research project in education (either EDUC91197, or EDUC91198 & EDUC91199) subjects, which can be taken in sequence, or together."
                    ],
                    [
                        "EDUC90419",
                        "EDUC91197",
                        "EDUC91198",
                        "EDUC91199"
                    ],
                    "1 Year Program (100 credit points)Students in the 1 Year Program (100 credit points) follow the 'Year 2' course structure above, taking either the Capstone Professional Project option or the Research option. Students who wish to undertake the Research option must have at least an H2A average (or equivalent) in the first 50 points of the course.Electives may be chosen from Specialisation subjects or General Electives. Students who wish to obtain a specialisation must complete Specialisation subjects as prescribed in that area (totalling 50 points)."
                ]
            }
        }
    },
    "Majors, minors and specialisations": {
        "Master of Education Specialisations": [
            "Students who wish to obtain a specialisation must complete 4 Specialisation subjects as prescribed in that area, totalling 50 points.",
            "Subjects listed under specialisations may also be taken as single elective subjects.",
            {
                "Arts Education": "50 Credits",
                "Assessment and Pedagogy": "50 Credits",
                "Equity, Diversity and Social Change": "50 Credits",
                "Policy in a Global Context": "50 Credits",
                "Leadership and Management": "50 Credits",
                "Literacy Education": "50 Credits",
                "Mathematics and Science Education": "50 Credits",
                "Student Wellbeing": "50 Credits"
            }
        ]
    },
    "Further Study": [
        "Graduate Research DegreesThe Faculty of Education is widely recognised as a leader in Australian and international education research.",
        "Graduates interested in graduate research with the Faculty of Education may have several options, depending on their prior qualifications, academic achievement, research experience and professional experience.",
        "Graduates who have completed the Capstone option in this course (MC-ED) may be eligible to apply to:",
        [
            "The , or  ",
            "the , or",
            "the \n"
        ],
        "Graduates who have completed:",
        [
            "the 50 credit-point Research option in this course (MC-ED), or  ",
            "the , or ",
            "the , or ",
            "an undergraduate Honours degree,"
        ],
        "may be eligible to apply to one of the following research degrees:",
        [
            "\n ",
            "\n "
        ],
        "Entry to these courses is a competitive process and each course has additional entry requirements such as minimum academic entry scores which must be met. Please check the Handbook course entry for details of entry requirements.",
        "For more information about graduate research study in Education see theResearch Degreespage."
    ]
}