{
    "Course name": "Master of Fine Arts",
    "Course code": "MR-FA",
    "Overview text": [
        "The Master of Fine Arts aims to provide opportunities for suitably qualified candidates to develop their potential for research, develop mastery in their field of practice and contribute to understandings of contemporary artistic practice and theories of arts and culture. High quality research subjects and independent supervision ensure artistic and intellectual excellence and leadership potential, and learning and training takes place in an international context.",
        "Completion of the Master of Fine Arts signifies that the holder has undertaken a substantial piece of original research, which has been conducted and reported by the holder under proper academic supervision and in a research environment for a prescribed period.",
        "The duration of Master of Fine Arts candidature is two years for full-time candidates, with no extension allowed.",
        "Candidates submit a written thesis of approximately 30,000 to 40,000 words or a thesis comprising a combination of creative work and written component to the equivalent of 40,000 words. The written component must be of at least 25% (10,000 words) of the final submission.",
        "The creative work may take the form of performance, exhibition, writing (poetry, fiction, script or other written literary forms), design, film, video, multimedia, CD, DVD or other new media technologies and modes of presentation, subject to the capacity of the faculty to resource the proposed creative work. The creative work must be comprehensively documented and either the documentation or the creative work itself submitted with the written component.",
        "The thesis will be assessed at the end of the candidature.",
        "The Master of Fine Arts is offered in the following discipline areas:"
    ],
    "Overview table": {
        "Award title": "Master of Fine Arts",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "099324F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "9",
        "Duration": "2 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "The Selection Committee will evaluate the applicant's ability to pursue the course successfully using the following criteria.",
            "1. In order to be considered for entry, applicants must have completed:",
            "an honours degree with at least an H2A (75%) weighted average, including a major relevant to the discipline to which entry is sought, or equivalent; or",
            "a relevant undergraduate degree with at least an H2A (75%) weighted average and two years of documented work experience relevant to the discipline to which entry is sought; or",
            "an undergraduate degree in any discipline and five years of documented work experience relevant to the discipline to which entry is sought; or",
            "five years of documented relevant work experience related to the discipline to which entry is sought and demonstrating outstanding artistic ability, together with evidence of ability in academic writing and research or scholarship appropriate for postgraduate study;",
            "Research Proposal, Scholarly Writing and Folio requirement",
            "applicants must provide a research proposal of approximately 1,000 words;",
            "applicants must provide a recent example of scholarly writing of 2,000 to 3,000 words; and",
            "applicants will also be assessed on performance in one or more of an audition, test, interview, workshop, portfolio or folio presentation, as prescribed by the Academic Board for the discipline to which entry is sought.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the selection committee will consider:",
            "prior academic performance and/or the professional experience;",
            "the research proposal and recent example of scholarly writing; and",
            "presentation in one or more formats including audition, test, interview, workshop, portfolio or folio presentation.",
            "3. The selection committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceBand 6.5.is required.",
            "For more information on the application process and details of folio, audition, and research proposal requirements visit theStudy Hub."
        ],
        "Inherent requirements (core participation requirements)": [
            "Creative, Intellectual and Organisational Abilities:Students are expected to have the ability to develop problem-solving skills and to comprehend disciplinary and crossdisciplinary information. Students must have the ability to establish study plans and prioritise objectives and outcomes.",
            "Behavioural and Social Attributes:Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. They must take full responsibility for their own participation and learning. Students also contribute to the learning of other students in collaborative environments and must therefore demonstrate a wide range of interpersonal skills which consider the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Disability:For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/",
            "Seminars:Students are required to participate in seminars where relevant over the period of their candidature."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "A candidate will have appropriately experienced supervisors and an Advisory Committee who, in consultation with the candidate, arranges a course of supervised research designed to suit the individual requirements and interests of the candidacy."
            ],
            "Coursework Component": {
                "overview": [
                    "Candidates are required to complete CREA90001 Research Methods 1 normally in the first semester of their enrolment.",
                    "Candidates participate in regular seminars.",
                    [
                        "CREA90001"
                    ]
                ]
            },
            "Thesis Submission": {
                "overview": [
                    "Candidates submit a written thesis of approximately 30,000 to 40,000 words or a thesis comprising a combination of creative work and written component to the equivalent of 40,000 words. The written component must be of at least 25% (10,000 words) of the final submission.",
                    "Candidates who have submitted a thesis consisting of creative work, where the creative work is not bound together with the written component (eg exhibition, performance, poetry, screenplay, novel), shall state: \"Submitted in partial fulfilment of the requirements of the degree of Master of Fine Arts (by creative work and written component)\".",
                    "Candidates who have submitted a thesis consisting of creative work, where the creative work is bound together with the written component (eg poetry, screenplay, novel), shall state: \"Submitted in total fulfilment of the requirements of the degree of Master of Fine Arts (by creative work and written component)\".",
                    "For a fully written thesis, the statement must read, “Submitted in total fulfilment of the requirements of the degree of Master of Fine Arts (Written Thesis)”.",
                    [
                        "CREA70001"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "At the successful completion of this degree students will be eligible to apply for PhD studies."
    ]
}