{
    "Course name": "Master of Theatre (Dramaturgy)",
    "Course code": "MC-THTRDRA",
    "Overview text": [
        "This is the first and only course leading to a qualification in dramaturgy in Australia and Asia, and offers a unique curriculum emerging from its positioning within the Victorian College of the Arts (VCA) and the artistic and cultural life of Melbourne. It is an 18-month, 150-point, Masters course that is closely interwoven with the Master of Theatre (Writing), and the Master of Theatre (Directing).",
        "During the program you will encounter and explore dramaturgy beyond work with written texts and literary play scripts to encompass the contexts of dance, hybrid works, installation, community-based and performance art work. The program provides opportunities for you to develop your potential for artistic leadership and attain in-depth knowledge of dramaturgical thinking and practices.",
        "The course is underpinned by a commitment to the pursuit of artistic excellence, collaboration and interdisciplinarity within established and emerging local, national and international dramaturgical practices.",
        "Students collaborate with other VCA graduate disciplines and engage with writers, directors, designers, choreographers, performance-makers and actors on a range of projects in an intensive training environment.",
        "The course provides a balance of theory and practice across three semesters through laboratory-based workshops, seminars, lectures, self-directed exercises, tutorials, practical master classes, practical work on performance projects and an independent project.",
        "The teaching-intense first semester focuses on building and refining practical skills and research training, including a discrete subject that engages closely with the dramaturgical expertise of Melbourne’s diverse theatre industry. The teaching methodology is underpinned by the principle of bringing industry professionals onto the campus to interface with the students. The second semester allows for more hands-on practical experience though: a collaborative devising subject with directors, actors and designers; by working on new writing with the writing students; and by working as dramaturgs in internal/VCA projects directed by guests, staff or the second-year directors. Training is enhanced by a subject on Performance and Community Engagement.",
        "The third semester allows more independent practice and research, building reflective performance practitioners with a high level of research and practice skills commensurate with a Masters degree. It also focuses on preparation for industry alongside the second-year directors, developing students’ industry practice and know-how in the context of the contemporary Australian and international performance environment. The course aim is that graduates will not just fit into an existing system but can be change-makers and leaders in this ecology.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Master of Theatre (Dramaturgy)",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "085431G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1) In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree or equivalent in the arts (across art forms such as the performing arts, music, visual arts, film, dance & digital arts); or ",
            "an undergraduate degree or equivalent in associated areas such as cultural studies or areas within the design industry sector; or",
            "equivalent of 6 years professional practice in the creative arts industry.",
            "Meeting these requirements does not guarantee selection.",
            "2) In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; or",
            "Creative arts industry professional practice.",
            "3) The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4) Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band is 6.5 required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Participants should possess and/or display potential to develop:",
            "Skills in the creative arts: performing arts, circus, graphic design, digital media arts, music, painting, sculpture, etc.",
            "Competencies in applying tools & techniques in imaginative play, lateral thinking, interpersonal & intrapersonal skills, social creativity, emotional & multiple intelligence methods",
            "Commitment to an intense praxis study model that encompasses research and practice",
            "Behavioural and Social Attributes:",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment.",
            "Students must take full responsibility for their own participation and learning.",
            "Students also contribute to the learning of other students in collaborative environments and must therefore demonstrate a wide range of interpersonal skills, which consider the needs of other students. Assessment will include the outcomes of tasks completed in collaboration with other students.",
            "Disability:",
            "Students who have a disability which may prevent them from participating in tasks involving these inherent academic requirements are encouraged to contact the Disability Liaison Unit: http://www.services.unimelb.edu.au/disability/ Adjustments can be provided to minimise the impact of a disability; however, students will need to participate in the course in an independent manner."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "150-point program of compulsory subjects"
            ],
            "Year 1": {
                "overview": [
                    [
                        "DRAM90010",
                        "DRAM90011",
                        "DRAM90019",
                        "DRAM90022",
                        "DRAM90012",
                        "THTR90009",
                        "DRAM90023",
                        "DRAM90024"
                    ]
                ]
            },
            "Year 2": {
                "overview": [
                    [
                        "DRAM90013",
                        "DRAM90018"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The Master of Theatre (Dramaturgy) offers a pathway into VCA research higher degrees or other research higher degrees, and the PhD."
    ]
}