{
    "Course name": "Master of Tertiary Education (Management)",
    "Course code": "MC-TEDMGT",
    "Overview text": [
        "THIS COURSE IS NOT TAKING APPLICATIONS FOR 2023.",
        "The Master of Tertiary Education (Management) is a two-year, part-time, fully online program designed for middle to senior level educators, administrators and scholars seeking to extend their knowledge and skills in tertiary sector leadership and management.",
        "It offers expert perspectives on Higher Education and Vocational Education and Training systems, policy settings, institutional strategies and tertiary sector work cultures in a national and international context, drawn from the best and latest research and resources for tertiary sector leadership. It aims to provide concepts, insights and practical skills for leading and managing successfully in tertiary sector institutions; exposure to high profile tertiary sector leaders and expert scholars, nationally and internationally, and access to a network of tertiary sector peers facing similar management challenges."
    ],
    "Overview table": {
        "Award title": "Master of Tertiary Education (Management)",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed either:",
            "a four year undergraduate degree in a cognate area, or equivalent; or",
            "a three year undergraduate degree and at least 50 credit points, or equivalent, of graduate study in a cognate area; or",
            "a three year undergraduate degree in a cognate area and at least two years of documented, relevant professional experience in tertiary education management, or equivalent;",
            "AND",
            "have current employment in the tertiary education sector; and",
            "employer support to participate.",
            "Meeting these entry requirements does not guarantee selection.",
            "1. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Professional experience. ",
            "3.The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne Graduate School of Education welcomes applications from students with disabilities. It is University and Graduate School policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Graduate School’s programs.The core participation requirements for study in the Melbourne Graduate School of Education are:In all courses",
            "The ability to comprehend complex information related to education and the disciplines in which the student is teaching.",
            "The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with the Student Equity and Disability Support Team:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": []
        },
        "Subject options": {
            "overview": [
                "The Master of Tertiary Education (Management) is completed in 100 credit points of study over two years part-time. Students complete two core subjects, four electives, and one capstone subject."
            ]
        },
        "Core Subjects - 25 credit points": {
            "overview": [
                [
                    "MGMT90241",
                    "MGMT90242"
                ]
            ]
        },
        "Elective Subjects - 50 credit points": {
            "overview": [
                "Students choose four elective subjects from this list:",
                "The availability of a subject within a given year will depend on class enrolments.",
                [
                    "MGMT90168",
                    "MGMT90220",
                    "MGMT90247",
                    "MGMT90245",
                    "MGMT90117",
                    "MGMT90166",
                    "MGMT90169",
                    "MGMT90184",
                    "MGMT90221",
                    "EDUC90848"
                ]
            ]
        },
        "Capstone Subject - 25 credit points": {
            "overview": [
                "MGMT90246 Final Capstone Project can only be taken after completion of the two core subjects, and is the final subject of the course.",
                [
                    "MGMT90246"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates from this program are eligible to apply for entry to the Doctor of Education program or a PhD after completion of a 50-point Graduate Certificate in Educational Research, provided they meet the entry requirements and subject to achievement of an H2A GPA. Please note also that graduates of an undergraduate Honours degree may already be eligible for doctoral studies, subject to the same entry and achievement requirements."
    ]
}