{
    "Course name": "Master of Clinical Education",
    "Course code": "MC-CLINED",
    "Overview text": [
        "The Master of Clinical Education is designed for those who wish to further develop their career in education and training for the health professions. It builds on the two years of learning that comprise the Graduate Diploma and Graduate Certificate preceding it, allowing more scholarly engagement with the theory and practice of clinical education. Combining a research project on a topic of immediate importance to the participant’s daily work with master classes on leadership and change management, the Master of Clinical Education is intended to create the next generation of academic leaders in this field.",
        "Last updated: 10 November 2023"
    ],
    "Overview table": {
        "Award title": "Master of Clinical Education",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an entry-to-practice degree or equivalent in a health discipline, and",
            "at least one year of documented clinical teaching and/or clinical supervision experience.",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking and/or assessing applications, the Selection Committee will consider:",
            "prior academic qualification and performance; and",
            "the professional experience; and ",
            "the nature and type of clinical teaching and/or clinical supervision experience",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. The minimum English language requirements for this course areBand 7.0",
            "Applicants with a Graduate Certificate of Clinical Teaching or Graduate Certificate of University Teaching from the University of Melbourne will be eligible to commence at the second year of the program, as may be those with an equivalent qualification in clinical teaching, or medical or health professional education from another university.",
            "Applicants with a Graduate Diploma of Clinical Education from the University of Melbourne will be eligible to commence at the third year of the program, as may be those with an equivalent qualification in clinical teaching, or medical or health professional education from another university."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Medicine, Dentistry and Health Sciences welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Commonwealth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with the Student Equity and Disability Support Team:http://www.services.unimelb.edu.au/disability/",
            "Participants are required to attend healthcare settings and be actively involved in the delivery of clinical teaching and assessment whilst undertaking the course."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Semester 1, Year 1",
                "EDUC90741 - Effective Clinical Teaching, Compulsory, 12.5 points",
                "EDUC90742 – Effective Clinical Supervision, Compulsory, 12.5 points",
                "Semester 2, Year 1",
                "EDUC90744 – Assessing Clinical Learners, Compulsory, 12.5 points",
                "EDUC90743 – Clinical Education in Practice, Compulsory, 12.5 points",
                "Semester 1, Year 2",
                "EDUC90803 - Pedagogy into Practice, Compulsory, 12.5 points",
                "EDUC90804 - Clinical Assessment & Course Evaluation, Compulsory, 12.5 points",
                "Semester 2, Year 2",
                "EDUC90805 - Clinical Simulation, Compulsory, 6.5 points",
                "EDUC90802 - Research in Clinical Education, Compulsory, 6.5 points",
                "EDUC90801 - Clinical Education Modules, Compulsory, 12.5 points",
                "Semester 1, Year 3",
                "EDUC90837 Clinical Education Research Proposal, Compulsory, 12.5 points",
                "EDUC90836 Leadership in Clinical Education, Compulsory,12.5 points",
                "Semester 2, Year 3",
                "EDUC90838 Project in Clinical Education, Compulsory, 25 points"
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "EDUC90741",
                    "EDUC90742",
                    "EDUC90744",
                    "EDUC90743",
                    "EDUC90803",
                    "EDUC90804",
                    "EDUC90805",
                    "EDUC90802",
                    "EDUC90801",
                    "EDUC90837",
                    "EDUC90836",
                    "EDUC90838"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}