{
    "Course name": "Master of Economics",
    "Course code": "MC-ECO",
    "Overview text": [
        "The Master of Economics is a two year program in advanced studies in economics and econometrics. It provides training in critically reading the literature and experience in undertaking independent research. The program is ideal for those who wish to acquire the skills needed to practice as a professional economist in the public or private sectors. Graduates of the Master of Economics will have detailed knowledge of the most recent research in the disciplines of economics and econometrics and will have developed the skills needed to make their own contributions to that research.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Master of Economics",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "065396D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate or postgraduate degree with a strong analytical or mathematical component and with a weighted average mark of at least H2A (75%);",
            "a personal statement outlining why they wish to be considered for the course; and",
            "the Graduate Record Examination (GRE) unless the applicant has completed an undergraduate degree in Australia or New Zealand or met one of the approved conditions for GRE exemption.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance;",
            "the GRE score unless the applicant has completed an undergraduate degree in Australia or New Zealand or met one of the approved conditions for GRE exemption; and",
            "the personal statement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. The minimum English language requirements for this course areBand 6.5.",
            "Notes:",
            "1. To meet the analytical or mathematical prerequisite requirements, applicants with an economics background will normally be required to have a major in economics including calculus-based economics subjects plus an econometrics subject with a weighted average mark of at least H2A (75%) across the major.",
            "2. Applicants from a non-economics background require an undergraduate major of a mathematical/analytical nature including calculus, linear algebra and statistics subjects with a weighted average mark of at least H2A (75%) and will also be required to have completed microeconomics and macroeconomics subjects at least at the second year level.",
            "3. Students who discontinue from the Master of Economics but have successfully completed the requirements of the Graduate Diploma in Economics will be eligible to receive the Graduate Diploma in Economics as an exit award.",
            "4. Applicants with an honours degree in economics with a weighted average mark of at least H2A (75%), or a relevant postgraduate degree with a weighted average mark of at least H2A (75%), who have completed subjects which satisfy the prerequisites for both the core and quantitative second year subjects in the Master of Economics may be awarded up to 100 points of credit into the Master of Economics."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Business and Economics welcomes applications from students with disabilities. It is University and Faculty policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.",
            "The BCom and Masters degrees of the Faculty of Business and Economics equip graduates with the knowledge and technical skills necessary to understand and participate in the modern business world. The degrees include the following academic requirements for study:",
            "(1) The ability to explain and evaluate concepts, theories, institutional arrangements and operations of modern mixed economies;(2) The ability to critically evaluate the economy, commerce and business in the broader social and political context;(3) The ability to explain and apply concepts across a range of commerce and business disciplines in solving business and policy problems; and(4) The ability to contribute positively to the development of organisations and society in relation to business, government and the commercial professions.",
            "All students of the Faculty’s courses must possess intellectual, ethical, and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the Faculty. Candidates for the BCom degree and for FBE Masters degrees must have abilities and skills in communication; in conceptual, integrative, and quantitative dimensions; and in behavioural and social dimensions.",
            "I. Communication: The student must be able to communicate effectively and efficiently in oral and/or written form. A student must have the ability to clearly and independently communicate knowledge and application of a discipline, principles or practices during assessment tasks, and in some discipline streams.",
            "II. Intellectual‐Conceptual, Integrative and Quantitative Abilities: The student is expected to have the ability to develop problem‐solving skills and demonstrate the ability to establish study plans and priorities. These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving requires all of these intellectual abilities. Students should also have the ability to comprehend complex disciplinary and cross disciplinary information related to the BCom and Masters degrees.",
            "III. Behavioural and Social Attributes: A student must possess behavioural and social attributes that enable them to participate in a complex learning environment and the emotional health required for full utilisation of his/her intellectual abilities. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. Integrity, concern for others, interpersonal skills, interest, and motivation are all personal qualities that are deemed necessary for students enrolled in FBE courses.",
            "Students who feel their disability will prevent them from participating in tasks involving the inherent academic requirements of the BCom and FBE Masters courses are encouraged to contact Student Equity and Disability Support. Adjustments can be provided to minimise the impact of a disability, but students should participate in the course in an independent manner."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "All commencing Master of Economics students are required to seek study planning advice from the program directorbeforeenrolling into subjects.",
                "Year 1The first year of the Master of Economics consists of eight semester-length subjects comprising two core economics subjects, an econometrics subject and five elective subjects.Year 2The second year of the Master of Economics consists of eight semester-length subjects comprising two economics subjects, an econometrics subject, three elective subjects and the (double subject) Research Report."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "YEAR 1": {
            "overview": [
                "The first year of the Master of Economics consists of eight semester-length subjects comprising two core economics subjects, an econometrics subject and five elective subjects."
            ],
            "Two core economics subjects:": {
                "overview": [
                    [
                        "ECON40001",
                        "ECON40002"
                    ]
                ]
            },
            "One of the following econometrics subjects:": {
                "overview": [
                    [
                        "ECOM30002",
                        "ECOM40006"
                    ]
                ]
            },
            "Five elective subjects:": {
                "overview": [
                    "Selected from third year (level three), fourth year (level four), and advanced offerings of the Faculty as approved by the Academic Director of the program. An elective subject may not be taken if a candidate has previously completed a subject of similar content. Please see the elective list further down the page (at the end of the 'Year 2' section)."
                ]
            }
        },
        "YEAR 2": {
            "overview": [
                "The second year of the Master of Economics consists of eight semester-length subjects comprising two economics subjects, an econometrics subject, three elective subjects and the (double subject) Research Report*."
            ],
            "Two economics subjects:": {
                "overview": [
                    "Students must select at least one subject from Group A and at least one subject from Group B",
                    "Group A",
                    [
                        "ECON90002",
                        "ECON90068",
                        "ECON90013",
                        "ECON90022",
                        "ECON90023",
                        "ECON90028"
                    ],
                    "Group B",
                    [
                        "ECON90003",
                        "ECOM90012",
                        "ECON90011",
                        "ECON90021"
                    ]
                ]
            },
            "One of the following econometrics subjects:": {
                "overview": [
                    "Students who have NOT completed ECOM90013 Econometrics 3 in the first year of their Masters MUST enrol into this subject in Year 2.",
                    "Students who have completed ECOM90013 Econometric Techniques in the first year of their Masters are permitted to enrol into one of the following (excluding ECOM90013 Econometrics 3):",
                    [
                        "ECOM90005",
                        "ECOM90007",
                        "ECOM90008",
                        "ECOM90010",
                        "ECOM90011",
                        "ECOM90013"
                    ]
                ]
            },
            "Captone subject": {
                "overview": [
                    "Students must enrol in both Parts 1 and 2 of the Research Report in consecutive semesters.",
                    [
                        "ECON90071",
                        "ECON90072"
                    ],
                    "*Students who have already completed a research project/component that accounts for at least 25% of their year’s work during a four-year Honours degree in economics may be eligible for an exemption from ECON90071 and ECON90072. An exemption will normally only be considered if a grade of at least an equivalent University of Melbourne H2A (75%) was achieved and if the four-year Honours degree in economics was completed no more than 2 years prior to entry into the second year of the Masters program. Students who are eligible for an exemption from ECON90071 and ECON90072 will be able to choose 2 alternative 12.5 point subjects in consultation with the Masters of Economics Program Director."
                ]
            },
            "Three elective subjects:": {
                "overview": [
                    "Three masters-level elective subjects from the Department of Economics. An elective subject may not be taken if a candidate has previously completed a subject of similar content. In the first year of the Master of Economics, students select Level 3 and 4 electives and in the second year, select Level 9 electives. Students may seek permission from the Program Director to take certain Level 9 subjects in the first year of the program."
                ]
            }
        },
        "Master of Economics elective list": {
            "overview": [
                "Third Year Subjects(Level-3)",
                [
                    "ECOM30003",
                    "ECOM30004",
                    "ECON30001",
                    "ECON30002",
                    "ECON30003",
                    "ECON30005",
                    "ECON30007",
                    "ECON30011",
                    "ECON30017",
                    "ECON30018",
                    "ECON30019",
                    "ECON30022",
                    "ECON30013",
                    "ECON30024"
                ],
                "Graduate Level Subjects(Level-9)",
                [
                    "ECOM90003",
                    "ECOM90004",
                    "ECOM90005",
                    "ECOM90006",
                    "ECOM90007",
                    "ECOM90008",
                    "ECOM90011",
                    "ECOM90014",
                    "ECOM90017",
                    "ECOM90020",
                    "ECOM90023",
                    "ECON90004",
                    "ECON90005",
                    "ECON90011",
                    "ECON90012",
                    "ECON90013",
                    "ECON90014",
                    "ECON90019",
                    "ECON90022",
                    "ECON90023",
                    "ECON90027",
                    "ECON90028",
                    "ECON90037",
                    "ECON90052",
                    "ECON90053",
                    "ECON90054",
                    "ECON90075",
                    "BUSA90473",
                    "BUSA90485",
                    "BUSA90525"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}