{
    "Course name": "Master of International Education (International Baccalaureate)",
    "Course code": "MC-INTEDIB",
    "Overview text": [
        "The Master of International Education (International Baccalaureate) is a fully online program. It offers a specialist degree for teachers and administrators working at all levels of education. It is designed for those wanting to broaden their understanding and skills in relation to the philosophy and concepts underlying the International Baccalaureate (IB) and to assist those wanting to work internationally. The course investigates the IB from a range of theoretical perspectives with focused inquiry into policy and practice.",
        "Please note that this program will not provide graduates with initial teacher education qualifications to teach in Australia."
    ],
    "Overview table": {
        "Award title": "Master of International Education (International Baccalaureate)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• a four-year education degree, or equivalent; or• an undergraduate degree in any discipline and at least 50 credit points, or equivalent, of graduate study in education.Meeting these entry requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:• prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.The core participation requirements for study in the Faculty of Education are:In all courses1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching.2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Student Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "International Baccalaureate",
            "The course is accredited by the International Baccalaureate®"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of International Education (International Baccalaureate) is a 100 credit point degree.",
                "The degree requires completion of:",
                [
                    "25 points of compulsory subjects",
                    "at least one specialisation, each consisting of 25 points of study",
                    "electives totalling 25 points",
                    "capstone subjects totalling 25 points"
                ],
                "The capstone subjects are taken at the end of the degree.",
                [
                    "1. \nEDUC90333 Introduction to the IB is a prerequisite for EDUC90261 Curriculum Frameworks in the IB PYP",
                    "2. \nEDUC90331 Assessment & Reporting in the IB is a prerequisite for EDUC90260 IB PYP Advanced"
                ],
                [
                    "1. \nEDUC90333 Introduction to the IB is a prerequisite for EDUC90968 Curriculum Frameworks in the IB MYP",
                    "2. \nEDUC90331 Assessment & Reporting in the IB is a prerequisite for EDUC90969 IB MYP Advanced"
                ],
                [
                    "1. \nEDUC90333 Introduction to the IB is a prerequisite for EDUC90332 Curriculum Frameworks in the IB DP",
                    "2. \nEDUC90331 Assessment & Reporting in the IB is a prerequisite for EDUC90330 IB DP Advanced"
                ],
                [
                    "Students will need to have completed the necessary prerequisites for the electives into which they enrol."
                ],
                [
                    "1. \nEDUC90926 Researching Education Practice is a prerequisite or corequisite for EDUC90871 International Baccalaureate Capstone"
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Compulsory subjects": {
            "overview": [
                [
                    "EDUC90333",
                    "EDUC90331"
                ]
            ]
        },
        "Specialisations": {
            "overview": [
                "See Majors, Minors, Specialisations"
            ]
        },
        "Electives": {
            "overview": [
                "Students choose subjects totalling 25 credit points from the following online courses; subject to meeting subject pre-requisites:"
            ],
            "Master of International Education (International Baccalaureate)": {
                "overview": [
                    [
                        "EDUC90332",
                        "EDUC90330",
                        "EDUC90968",
                        "EDUC90969",
                        "EDUC90261",
                        "EDUC90260"
                    ]
                ]
            },
            "Master of Education in Evidence-Based Teaching": {
                "overview": [
                    [
                        "EDUC90828",
                        "EDUC90862",
                        "EDUC90830",
                        "EDUC90832",
                        "EDUC90859",
                        "EDUC90900",
                        "EDUC90831",
                        "EDUC90975"
                    ]
                ]
            },
            "Master of Evaluation": {
                "overview": [
                    [
                        "EDUC90847",
                        "EDUC90850",
                        "EDUC90715",
                        "EDUC90716",
                        "EDUC90717",
                        "EDUC90719",
                        "EDUC90849",
                        "EDUC90851",
                        "EDUC90933",
                        "MAST90078",
                        "EDUC90848"
                    ]
                ]
            }
        },
        "Capstone": {
            "overview": [
                [
                    "EDUC90926",
                    "EDUC90871"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates from this program are eligible to apply for entry to a Doctor of Education program provided they meet other entry requirements and subject to achievement of an H2A grade average.",
        "To be eligible to apply for a PhD following achievement of an H2A grade average, a further 50-point Graduate Certificate in Educational Research or equivalent will be necessary."
    ]
}