{
    "Course name": "Master of Psychology (Clinical Neuropsychology)",
    "Course code": "527CN",
    "Overview text": [
        "The clinical neuropsychology program at the University of Melbourne commenced in the 1970s and aims to provide students with the skills and knowledge necessary for competent practice in relation to a variety of diagnostic problems and management issues. The acquisition of professional skills at a sophisticated level is the ultimate goal of the program. The program enjoys an excellent reputation as one of the premier clinical neuropsychology programs in the country and produces graduates with a detailed understanding of the affective, behavioural and cognitive manifestations of diseases of the central nervous system, particularly those affecting the brain, in adults and children. Graduates acquire competence in various approaches to the study of brain disease, including basic and applied clinical sciences, and are expected to acquire an understanding of culturally responsive, objective assessment of the many behavioural features of brain diseases that can present across the lifespan.",
        "The course is accredited by theAustralian Psychology Accreditation Council (APAC),providing the required sequence of subjects for graduates wishing to attain generalist registration as a psychologist in Australia as well as competency in knowledge and skills relevant to the clinical neuropsychology specialisation.",
        "The course is comprised of coursework subjects, practical experience through clinical placements and a research thesis in an area relevant to clinical neuropsychology.  All subjects are compulsory.  The academic members of the teaching staff are actively involved in the practice of clinical neuropsychology (including supervision of clinical trainees) in a teaching hospital, and are therefore well positioned to bring to the teaching situation a high level of clinical and research expertise.",
        "Students undertake clinical placements in a wide variety of services that cover acute care neurology and neurosurgery, psychiatry, geriatrics, rehabilitation, and paediatrics. The placement experience enjoyed by our students is one of the most extensive in the world."
    ],
    "Overview table": {
        "Award title": "Master of Psychology (Clinical Neuropsychology)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "009681G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "within the last 10 years, a Australian Psychology Accreditation Council (APAC) accredited four-year undergraduate sequence in psychology (namely a three-year major in psychology as part of an undergraduate degree plus a fourth year Honours specialisation in psychology or equivalent) with a weighted average mark of at least H2A (75%) or equivalent. The weighted average is calculated one third from third year (Level 3) psychology subjects and two thirds from fourth year (Level 4) psychology subjects; and",
            "a personal statement of no more than 500 words; and",
            "two referee reports to be submitted online; and",
            "attend a selection interview (short-listed applicants only).",
            "Meeting these requirements does not guarantee selection.",
            "For applicants with results from the University of Melbourne for subjects undertaken in Semester 1, Winter Term and/or Semester 2, 2020, the following will apply:",
            "A Psychology Benchmark will be established based on all psychology subjects completed any time other than Semester 1, Winter Term and Semester 2, 2020.",
            "Subjects undertaken in Semester 1, Winter Term and/or Semester 2, 2020, for which results are lower than the Psychology Benchmark will be excluded from the entry score calculation.",
            "The above changes do not apply to yearlong subjects undertaken in 2020; such results will be included in the entry score calculation.",
            "In the case that applying this rule results in no eligible Level 3 and Level 4 marks for inclusion, then the Psychology Benchmark will be used as the entry score.",
            "For external applicants, the benchmark will not apply and we will use numerical scores for all available level 3 and level 4 psychology subjects in the selection formula.",
            "Pass/fail grades will be excluded from the selection formula.",
            "In the case that excluding pass/fail subjects from the selection formula leaves either the Level 3 or Level 4 terms in the formula empty, the entry score will be the non-empty term (i.e., average of eligible Level 3 subjects if no Level 4 marks are eligible for inclusion; average of eligible Level 4 subjects if no Level 3 marks are eligible for inclusion).",
            "For the avoidance of doubt, the exclusion of results based on the Psychology Benchmark does not apply to any study periods other than those listed above.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "suitability for clinical training as determined by the interview, personal statement and referee reports.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7is required.",
            "Notes.",
            "Selection into the two Master of Psychology courses associated with a PhD place in Psychology requires the approval of the intended PhD supervisor, the Faculty of Medicine, Dentistry and Health Sciences, and the Melbourne School of Graduate Research.",
            "Applicants must enrol in the Masters programme (Clinical Psychology or Clinical Neuropsychology) and then apply to articulate to the combined PhD programme towards the end of their first year in the Masters programme."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.",
            "The University is dedicated to provide support to those with special requirements, Further details on the disability support scheme can be found at the Disability Liaison Unit website:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Psychology Accreditation Council",
            "Accredited by the Australian Psychology Accreditation Council (APAC) and recognised by the Australian Health Practitioner Regulation Agency (AHPRA)"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "This course consists of coursework, placement and a minor research thesis (equivalent to 10,000 words).",
                "Coursework consists of 13 classroom-based subjects taken over the two years of the course (see below) and 125 days of Placement (30 days in the first-year and 95 days in the second-year)."
            ]
        },
        "Subject options": {
            "overview": [
                "In order to satisfy the requirements of the Master of Psychology (Clnincal Neuropsychology), students must complete the following subjects:",
                "First-year subjects:",
                [
                    "PSYC90003",
                    "PSYC90039",
                    "PSYC90032",
                    "PSYC90006",
                    "PSYC90029",
                    "PSYC90030",
                    "PSYC90031",
                    "PSYC90084",
                    "PSYC90007",
                    "PSYC90082",
                    "PSYC90083",
                    "PSYC90008",
                    "PSYC90125"
                ],
                "Second-year subjects:",
                [
                    "PSYC90079",
                    "PSYC90080",
                    "PSYC90023",
                    "PSYC90042",
                    "PSYC90033",
                    "PSYC90095",
                    "PSYC90096"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}