{
    "Course name": "Master of Publishing and Communications",
    "Course code": "MC-PUBCOM",
    "Overview text": [
        "The Master of Publishing and Communications provides students with vocational skills, theoretical knowledge and industry exposure to build a successful career in the publishing and communication sectors. Alongside a strong focus on publishing practices and technologies, with hands-on subjects in editing, production and business practices, the course offers sustained and stimulating analyses of the political, commercial and historical dynamics of print and digital cultures."
    ],
    "Overview table": {
        "Award title": "Master of Publishing and Communications",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "061634E",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline with a weighted average mark of at least H2B (70%), or equivalent.",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "relevance of previous studies.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required.",
            "Applicants with the following may be awarded up to 50 points of credit:",
            "an undergraduate degree in Humanities and Social Sciences with a weighted average mark of at least H2B (70%), or equivalent.",
            "Applicants with the following may be awarded up to 100 points of credit:",
            "a honours degree in Publishing and Communications, with a weighted average mark of at least H2B (70%), or equivalent; or",
            "an undergraduate degree in a cognate discipline, with a weighted average mark of at least H2B (70%), or equivalent, and at least two years of documented, relevant work experience.",
            "Applicants seeking credit for relevant work experience must document their experience with a brief curriculum vitae detailing the experience, contact details of two referees who can confirm the authenticity and nature of the experience claimed, and a covering letter that explains how the experience is relevant to the program and prepares them for it.",
            "Applicants who qualify for 50 or 100 points of credit who wish to undertake a longer version of the degree may do so on request."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "200 point program",
                "Duration:2 years full-time / up to 4 years part-time",
                "Coursework Only Option",
                "First 100 points:",
                [
                    "three compulsory subjects (37.5 points)",
                    "minimum of three elective subjects from List A (37.5 points)",
                    "maximum of two elective subjects from List B (25 points)"
                ],
                "Second 100 points:",
                [
                    "elective subjects from List C (100 points)"
                ],
                "or",
                "Minor Thesis Option",
                "First 100 points:",
                [
                    "three compulsory subjects (37.5 points)",
                    "minimum of three elective subjects from List A (37.5 points)",
                    "maximum of two elective subjects from List B (25 points)"
                ],
                "Second 100 points:",
                [
                    "PUBL90022 Publishing and Communications Thesis Parts 1 and PUBL90023 Publishing and Communications Thesis Part 2 (37.5 points)",
                    "PUBL90024 Advanced Research Methods (12.5 points) OR ARTS90032 Research Principles and Practices Graduate (12.5 points)",
                    "four elective subjects from List C (50 points)"
                ],
                "150 point program",
                "Duration:1.5 years full-time/ up to 3 years part-time",
                "Coursework Only Option",
                [
                    "three compulsory subjects (37.5 points)",
                    "elective subjects (112.5 points)"
                ],
                "or",
                "Minor Thesis Option",
                [
                    "three compulsory subjects (37.5 points)",
                    "PUBL90022 Publishing and Communications Thesis Parts 1 and PUBL90023 Publishing and Communications Thesis Part 2 (37.5 points)",
                    "PUBL90024 Advanced Research Methods (12.5 points) OR ARTS90032 Research Principles and Practices Graduate (12.5 points)",
                    "elective subjects (62.5 points)"
                ],
                "100 point program",
                "Duration:1 year full-time/ up to 2 years part-time",
                "Coursework Only Option",
                [
                    "two compulsory subjects (25 points)",
                    "elective subjects (75 points)"
                ],
                "or",
                "Minor Thesis Option",
                [
                    "two compulsory subjects (25 points)",
                    "PUBL90022 Publishing and Communications Thesis Parts 1 and PUBL90023 Publishing and Communications Thesis Part 2 (37.5 points)",
                    "PUBL90024 Advanced Research Methods (12.5 points) OR ARTS90032 Research Principles and Practices Graduate (12.5 points)",
                    "elective subjects (25 points)"
                ],
                "Capstone Requirement:",
                "All students are required to complete the Capstone Requirement for the program (at least 25 points). Students must complete one capstone option:",
                "Capstone Stream 1 THESIS: PUBL90022 Publishing and Communications Thesis Part 1 and PUBL90023 Publishing and Communications Thesis Part 2, and PUBL90024 Advanced Research Methods  OR ARTS90032 Research Principles and Practices Graduate (50 points total)",
                "Purpose:An opportunity to integrate knowledge and research skills to address a research question",
                "Capstone Stream 2 WORK INTEGRATEDLEARNING (WIL): MULT90019 Internship II(Semester Long, 25 points)or Grattan Street Pressoption 1, PUBL90025 Grattan Street Press (Extended)(25 points) or GrattanStreet Press option 2, PUBL90015 Grattan StreetPress and PUBL90026 Publishingand Writing Summer School (25 points total).",
                "Purpose:An experiential-learning opportunity to apply knowledge and research skills to solve problems that arise in professional contexts, and develop an integrated understanding of theory and practice",
                "Capstone Stream 3 INDUSTRY PROJECT: PUBL90020 Advanced Book Publishing (25 points)",
                "Purpose:An opportunity to apply knowledge, methodologies and production skills through a sustained project.",
                "Capstone Stream 4 ADVANCED EDITING:  PUBL90021 Editing Masterclass and, PUBL90015 Grattan Street Press or PUBL90026 Publishing and Writing Summer School (25 points)",
                "Purpose:Multiple opportunities to develop knowledge and skills through sustained projects.",
                "For policies that govern this degree, seeAcademic Services Policyin theUniversity Melbourne Policy Framework."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who complete the thesis option may be eligible for entry into the PhD."
    ]
}