{
    "Course name": "Master of Information Systems",
    "Course code": "MC-IS",
    "Overview text": [
        "The Master of Information Systems (MIS) is a 200 credit point coursework degree for those interested in professional or research careers in Information Systems, IT management and digital business: professionals supporting, managing and changing business processes through information and communications technology (ICT) and information systems.The course design supports careers in areas such as:  IT Leadership and Consulting, Business Analyst, Enterprise Architecture, Process Mining, Business Analytics, Cyber Security Management, Project Management, Innovation & Strategic Thinking, and IS Research."
    ],
    "Overview table": {
        "Award title": "Master of Information Systems",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "055847J",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• an undergraduate degree in any discipline, with a weighted average mark of at least H3 (65%), or equivalentMeeting this requirement does not guarantee selection.2. In ranking applications, the Selection Committee will consider:• prior academic performance3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 6.5(http://about.unimelb.edu.au/academicboard/resolutions) is required.Notes:• Up to 50 points of credit may be awarded to applicants who have:– an undergraduate degree in any discipline with a weighted average mark of at least H3 (65%) and at least one year documented relevant work experience; or– a Graduate Certificate in Information Systems with a weighted average mark of at least (65%) or equivalent.",
            "• Up to 100 points of credit may be awarded to applicants who have:– an undergraduate degree in Information Systems with a weighted average mark of at least H3 (65%) or equivalent and two years of documented relevant work experience; or– a four-year Honours degree in Information Systems with a weighted average mark of at least H3 (65%) or equivalent; or– an undergraduate degree in any discipline with a weighted average mark of at least H3 (65%) or equivalent, at least one year of documented relevant work experience and an Advanced Graduate Certificate in Information Systems with at least an H3 (65%) average or equivalent; or– an undergraduate degree in any discipline with at least an H3 (65%) average, and an Advanced Graduate Diploma in Information Systems with at least an H3 (65%) average or equivalent.",
            "• References above to a degree in Information Systems means a degree with at least 60% of specialised information systems studies, including a balanced mix of technical and management topics, project management and professional ethics. Many IT or Computer Science degrees do not meet this requirement.",
            "There are three possible early exit point qualifications for students enrolled in the Master of Information Systems:",
            "– Graduate Certificate in Information Systems, for students who have completed four of the following subjects:",
            "•  ISYS90026 Concepts in Information Systems•  INFO90002 Database Systems and Modelling•  COMP90059 Introduction to Programming•  ISYS90049 Digital Business Analysis•  ISYS90090 Cyber Security Management•  ISYS90045 Professional IS Consulting•  ISYS90118 Skills for IS Research and Development•  ISYS90050 IT Project and Change Management•  ISYS90043 Enterprise Applications and Architectures•  ISYS90038 IS Strategy and Governance",
            "– Graduate Certificate in Information Systems (Advanced), for students who have completed:",
            "At least 25 points of subjects from the following list:•  ISYS90090 Cyber Security Management•  ISYS90045 Professional IS Consulting•  ISYS90119 Skills for IS Research and Development•  ISYS90050 IT Project and Change Management•  ISYS90043 Enterprise Applications and Architectures•  ISYS90038 IS Strategy and Governance",
            "Up to 25 points of subjects from the following list:",
            "•  ISYS90089 Strategic Change Leadership•  ISYS90051 Digital Impacts on Business and Society•  ISYS90097 Information Economy and Society",
            "– Graduate Diploma in Information Systems, for students who have completed:",
            "At least 75 points of subjects from the following list:",
            "•  ISYS90026 Concepts in Information Systems•  INFO90002 Database Systems and Modelling•  COMP90059 Introduction to Programming•  ISYS90049 Digital Business Analysis•  ISYS90090 Cyber Security Management•  ISYS90045 Professional IS Consulting•  ISYS90118 Skills for IS Research and Development•  ISYS90050 IT Project and Change Management•  ISYS90043 Enterprise Applications and Architectures•  ISYS90038 IS Strategy and Governance",
            "Up to 25 points of subjects from the following list:",
            "•  ISYS90089 Strategic Change Leadership•  ISYS90051 Digital Impacts on Business and Society•  ISYS90097 Information Economy and Society•  ISYS90081 Business Process Management•  ISYS90112 Business Process Mining Applications•  ISYS90039 Innovation and Entrepreneurship in IT•  ISYS90035 Knowledge Management Systems•  ISYS90117 Managing Business Analytics•  ISYS90036 Enterprise Systems•  ISYS90120 Cyber Security Practice in Organisations",
            "For more information on meeting the University's English language requirements, see:http://futurestudents.unimelb.edu.au/info/international/english_and_foundation_programs"
        ],
        "Inherent requirements (core participation requirements)": [
            "The Master of Information Systems welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree.",
            "The Master of Information Systems requires all students to enrol in subjects where they will require:",
            "a) the ability to comprehend complex science and technology related information;b) the ability to clearly and independently communicate a knowledge and application of science, and technology principles and practices during assessment tasks;c) the ability to actively and safely contribute in clinical, laboratory, and fieldwork/excursion activities.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. There may be additional inherent academic requirements for some subjects, and these requirements are listed within the description of the requirements for each of these subjects. Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the relevant Subject Coordinator and Student Equity and Disability Support:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Computer Society",
            "The new MC-IS course has been provided with accreditation by the Australian Computer Society."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Information Systems requires the successful completion of 200 credit points.",
                "All students must complete:",
                [
                    "125 credit points of compulsory subjects including\n87.5 credit points of Year 1 compulsory subjects\n37.5 credit points of Year 2 compulsory subjects\n\n",
                    "87.5 credit points of Year 1 compulsory subjects",
                    "37.5 credit points of Year 2 compulsory subjects",
                    "25 credit points of Capstone experience subjects (where students select one of four capstone options) including25 credit points of Capstone selective subjects or 25 credit points of Capstone IS Research Project subjects\n",
                    "25 credit points of Capstone selective subjects or 25 credit points of Capstone IS Research Project subjects",
                    "50 credit points of elective subjects including\nA minimum of 25 credit points of Master of Information Systems (MIS) elective subjects\nA maximum of 25 credit points of general elective subjects\n\n",
                    "A minimum of 25 credit points of Master of Information Systems (MIS) elective subjects",
                    "A maximum of 25 credit points of general elective subjects"
                ],
                [
                    "87.5 credit points of Year 1 compulsory subjects",
                    "37.5 credit points of Year 2 compulsory subjects"
                ],
                [
                    "25 credit points of Capstone selective subjects or 25 credit points of Capstone IS Research Project subjects"
                ],
                "25 credit points of Capstone selective subjectsor25 credit points of Capstone IS Research Project subjects",
                [
                    "A minimum of 25 credit points of Master of Information Systems (MIS) elective subjects",
                    "A maximum of 25 credit points of general elective subjects"
                ],
                "A maximum of 25 credit points of general elective subjects",
                "Additional rules",
                [
                    "The capstone experience study needs to be taken in Year 2",
                    "For the elective requirement, 12.5 credit points of study needs to be taken  in Year 1; 37.5 credit points of study need to be taken in Year 2",
                    "Students can seek to take elective subjects outside the listed electives with course coordinator permission (a maximum of 25 credit points)"
                ],
                "The following course plan is for students commencing in 2023",
                "Students who started the Master of Information Systems in 2022 or prior should use the course plans listed in the year in which they started.",
                "For example:",
                "* 2022 Professional Specialisation:",
                "https://handbook.unimelb.edu.au/2022/components/mc-is-infspc-2",
                "* 2022 Research Specialisation:",
                "https://handbook.unimelb.edu.au/2022/components/mc-is-infspc-3",
                "The Master of Information Systems consists of 200 points of study, typically across four semesters.",
                "Students with relative work experience may be awarded Advanced Standing within the MIS, as described in the entry requirements above."
            ],
            "Subject Options": {
                "overview": [
                    "Year 1",
                    "Compulsory subjects",
                    [
                        "ISYS90026",
                        "INFO90002",
                        "COMP90059",
                        "ISYS90049",
                        "ISYS90090",
                        "ISYS90045",
                        "ISYS90118"
                    ],
                    "Year 2",
                    "Compulsory subjects",
                    [
                        "ISYS90050",
                        "ISYS90043",
                        "ISYS90038"
                    ],
                    "Capstone subjects",
                    "Capstone IS Research Project subjects",
                    [
                        "ISYS90109",
                        "ISYS90110"
                    ],
                    "OR",
                    "Capstone experience selective subjects",
                    [
                        "ENGR90033",
                        "INFO90010",
                        "ISYS90119"
                    ],
                    "Elective Subjects",
                    "Master of Information Systems (MIS) elective subjects",
                    [
                        "ISYS90089",
                        "ISYS90051",
                        "ISYS90097",
                        "ISYS90081",
                        "ISYS90112",
                        "ISYS90039",
                        "ISYS90035",
                        "ISYS90036",
                        "ISYS90069",
                        "ISYS90078",
                        "ISYS90117"
                    ],
                    "General electives",
                    [
                        "INFO90001",
                        "ISYS90076",
                        "ISYS90077",
                        "GEOM90007"
                    ],
                    "COMP9XXXX subjects",
                    "SWEN9XXXX subjects",
                    "INFO9XXXX subjects",
                    "Or subjects outside this with coordinator permission"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}