{
    "Course name": "Master of Industrial Engineering",
    "Course code": "MC-INDENG",
    "Overview text": [
        "Industrial engineers systematically transfer design and concept into tangible products and services, from design and production to business strategies and in a wide range of industrial systems, aiming to help ensure the competitiveness of firms. Students in this course develop a comprehensive set of skills in manufacturing technologies, system and simulation, operation and business management, and advanced manufacturing and operation techniques. Real-world projects and industry grounding activities help to consolidate theoretical knowledge and prepare students to undertake careers in industries from manufacturing and processing to healthcare, banking and consulting.",
        "Distinction",
        "Upon completion of the Master of Industrial Engineering, it is possible for a student to be awarded Master of Industrial Engineering with Distinction provided a student has achieved a high level of academic performance. Eligibility of the Distinction award is dependent on a calculated distinction score.",
        "The distinction score will only take into account Level 9 subjects undertaken at the University of Melbourne. This means Study Abroad and Exchange subjects will not be considered. One 12.5 point subject with the lowest mark will be omitted in the calculation of the distinction score. All level 9 subjects with credit points of more than 12.5 points must be included in the calculations. Only marks from the first attempt at a subject will be used. The average mark will be weighted by the credit points of the subjects. A Master of Industrial Engineering with Distinction will be awarded if the score is 80 or above.",
        "Last updated: 21 February 2024"
    ],
    "Overview table": {
        "Award title": "Master of Industrial Engineering",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "102808M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a 3‐year undergraduate degree in any engineering system major with a weighted average mark of at least H3 (65%) or equivalent; Or,",
            "a 4‐year Bachelor of Engineering degree or equivalent with a weighted average mark of at least H3 (65%) or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider;",
            "prior academic performance; and if relevant",
            "professional experience",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses.",
            "For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Master of Industrial Engineering requires all students to enrol in subjects where they will require:",
            "The ability to comprehend complex science, technology and engineering related information;",
            "The ability to clearly and independently communicate a knowledge and application of science, technology and engineering principles and practices during assessment tasks; and in some areas of study",
            "The ability to actively and safely contribute in clinical, laboratory, and fieldwork/excursion activities.",
            "Behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Master of Industrial Engineering is a 200 point program. Students are required to complete:",
                [
                    "15 Core subject (187.5 points)",
                    "1 Selective subject (12.5 points)"
                ]
            ]
        },
        "Year 1": {
            "overview": [
                "8 Core subjects (100 credit points)",
                "Choose One of:",
                [
                    "ENGR90021",
                    "ENGR90034"
                ],
                "Plus all of:",
                [
                    "MCEN90054",
                    "MCEN90055",
                    "MCEN90058",
                    "MCEN90053",
                    "MGMT90032",
                    "MCEN90059",
                    "MCEN90057"
                ]
            ]
        },
        "Year 2": {
            "overview": [
                "(100 credit points)",
                "Students must complete:",
                [
                    "ENGR90037",
                    "ENGR90038",
                    "MAST90014",
                    "MGMT90026",
                    "MCEN90060",
                    "MCEN90056",
                    "ENGM90011"
                ],
                "Students should select one of:",
                [
                    "ENGM90006",
                    "ENGM90013",
                    "ENGM90014"
                ]
            ],
            "Engineering Practice Hurdle Requirement": {
                "overview": [
                    "Students enrolled in the master of industrial engineering degree will need to satisfy the requirements of the Engineering Practice hurdle prior to being awarded the degree. Students will be introduced early in their degree to the online e‐portfolio system as a way of documenting their attainment of graduate attributes which accord with University and professional accreditation standards. Students will keep a record of their stepwise attainment of these capabilities throughout their engineering studies at Melbourne. The artifacts recorded in the e‐portfolio may include formal study elements, such as design reports, as well as reflections on extracurricular activities such as employment and volunteering activities."
                ],
                "Hurdle Requirement": {
                    "overview": [
                        "In order to achieve the Engineering Practice Hurdle requirement, students will need to document the attainment of professional skills at an adequate level. This may include the successful completion of any of the following:",
                        [
                            "Skills Towards Employment Program (STEP)",
                            "The University’s Leaders in Community Award (LiCA) program.",
                            "ENGR90033 Internship subject.",
                            "CHEN90028 Industry Program subject.",
                            "An agreed level of internship at an approved engineering firm (without receiving University credit)"
                        ],
                        "Completion of the degree will not be approved until this requirement has been met."
                    ]
                }
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}