{
    "Course name": "Master of Biotechnology",
    "Course code": "MC-SCIBIT",
    "Overview text": [
        "Biotechnology is the useful application of a biological product or process. The process of commercialisation is inevitably required for a discovery to become applied and widely used.",
        "Biotechnology is a growing area of applied science and covers a diversity of specialist fields. Disciplines that Biotechnology includes are; molecular biology, biochemistry, cell biology, microbiology, plant and environmental sciences, engineering, drug development, nanofabrication, reproductive sciences, stem cells and genetically modified organisms. Modern medicine, agriculture, animal breeding, pharmaceuticals, food production and processing etc., all utilise various Biotechnology tools.",
        "The core disciplines will focus on advances in key technologies, and will give the student the scientific understanding of how discoveries progress from the laboratory to the marketplace. This scientific knowledge will be developed together with an understanding of what is procedurally required to transform a discovery into a useful and commercialised product or process. This includes such areas as Intellectual Property, Market Structure, Drug Trial Design, Regulatory Affairs, Quality Management and Good Manufacturing Processes.",
        "This professional entry program offers students the opportunity to undertake core science studies as well as professional skills modules, which provide high-level training in the areas of business, communications and science application.",
        "In the second year of study students will work in groups to undertake an Industry Project with a company external to the University.",
        "Outstanding students may replace the Industry Project with the Research Project, depending upon the availability of a suitable project and supervisor. Upon successful completion of the Research Project, students may be eligible to apply to study for a PhD at the University of Melbourne."
    ],
    "Overview table": {
        "Award title": "Master of Biotechnology",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "072809G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree in an appropriate scientific discipline with a course weighted average mark of at least H3 (65%).",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note: Appropriate scientific disciplines are any of Agricultural Science, Biochemistry and Molecular Biology, Bioengineering Systems, Biotechnology, Cell and Developmental Biology, Chemistry, Food Science, Genetics, Immunology, Microbiology, Pathology, Pharmacology, Plant Science, Veterinary BioSciences and Zoology or an equivalent discipline, as permitted by the course coordinator."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Master of Biotechnology welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree. The Master of Biotechnology requires all students to enrol in subjects where they will require:(1) the ability to comprehend complex science and technology related information;(2) the ability to clearly and independently communicate a knowledge and application of science, and technology principles and practices during assessment tasks;(3) the ability to actively and safely contribute in clinical, laboratory, and fieldwork/excursion activities.",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. There may be additional inherent academic requirements for some subjects, and these requirements are listed within the description of the requirements for each of these subjects. Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the relevant Subject Coordinator and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "National Professional Science Master’s Association (NPSMA)(http://www.npsma.org//)"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Biotechnology requires the successful completion of 200 credit points.",
                "Students must complete 200 points of:",
                [
                    "100 credit points of compulsory subjects",
                    "25 credit points of compulsory industry project subject",
                    "75 credit points of elective subjects includingA minimum of 25 credit points of Technical/Practical Science subjects\nThe remaining points (a maximum of 50 credit points) are taken from the Business, Technical/Practical Science and Professional Development Skills subjects list, as below.\n",
                    "A minimum of 25 credit points of Technical/Practical Science subjects",
                    "The remaining points (a maximum of 50 credit points) are taken from the Business, Technical/Practical Science and Professional Development Skills subjects list, as below."
                ],
                [
                    "A minimum of 25 credit points of Technical/Practical Science subjects"
                ],
                [
                    "The remaining points (a maximum of 50 credit points) are taken from the Business, Technical/Practical Science and Professional Development Skills subjects list, as below."
                ],
                "Note:",
                "If a student wishes to take a Masters level subject (Level 9) that is not listed within the elective list, and they have satisfied the prerequisites for it, students can contact the Course Coordinator to request approval to enrol. Please submit an Enrolment Assistance form with the Course Coordinator's approval so staff can assist:",
                "Enrolment Assistance"
            ],
            "Subject Options": {
                "overview": [
                    "Compulsory subjects",
                    [
                        "SCIE90011",
                        "SKIL90004",
                        "MAST90072",
                        "MKTG90022",
                        "LAWS90003",
                        "MGMT90171",
                        "SCIE90034",
                        "BTCH90010"
                    ],
                    "Industry project subject",
                    [
                        "SCIE90015"
                    ],
                    "Elective Subjects",
                    "A minimum of 25 credit points of Technical/Practical Science subjects:",
                    [
                        "BIOL90001",
                        "BTCH90005",
                        "BTCH90009",
                        "SCIE90002",
                        "SCIE90016",
                        "SCIE90028",
                        "SCIE90029",
                        "SCIE90017"
                    ],
                    "Remaining (a maximum of 50 credit points) from Business, Technical/Practical Science and Professional Development Skills subjects:",
                    [
                        "BMEN90011",
                        "FOOD90008",
                        "CHEN90031",
                        "BUSA90403",
                        "FNCE90060",
                        "POPH90093",
                        "ACCT90041",
                        "LING90002",
                        "LAWS90129",
                        "AGRI90091",
                        "LAWS90063",
                        "BIOL90001",
                        "SCIE90002",
                        "BTCH90005",
                        "BTCH90009",
                        "SCIE90016"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}