{
    "Course name": "Master of Public Health",
    "Course code": "244CW",
    "Overview text": [
        "The Master of Public Health offers students the opportunity to gain the skills and knowledge required for a career in public health practice. Within the course students are exposed to the core foundations of public health theory and practice and also have the opportunity to specialise in the advanced public health training streams offered through the University of Melbourne. The Master of Public Health programs at the University of Melbourne is delivered by academic staff with extensive experience and depth of knowledge, who are leaders in their chosen fields of public health.",
        "The Master of Public Health has three components:",
        "This course is delivered in a mixed attendance mode (both on campus and online)."
    ],
    "Overview table": {
        "Award title": "Master of Public Health",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "020358D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered applicants must have completed:",
            "An undergraduate degree in any discipline, with a weighted average mark of at least 65%, or equivalent OR",
            "An undergraduate degree and one of the following Graduate Certificates from the University of Melbourne, with a weighted average mark of at least 65%:\n\n",
            [
                [
                    "Graduate Certificate in Health Economics and Economic Evaluation,",
                    "Graduate Certificate in Sexual Health,",
                    "Graduate Certificate in Gerontology,",
                    "Graduate Certificate in Health Informatics and Digital Health,",
                    "Graduate Certificate in Infectious Disease Epidemiology,",
                    "Graduate Certificate in Climate Change and Health or",
                    "Graduate Certificate in Public Health"
                ]
            ],
            "Graduate Certificate in Health Economics and Economic Evaluation,",
            "Graduate Certificate in Sexual Health,",
            "Graduate Certificate in Gerontology,",
            "Graduate Certificate in Health Informatics and Digital Health,",
            "Graduate Certificate in Infectious Disease Epidemiology,",
            "Graduate Certificate in Climate Change and Health or",
            "Graduate Certificate in Public Health",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Public health and health-related work experience, as evidenced by a CV provided by the candidate.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Notes:",
            "a. Advanced Standing: Successful applicants may be eligible for either 25, 50 or 100 points advanced standing under the following circumstances:",
            "25 Points Advanced Standing:\n\n",
            [
                [
                    "Successful applicants with an undergraduate health professional degree and a weighted average mark of 65% or higher may receive 25 points of advanced standing."
                ]
            ],
            "50 Points Advanced Standing:\n\n",
            [
                [
                    "Successful applicants with one of the following may receive 50 points of advanced standing:\n\n",
                    [
                        [
                            "a medical degree, or",
                            "an undergraduate degree in public health, or",
                            "an undergraduate degree and at least two years appropriate full-time work experience in a public health or professional healthcare setting, or",
                            "a Master’s Degree (Research or Coursework) or PhD in health or public health"
                        ]
                    ]
                ]
            ],
            "100 Points Advanced Standing\n\n",
            [
                [
                    "Successful applicants with one of the following may receive 100 points of advanced standing and would be required to complete four core subjects (excluding Foundations of Public Health, and Public Health Leadership and Management), two electives of their choice from the Master of Public Health electives, and a 25 point capstone option.\n\n",
                    [
                        [
                            "MBBS/MD qualified and are a Medical Specialist Fellow of Australia, and have current registration with AHPRA or equivalent, approved by the Fellowship awarding Faculty.",
                            "Executive level or equivalent role in health within government or the health service sector with at least 5 years of full-time health sector work experience."
                        ]
                    ]
                ]
            ],
            "Successful applicants with an undergraduate health professional degree and a weighted average mark of 65% or higher may receive 25 points of advanced standing.",
            "Successful applicants with one of the following may receive 50 points of advanced standing:\n\n",
            [
                [
                    "a medical degree, or",
                    "an undergraduate degree in public health, or",
                    "an undergraduate degree and at least two years appropriate full-time work experience in a public health or professional healthcare setting, or",
                    "a Master’s Degree (Research or Coursework) or PhD in health or public health"
                ]
            ],
            "a medical degree, or",
            "an undergraduate degree in public health, or",
            "an undergraduate degree and at least two years appropriate full-time work experience in a public health or professional healthcare setting, or",
            "a Master’s Degree (Research or Coursework) or PhD in health or public health",
            "Successful applicants with one of the following may receive 100 points of advanced standing and would be required to complete four core subjects (excluding Foundations of Public Health, and Public Health Leadership and Management), two electives of their choice from the Master of Public Health electives, and a 25 point capstone option.\n\n",
            [
                [
                    "MBBS/MD qualified and are a Medical Specialist Fellow of Australia, and have current registration with AHPRA or equivalent, approved by the Fellowship awarding Faculty.",
                    "Executive level or equivalent role in health within government or the health service sector with at least 5 years of full-time health sector work experience."
                ]
            ],
            "MBBS/MD qualified and are a Medical Specialist Fellow of Australia, and have current registration with AHPRA or equivalent, approved by the Fellowship awarding Faculty.",
            "Executive level or equivalent role in health within government or the health service sector with at least 5 years of full-time health sector work experience.",
            " ",
            "b. Applicants who have completed subjects within the following degrees from the University of Melbourne may receive advanced standing (with credit): Graduate Certificates in Aboriginal Health in Rural Communities, Graduate Certificate in Health Economics and Economic Evaluation, Graduate Certificate in Infectious Disease Epidemiology, Graduate Certificate in Sexual Health, Graduate Certificate in Gerontology, Graduate Certificate in Health Informatics and Digital Health, Graduate Certificate in Climate Change and Health, Graduate Certificate in Public Health.",
            "c. The Graduate Certificates listed provide credit for entry to the Master of Public Health. Any of the abovementioned Graduate Certificates cannot be taken concurrently with the Master of Public Health. The Graduate Certificates cannot be claimed retrospectively when the relevant subjects are taken as part of a completed Master of Public Health.",
            "d. Students enrolled in the University of Melbourne Doctor of Medicine (MD) may be permitted to enrol in the Master of Public Health after the completion of the third year of the MD and may receive 50 points of advanced standing (31.25 points unspecified credit into the MPH (MD) and 12.5 specific credit against the CORE subject POPH90217 Foundations of Public Health OR the CORE subject POPH90218 Public Health Leadership and Management.) and 6.25 points unspecified credit for completion of a Trainee Internship in Population Health during the final year of the MD.",
            "This pathway is not available to students who have already completed the MD and quotas may be applied to both CSP and fee-based enrolments.",
            "e. Students currently enrolled in their first year of the Master of Public Health (MPH) who have been successful in gaining entry to the MD are eligible for entry to the MD-MPH Intercalated degree providing they have completed POPH90217 Foundations of Public Health, POPH90013 Biostatistics, POPH90014 Epidemiology 1, POPH90231 Qualitative Research in Public Health, POPH90274 Prioritising & Planning Public Health and Five Elective Subjects. MPH students who study part-time and successfully undertake the requisite ten subjects over a period exceeding a year and enter the MD subsequently will also be considered eligible for the MPH (MD). Students will receive specified credit against the core subject POPH90218 Public Health Leadership and Management. If students have completed only eight subjects prior to entering the MD, they will then be required to complete an additional two elective subjects from the MPH during their MD studies."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005) and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Course and Subject Descriptions, Course and Subject Objectives, Generic Skills and Assessment Requirements of this entry. The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Student Equity and Disability Support (SEDS) website:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students in the standard 200 point program (without advanced standing) will need to complete:",
                [
                    "75 credit points of compulsory subjects",
                    "125 credit points of electives and capstone subjects including capstone subject(s) from one of the three capstone options:\n",
                    [
                        [
                            "25 credit points of Capstone Option 1 - Research Project (single or double semester options)",
                            "25 credit points of Capstone Option 2 - Professional Practice (single or double semester options)",
                            "12.5 credit points of Capstone Option 3 - Public Health subject"
                        ]
                    ]
                ],
                "Note:",
                [
                    "Successful applicants can be granted 25, 50 or 100 credit points of Advanced Standing in Master of Public Health.",
                    "Students granted with 25 or 50 credit points of Advanced Standing in Master of Public Health will take the equivalent credit points of less elective subjects accordingly.",
                    "Students granted with 100 credit points of advanced standing take 50 credit points of core subjects (choosing from POPH90217,  POPH90013, POPH90014, POPH90231, POPH90218 and POPH90274) as well as 50 credit points of elective and capstone subjects in the 100 point program."
                ],
                "Additional rules",
                "Successful applicants for the Doctor of Medicine informal specialisation will be granted a minimum of 50 credit points advanced standing. Please refer to the Doctor of Medicine informal specialisation page for the rules to follow in detail."
            ],
            "Subject Options": {
                "overview": [
                    "Core subjects",
                    "Students entering the 175 or 150 point program are eligible to apply for an exemption examination for POPH90217 Foundations of Public Health. Students granted an exemption must complete one extra elective subject in lieu of POPH90217 Foundations of Public Health. To apply to sit for an exemption examination please contact the Subject Coordinator for Foundations of Public Health prior to the start of the subject. If you have completed a subject similar to POPH90217 Foundations of Public Health in the past five years at a post graduate level you will not be required to sit an exemption exam and will automatically be offered 12.5 points of credit for your prior study.",
                    [
                        "POPH90217",
                        "POPH90013",
                        "POPH90014",
                        "POPH90231",
                        "POPH90274",
                        "POPH90218"
                    ],
                    "Elective subjects",
                    "International Students from Non-English Speaking Backgrounds are encouraged to enrol in this subject offered jointly by the Faculty of Medicine, Dentistry and Health Sciences and the Centre for Communication Skills and English Language Studies:",
                    [
                        "LING90002"
                    ],
                    "The Master of Public Health (MPH) is flexible and does not have fixed streams. Students may tailor elective subject choices to suit their interests, provided they meet course requirements. All elective subjects offered in the MPH are listed below:",
                    [
                        "POPH90137",
                        "POPH90256",
                        "POPH90189",
                        "POPH90200",
                        "POPH90243",
                        "POPH90206",
                        "POPH90020",
                        "POPH90169",
                        "POPH90270",
                        "POPH90201",
                        "POPH90095",
                        "POPH90199",
                        "POPH90094",
                        "POPH90112",
                        "POPH90227",
                        "POPH90290",
                        "POPH90070",
                        "POPH90244",
                        "LING90002",
                        "POPH90247",
                        "PAED90005",
                        "POPH90230",
                        "POPH90144",
                        "POPH90069",
                        "POPH90093",
                        "POPH90111",
                        "POPH90229",
                        "POPH90205",
                        "POPH90090",
                        "POPH90271",
                        "FOOD90040",
                        "POPH90275",
                        "POPH90068",
                        "POPH90291",
                        "POPH90209",
                        "POPH90088",
                        "POPH90191",
                        "POPH90145",
                        "POPH90066",
                        "PSYT90092",
                        "POPH90264",
                        "ISYS90069",
                        "POPH90242",
                        "POPH90131",
                        "POPH90294",
                        "POPH90297",
                        "SCWK90067",
                        "SCWK90068",
                        "POPH90267",
                        "POPH90257",
                        "POPH90300",
                        "POPH90299",
                        "POPH90302",
                        "POPH90301",
                        "POPH90258",
                        "MEDI90107",
                        "MEDI90109",
                        "ABPL90022",
                        "POPH90303",
                        "POPH90304",
                        "POPH90305",
                        "POPH90306",
                        "POPH90058",
                        "ABPL90377",
                        "POPH90307",
                        "POPH90309",
                        "POPH90308",
                        "ENST90004",
                        "ENST90033",
                        "MULT90004",
                        "MULT90005",
                        "ENST90034",
                        "NURS90076"
                    ],
                    "*Students can also refer to the recommendations on elective subject combinations in the specialisation pages.",
                    "Capstone options",
                    "There are three capstone options to choose from. The capstone experience should be undertaken in the final year or final semester of your Master of Public Health.",
                    "Capstone Option 1 - Research Project",
                    "Students may apply to undertake either a 25 credit point supervised Research Project in their chosen field of specialisation. Students have the option of applying to enrol in a year-long research project (POPH90284 AND POPH90285) or a semester-long research project (POPH90255). Students enrolling in the year long project MUST complete the project in two semesters consecutively and in the correct sequence i.e. Part 1 followed by Part 2.",
                    "Students should be aware that they must complete a 25 credit point research project in order for the MPH to provide an entry pathway to the MPhil or PhD program.",
                    "Students must have a weighted average mark of at least 75% across relevant subjects to be eligible to enrol in the research project. Successful research project applicants will be selected on the basis of academic merit.",
                    [
                        "POPH90284",
                        "POPH90285",
                        "POPH90255"
                    ],
                    "Capstone Option 2 - Professional Practice",
                    "Students may apply to undertake either of the 25 credit point supervised Professional Practice Units (PPU). Students have the option of applying to enrol in a year-long PPU (POPH90286 AND POPH90287) or a semester-long PPU (POPH90239). Students enrolling in the year long PPU MUST complete in two semesters consecutively and in the correct sequence i.e. Part 1 followed by Part 2.",
                    "Limitations on student numbers apply so please ensure you have a back up plan (that is, a second capstone preference) in case you are not accepted into the Professional Practice Unit.",
                    [
                        "POPH90286",
                        "POPH90287",
                        "POPH90239"
                    ],
                    "Capstone Option 3 - Public Health",
                    "Students who choose this option must enrol in the following capstone subject and select an additional elective from those offered in the Master of Public Health:",
                    [
                        "POPH90227"
                    ]
                ]
            },
            "Exit Point": {
                "overview": [
                    "To be eligible for the Graduate Diploma in Public Health students who commenced the MPH from 2017 onward must complete one of the following:",
                    "Five core 12.5 credit point Master of Public Health subjects (POPH90217 Foundations of Public Health, POPH90014 Epidemiology 1, POPH90013 Biostatistics, POPH90231 Qualitative Research in Public Health, POPH90274 Prioritising & Planning in Public Health) and three Master of Public Health 12.5 credit point elective subjects of the student's choosing.",
                    "or",
                    "If an exemption is granted for POPH90217 Foundations of Public Health then students must complete four core 12.5 credit point Master of Public Health subjects (POPH90014 Epidemiology 1, POPH90013 Biostatistics, POPH90231 Qualitative Research in Public Health, POPH90274 Prioritising & Planning in Public Health) and four Master of Public Health 12.5 credit point elective subjects of the student’s choosing."
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}