{
    "Course name": "Master of Environmental Systems Engineering",
    "Course code": "MC-ENSYSEN",
    "Overview text": [
        "The Graduate Program in Environmental Systems Engineering is designed to meet the theoretical and practical skills of people working in environmental control authorities in industry and elsewhere.",
        "The program provides participants with a broad understanding of the practice of environmental engineering and provides experience in investigation. Participants are able to focus on skill development in the sectors relevant to them.",
        "Themes covered include: water and wastewater, municipal solid wastes, cleaner production, environment management systems, water resources management, and energy resources management.",
        "Last updated: 8 July 2024"
    ],
    "Overview table": {
        "Award title": "Master of Environmental Systems Engineering",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "106187C",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:either;– a four year degree in an engineering discipline with a weighted average mark of at least H3 (65%) or equivalent, or– an undergraduate degree in a cognate discipline with a weighted average mark of at least H3 (65%) or equivalent and at least two years of documented relevant professional or work experience.Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:• prior academic performance; and where relevant• the professional experience.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 6.5is required.Additional notes for the HandbookFor more information on meeting the University's English language requirements, see:http://futurestudents.unimelb.edu.au/info/international/english_and_foundation_programs"
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Master of Environmental Systems Engineering 100-point program:",
                [
                    "Four compulsory subjects (50 points)",
                    "Three selective subjects from the same focus area (37.5 points)",
                    "One selective subject (12.5 points)"
                ],
                "Students may chooseONEtheme they wish to focus on, from:",
                [
                    "Waste Management or",
                    "Energy or",
                    "Water Resources"
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core (50 points)": {
            "overview": [
                [
                    "ENEN90031",
                    "ENEN90028",
                    "ENEN90032",
                    "ENEN90040"
                ]
            ]
        },
        "Selective (37.5 points)": {
            "overview": [
                "Select 3 electives from one of the following focuses:"
            ],
            "Waste Management Focus": {
                "overview": [
                    "Selective Subjects:Choose 37.5 points.",
                    "Research subjects are subject to approval by the course coordinator.",
                    [
                        "CVEN90047",
                        "ENEN90006",
                        "ENEN90029",
                        "ENEN90005",
                        "ENEN90038"
                    ]
                ]
            },
            "Energy Focus": {
                "overview": [
                    "Selective Subjects:Choose 37.5 points.",
                    "Research subjects are subject to approval by the course coordinator.",
                    [
                        "CVEN90047",
                        "ENEN90027",
                        "ENEN90033",
                        "ENEN90011",
                        "ENEN90014"
                    ]
                ]
            },
            "Water Resources Focus": {
                "overview": [
                    "Selective Subjects:Choose 37.5 points.",
                    "Research subjects subject to approval by the course coordinator.",
                    [
                        "CVEN90047",
                        "ENEN90029",
                        "ENEN90038",
                        "ENGR90024",
                        "ENEN90037"
                    ]
                ]
            }
        },
        "": {
            "overview": []
        },
        "Elective (12.5 points)": {
            "overview": [],
            "Suggested Approved Electives": {
                "overview": [
                    "Elective subject:Choose 12.5 points.",
                    [
                        "GEOM90006",
                        "CVEN90027",
                        "CVEN90061",
                        "CVEN90063",
                        "ENGM90006",
                        "EVSC90025",
                        "CVEN90066",
                        "CVEN90068",
                        "CVEN90069",
                        "CVEN90070",
                        "ENEN90038",
                        "ENEN90039",
                        "ELEN90088",
                        "ENEN90037",
                        "ENGR90044"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}