{
    "Course name": "Master of Teaching (Secondary) Internship",
    "Course code": "MC-TEACHSI",
    "Overview text": [
        "The Master of Teaching (Secondary) Internship is a two-year full time initial teacher education course with a paid teaching internship in a Secondary school. The qualification prepares Interns to teach across the secondary years 7-12 with specialist knowledge in two learning areas, and provides an introduction into a third learning area to expand their knowledge and employability.",
        "The course enables both recent graduates and experienced career-change professionals who have the discipline knowledge and personal skills needed for a career in teaching to enter the profession in a highly structured and supported way.",
        "For the duration of the course Interns are employed in a Secondary school on a full time load (1.0 full time equivalent FTE), inclusive of teaching responsibilities for up to four days per week (maximum 0.8 FTE teaching load) and one day (0.2 FTE) time release for study. Interns are employed as a paraprofessional with Permission to Teach (Internship) from the Victorian Institute of Teaching (or equivalent Australian state/territory-based authority for Interns with a school appointment outside Victoria).",
        "The coursework component of the course is structured around three study intensives held during summer (on-campus) and winter (online), and online study completed during the University semesters.",
        "Ongoing support through the course is provided by School-based Mentor Teachers and Clinical Specialists from the Faculty of Education (FoE), to ensure Interns build confidence in the classroom and meet the Australian Institute of Teaching and School Leadership (AITSL) Graduate Teacher Standards. The FoE Clinical Model of Teaching integrates theory and practice, enabling Interns to develop the professional skills to work with learners of all abilities.",
        "The Master of Teaching (Secondary) Internship promotes a greater understanding of Aboriginal and Torres Strait Islander ways of knowing and being. There is a focus on wellbeing for both the student and the teacher, along with prioritising sustainable practices. The course will prepare graduates to become leaders in the profession and extend their capabilities through work integrated learning that links authentic real world professional experiences with disciplinary theory."
    ],
    "Overview table": {
        "Award title": "Master of Teaching (Secondary) Internship",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree with appropriate discipline studies to qualify for two teaching specialist areas, or one double teaching specialist area. Undergraduate studies must include at least a major study in one teaching area, and preferably a minor study in a second teaching areab; and ",
            "A selection testc; as determined by the Selection Committee; and",
            "A school-based interview (for shortlisted candidates), leading to an appointment in a school prior to the commencement of the course.d\n",
            "Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "The results of the selection testc.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAcademic Board rules on the use of selection instruments.4. Applicants are required to satisfy the university’sEnglish language requirements for graduate degrees. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, UoMperformance band 8is required.eNote",
            "(a) This is an initial teacher education qualification for those wanting to become a registered secondary school teacher; applicants who already hold a recognised secondary teacher qualification are not eligible for entry to this course.",
            "(b) For the definition of ‘major study’ and ‘minor study’ refer to theAustralian Institute for Teaching and School Leadership (AITSL) guidelines.",
            "(c) All applicants must complete the Teacher Capability Assessment Tool (TCAT) selection test and meet all TCAT benchmarks. Details of the selection test are available on the Faculty of Education'sTeacher Capability Assessment Tool (TCAT) website.",
            "(d) The Faculty of Education will advise shortlisted candidates on the process for the school-based interview, which may vary according to the school.",
            "(e) The Selection Committee may require applicants who have not recently completed a full undergraduate degree in Australia or New Zealand to demonstrate English language ability using one of the standard tests approved by the Academic Board at UoMperformance band 8, even if their prior study of the English language, or their prior education and assessment in an English language university, would normally exempt them from standard testing.",
            "(f) All applicants must hold either Permission to Teach from the Victorian Institute of Teaching (or equivalent Australian state/territory-based authority for Interns with a school appointment outside Victoria), or a valid Working with Children Check, at the point of course commencement. Permission to Teach is required prior to the commencement of the school appointment, and for the duration of the MC-TEACHSI program.",
            "(g) Teacher Candidates who successfully complete Year 1 of the Standard Mode of the MC-TEACHSA Master of Teaching (Secondary) may apply to transfer to the second year of the MC-TEACHSI Master of Teaching (Secondary) Internship course, provided a suitable teaching appointment in a Secondary school can be secured."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.",
            "All Interns are required to meet the core participation requirements for study in the Faculty of Education. In all courses, these are:",
            "1. The ability to comprehend complex information related to education and the disciplines in which the Intern is teaching.",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "3. Behavioural and social attributes that enable an Intern to participate in a complex learning environment. Interns are required to take responsibility for their own participation and learning. They also contribute to the learning of other Interns in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other Interns. Assessment may include the outcomes of tasks completed in collaboration with other Interns.",
            "In courses requiring students to undertake Clinical Teaching Practicum (Employment-based teaching Internship)",
            "4.  The ability to undertake Clinical Teaching Practicum Internships independently, including:",
            "1. the ability based on personal maturity to establish a professional relationship with students and interact with them appropriately;",
            "2. the ability to communicate to students the subject matter being taught with clarity and in a way that is age-sensitive;",
            "3. the ability to model literacy and numeracy skills independently for students and in all their interactions meet community expectations of the literacy and numeracy skills;",
            "4. the ability to demonstrate skilful and safe activities required in particular discipline areas being taught (e.g. physical education activities, science laboratory techniques);",
            "5. the ability to create, monitor and maintain a safe physical environment, a stable and supportive psychological environment, and a productive learning environment in their classroom;",
            "6. the ability to establish effective relationships with all members of the school community, including colleagues, students and caregivers;",
            "7. the ability based on mental and physical health to exercise sound judgment and respond promptly to the demands of classroom situations, and the personal resilience to cope and maintain their wellbeing under stress.",
            "Interns who feel a disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Victorian Institute of Teaching",
            "The Master of Teaching (Secondary) Internship is accredited by the Victorian Institute of Teaching (VIT) according to the Australian Institute of Teaching and School Leadership (AITSL) Graduate Standards and Initial Teacher Education Program Standards. Graduates may apply for registration to teach in Australian schools."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Teaching (Secondary) Internship requires the successful completion of 200 credit points of study over two years of full-time study.",
                "The course requires completion of:",
                "A two-year employment-based teaching internship in a Secondary school (for four days per week); and",
                "Fourteen compulsory subjects and one elective, which must be taken in the sequence outlined in the Subject Options section. The subjects include:",
                [
                    "Four core subjects;",
                    "Six Learning Area subjects (taken in two Learning Area study sequences, or in a double sequence);",
                    "Three Engaging and Assessing Learners subjects (which incorporate the employment-based teaching Internship);",
                    "One Professional Learning Capstone subject; and",
                    "One Foundations elective."
                ]
            ],
            "Progression Rules": {
                "overview": [
                    "1.LITERACY AND NUMERACY TEST FOR INITIAL TEACHER EDUCATION STUDENTS",
                    [
                        "The Australian Commonwealth Government’s Literacy and Numeracy Test for Initial Teacher Education Students (LANTITE) is a compulsory test for Initial Teacher Education students administered by the Australian Council for Educational Research (independently of The University of Melbourne).",
                        "The Faculty of Education requires each Intern to satisfactorily complete the LANTITE by the end of the first calendar year of their enrolment in the Master of Teaching (Secondary) Internship to continue the course.",
                        "Failure to satisfactorily complete the LANTITE by this progression point will result in referral to the Faculty of Education Course Academic Progress Committee and may result in exclusion from the course until the LANTITE is satisfactorily completed.",
                        "An excluded Intern may be granted an early exit award of a Graduate Diploma in Pedagogy* (if they have satisfactorily completed 100 credit points of the course). Alternatively, they may be withdrawn from the course if they are not able to complete the LANTITE progression requirement within the guidelines set by the LANTITE test administering body."
                    ],
                    "*Note that the Graduate Diploma in Pedagogy (Secondary) Internship is not a qualification for registration to teach in Australian schools",
                    "2. COURSE ACADEMIC PROGRESS COMMITTEE",
                    "Any Intern who does not satisfactorily complete a subject, meet the course progression rules, or maintain an approved teaching contract, will be called to attend a Course Academic Progress Committee (CAPC) meeting after results have been certified for each subject. Interns in these categories will be invited to make an oral and/or written submission to the Committee as per the requirements of the CAPC process.",
                    "3. EMPLOYMENT REQUIREMENTS",
                    [
                        "Admission into and continued enrolment in the Master of Teaching (Secondary) Internship course is conditional upon an Intern maintaining an approved contractual employment agreement with a school throughout the duration of their studies*.",
                        "Any resignation or termination of school employment may result in an Intern being excluded from the course. An excluded Intern may be granted an early exit award of a Graduate Diploma in Pedagogy (Secondary) Internship (if they have satisfactorily completed 100 credit points of the course). Alternatively, they may be withdrawn from the course.",
                        "Where an Intern is granted a Leave of Absence from the course (by the Faculty of Education), the option to continue or cease school employment will be conditional upon relevant approvals and arrangements. This may include a change to Permission to Teach, to be arranged by the Intern with the employing school and the Victorian Institute of Teaching (or equivalent Australian state/territory-based authority for Interns with a school appointment outside Victoria). Where an Intern continues school employment whilst on Leave of Absence from the course, no activities (including employment-based hours) undertaken during the Leave of Absence will be counted towards fulfilment of course and subject requirements."
                    ],
                    "*Interns’ school employment match is approved by either the relevant Australian state/territory government department of education or the Faculty of Education (FoE). An Intern’s employment contract is offered and managed directly by the school of employment."
                ]
            }
        },
        "Subject Options": {
            "overview": [
                "Interns must follow the below structure when enrolling."
            ],
            "FIRST YEAR SUBJECTS": {
                "overview": [],
                "Summer Intensive and Semester 1": {
                    "overview": [
                        [
                            "Two Learning Area 1 subjects (12.5 credit points each); and",
                            "The two subjects below."
                        ],
                        [
                            "EDUC91202",
                            "EDUC91203"
                        ]
                    ]
                },
                "Winter Intensive and Semester 2": {
                    "overview": [
                        [
                            "Two Learning Area 2 subjects (12.5 credit points each); and",
                            "The two subjects below."
                        ],
                        [
                            "EDUC91204",
                            "EDUC91206"
                        ]
                    ]
                }
            },
            "SECOND YEAR SUBJECTS": {
                "overview": [],
                "Summer Intensive and Semester 1": {
                    "overview": [
                        [
                            "Two Learning Area 3 subjects (12.5 credit points each); and",
                            "One Foundations Elective; and",
                            "The two subjects below."
                        ],
                        "Note: ‘Professional Learning Capstone (MTeach)’ runs year-long and continues into semester 2.",
                        [
                            "EDUC91205",
                            "EDUC91152"
                        ]
                    ]
                },
                "Semester 2": {
                    "overview": [
                        [
                            "Continue the EDUC91152 Year-Long ‘Professional Learning Capstone (MTeach)’; and",
                            "The two subjects below."
                        ],
                        [
                            "EDUC91207",
                            "EDUC91208"
                        ]
                    ]
                }
            },
            "LEARNING AREA SUBJECTS": {
                "overview": [
                    "Interns enrol in the two Learning Area study sequences (or double sequence) as confirmed in their letter of offer into the course."
                ],
                "Learning Area 1 subjects": {
                    "overview": [
                        [
                            "EDUC91209",
                            "EDUC91210",
                            "EDUC91211",
                            "EDUC91212",
                            "EDUC91213",
                            "EDUC91214",
                            "EDUC91215",
                            "EDUC91216",
                            "EDUC91217",
                            "EDUC91218",
                            "EDUC91219",
                            "EDUC91220",
                            "EDUC91221",
                            "EDUC91222",
                            "EDUC91223",
                            "EDUC91224",
                            "EDUC91225",
                            "EDUC91226",
                            "EDUC91227",
                            "EDUC91228",
                            "EDUC91229",
                            "EDUC91230",
                            "EDUC91231",
                            "EDUC91232",
                            "EDUC91233",
                            "EDUC91234",
                            "EDUC91235",
                            "EDUC91236"
                        ]
                    ]
                },
                "Learning Area 2 subjects": {
                    "overview": [
                        [
                            "EDUC91237",
                            "EDUC91238",
                            "EDUC91239",
                            "EDUC91240",
                            "EDUC91241",
                            "EDUC91242",
                            "EDUC91243",
                            "EDUC91244",
                            "EDUC91245",
                            "EDUC91246",
                            "EDUC91247",
                            "EDUC91248",
                            "EDUC91249",
                            "EDUC91250",
                            "EDUC91251",
                            "EDUC91252",
                            "EDUC91253",
                            "EDUC91254",
                            "EDUC91255",
                            "EDUC91256",
                            "EDUC91257",
                            "EDUC91258",
                            "EDUC91259",
                            "EDUC91260",
                            "EDUC91261",
                            "EDUC91262",
                            "EDUC91263",
                            "EDUC91264"
                        ]
                    ]
                },
                "Learning Area 3 subjects": {
                    "overview": [
                        [
                            "EDUC91265",
                            "EDUC91266",
                            "EDUC91267",
                            "EDUC91268",
                            "EDUC91269",
                            "EDUC91270",
                            "EDUC91271",
                            "EDUC91272",
                            "EDUC91273",
                            "EDUC91274",
                            "EDUC91275",
                            "EDUC91276",
                            "EDUC91277",
                            "EDUC91278",
                            "EDUC91279",
                            "EDUC91280",
                            "EDUC91281",
                            "EDUC91282",
                            "EDUC91283",
                            "EDUC91284",
                            "EDUC91285",
                            "EDUC91286",
                            "EDUC91287",
                            "EDUC91288",
                            "EDUC91289",
                            "EDUC91290",
                            "EDUC91291",
                            "EDUC91292"
                        ],
                        "Note: The availability of Learning Area subjects will vary, dependent upon each cohort of Interns’ school appointment approved teaching areas."
                    ]
                }
            },
            "FOUNDATIONS ELECTIVES": {
                "overview": [
                    [
                        "EDUC91293",
                        "EDUC91294",
                        "EDUC91295",
                        "EDUC91296",
                        "EDUC91297",
                        "EDUC91298",
                        "EDUC91299",
                        "EDUC91300"
                    ]
                ]
            },
            "": {
                "overview": []
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Professional and Continuing Education DegreesThe University of Faculty of Education is widely recognised as a leader in continuing professional education. Graduates who wish to further their professional studies may consider aMaster of Educationor a specialist master’s degree. Entry to these courses is based on academic merit and may also require professional experience. For more information about continuing professional study in Education, see theFoE Coursespage.",
        "",
        "Graduate Research DegreesThe University of Melbourne's Faculty of Education is widely recognised as a leader in Australian and international education research. Graduates interested in further study in one ofFoE’s suite of graduate research degreesmay have several options, depending on their prior qualifications, academic achievement, research experience and professional experience.",
        "",
        "Graduates from this course (MC-TEACHSI) may be eligible to apply to:",
        [
            "the Graduate Certificate in Educational Research;",
            "the Master of Education (Research); or",
            "the Doctor of Education (with applicable professional experience). "
        ],
        "",
        "Alternatively, Graduates from this course (MC-TEACHSI) who have completed:",
        [
            "the Graduate Certificate in Educational Research;",
            "the Master of Education (Research); or",
            "an undergraduate Honours degree"
        ],
        "may be eligible to apply to one of the following FoE research degrees:",
        [
            "Doctor of Philosophy-Education (PhD)",
            "Doctor of Education",
            "Master of Philosophy - Education"
        ],
        "",
        "Entry to these courses is a competitive process and each course has other entry requirements such as a minimum academic entry score which must be met. Please check the Handbook course entry for details of entry requirements.",
        "For more information about graduate research study in Education see theFoEResearch Degreespage."
    ]
}