{
    "Course name": "Master of Creative Writing, Publishing and Editing",
    "Course code": "D01LF",
    "Overview text": [
        "The Master of Creative Writing, Publishing and Editing is designed to provide students with a vocational qualification where students take Creative Writing and Publishing and Editing subjects as part of their professional development. The degree demonstrates the links and shared skills between writer, editor and publisher as well as between fiction and non-fiction writing. On completion of the two-year Master of Creative Writing, Publishing and Editing program, students with a 75% average pass, that have completed CWRI90015 Creative Writing Thesis Part 1 and CWRI90016 Creative Writing Thesis Part 2, and completed ARTS90032 Research Principles and Practices Graduate, will be eligible to apply for entry to a PhD."
    ],
    "Overview table": {
        "Award title": "Master of Creative Writing, Publishing and Editing",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "058718E",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline with a weighted average mark of at least H2B (70%), or equivalent.",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "relevance of previous studies.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required.",
            "Applicants with the following may be awarded up to 50 points of credit:",
            "an undergraduate degree in a cognate discipline with a weighted average mark of at least H2B (70%), or equivalent."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students are required to complete the program requirements/structure from the year that they commenced their program. All compulsory and capstone subjects must be completed to be eligible to graduate from the program.",
                "200 point program",
                "Duration:2 years full-time / up to 4 years part-time",
                "Students in the 200 Point Program must complete subjects from the first 100 points list of subjects prior to enrolling into subjects from the second 100 points list of subjects:",
                "First 100 points:",
                [
                    "Foundation Creative Writing subjects (50 points)",
                    "3 compulsory subjects (37.5 points)",
                    "1 elective subject (12.5 points) from two lists: Creative Writing Electives and Publishing and Editing Electives"
                ],
                "Second 100 points:",
                [
                    "Elective subjects: at least 12.5 points from the Creative Writing electives list, and at least 12.5 points from the Publishing and Editing electives list, with a minimum of 37.5 points and maximum of 75 points of elective subjects. (Elective subjects taken through the course will total a minimum of 50 points and a maximum of 87.5 points.)• A Capstone option (minimum 25 points, maximum 62.5 points)"
                ],
                "150 point program",
                "Duration:1.5 years full-time / up to 3 years part-time",
                [
                    "3 compulsory subjects (37.5 points)• Elective subjects: at least 12.5 points from the Creative Writing electives list, and at least 12.5 points from the Publishing and Editing electives list, with a total minimum of 50 points and maximum of 87.5 points of elective subjects• A Capstone option (minimum 25 points, maximum 62.5 points)"
                ],
                "Capstone Requirement:",
                "Capstone subject options must be completed in the final hundred points of the program.  All students are required to complete one Capstone subject option (at least 25 points).  This requirement cannot be waived or replaced in any circumstances:",
                "Capstone 1:Thesis - CWRI90015 Creative Writing Thesis Part 1, CWRI90016 Creative Writing Thesis Part 2 and ARTS90032 Research Principles and Practices (Total 62.5 points)",
                "Purpose:An opportunity to integrate research and writing skills in the development of a major creative project. Pathway to apply for PhD.",
                "Capstone 2:Creative project - CWRI90019 Advanced Creative Writing Project (Total 25 points)Purpose:An opportunity to develop skills in the development of a major creative project.",
                "Capstone 3: Publishing Project - (Total 25 points):Complete one of these options:",
                [
                    "PUBL90025 Grattan Street Press Extended (25 points) or;",
                    "PUBL90026 Publishing and Writing Summer School and PUBL90015 Grattan Street Press (25 points)"
                ],
                "Purpose:An opportunity to develop skills in the development of a major publishing project, working in the School’s teaching press.",
                "For policies that govern this degree, see theCourses, Subjects, Awards and Programs Policyin theUniversity Melbourne Policy Library. Students also should also refer to information in theEnrolment and Timetabling Policy."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who complete ARTS90032 Research Principles and Practices Graduate and the Creative Writing Thesis, and achieve a 75% average, may be eligible for entry into the PhD."
    ]
}