{
    "Course name": "Master of Film and Television",
    "Course code": "MC-FILMTV",
    "Overview text": [
        "The Master of Film and Television develops the technical skills and collaborative dexterity necessary to create compelling screen work and navigate rapidly evolving industries. Students specialise in documentary and narrative filmmaking or screen producing, mentored by a diverse range of staff and industry guests in a collaborative learning environment.",
        "Students will progress from an intensive studio-based first year to a more autonomous project-oriented second year, guiding multiple screen projects (including a major capstone production) to completion, and developing market-ready projects to extend their experience beyond university.",
        "The course includes a professional industry placement, and a film festival and industry market experience that can be taken overseas or locally.",
        "Master of Film and Television graduates will develop unique screen philosophies to become resilient, global artistic citizens and cultural agents within the international professional film, television, arts and streaming worlds."
    ],
    "Overview table": {
        "Award title": "Master of Film and Television",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "075498D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a bachelor degree or equivalent, OR six years of documented relevant work experience; and",
            "a portfolio; and",
            "an interview (shortlisted applicants only).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking the applications, the Selection Committee will consider:",
            "prior academic achievement OR documented relevant work experience; and",
            "portfolio; and",
            "performance in an interview (shortlisted applicants only).",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Student Application and Selection Procedure.",
            "4. Applicants are required to satisfy the University's English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Notes:",
            "Details for the portfolio and interview (shortlisted applicants only) can be found on the Fine Arts and Music Study website \n",
            "Successful applicants will be required to hold a current First Aid Certificate and Working with Children Check and these must remain valid for the duration of the course",
            "Students who discontinue from the Master of Film and Television but have successfully completed the requirements of the Graduate Diploma in Film and Television will be eligible to apply to receive the Graduate Diploma as an exit award."
        ],
        "Inherent requirements (core participation requirements)": [
            "Communication:Students need to be able to communicate effectively and efficiently. Communication with fellow students, professional and academic staff, and the wider public about their knowledge and application of practising Arts disciplines is essential.",
            "Creative, Intellectual and Organisational Abilities:Students require the capacity for high-level creative performance or production. They are also expected to have the ability to develop problem-solving skills and to comprehend disciplinary and cross-disciplinary information. Students must have the ability to establish study plans and prioritise training objectives and outcomes.",
            "Behavioural and Social Attributes:Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. They must take full responsibility for their own participation and learning. Students also contribute to the learning of other students in collaborative environments and must therefore demonstrate a wide range of interpersonal skills which consider the needs of other students. Assessment includes the outcomes of tasks completed in collaboration with other students.",
            "Students who have a disability which may prevent them from participating in tasks involving these inherent academic requirements are encouraged to contact Student Equity and Disability Services:https://students.unimelb.edu.au/student-support/student-equity-and-disability-support"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Film and Television requires the successful completion of 200 credit points."
            ],
            "All students must complete:": {
                "overview": [
                    [
                        "75 credit points of Year 1 compulsory subjects",
                        "81.25 credit points of Year 2 compulsory subjects",
                        "Completion of one specialisation (consisting of 43.75 credit points)"
                    ]
                ]
            },
            "Course Progression Rules": {
                "overview": [
                    "To progress from Year 1 to Year 2, students must complete all Year 1 subjects."
                ]
            },
            "Subject options": {
                "overview": [
                    "Year 1",
                    [
                        "FLTV90045",
                        "FLTV90047",
                        "FLTV90049",
                        "FLTV90046",
                        "FLTV90048"
                    ],
                    "PLUS one core subject (25 credit points) according to the specialisation being undertaken.",
                    "Year 2",
                    [
                        "FLTV90052",
                        "FLTV90053",
                        "FLTV90054"
                    ],
                    "PLUS one core subject (18.75 credit points) according to the specialisation being undertaken."
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}