{
    "Course name": "Master of International Journalism",
    "Course code": "MC-INTJOUR",
    "Overview text": [
        "The Master of International Journalism (MIJ) is targeted at students interested in understanding and producing journalism in an international field of practice, where it is important that key skills are complemented by an understanding of different professional traditions, conventions, cultures and challenges.  It particularly seeks to cater for aspiring journalists or mid-career professionals concerned to develop an international career, by providing an in-depth focus on different traditions, media systems and industry environments. The Masters of International Journalism combines an emphasis on key skills - newsgathering and newswriting, video, audio, digital and social media production – with an international outlook on how different media operate in different cultures and markets. It also focuses on particular areas where a transnational perspective and knowledge is important, such as business and finance journalism. The degree supports understanding of the different expectations, pressures and opportunities of journalism in different industry, regulatory and cultural environments, and how globalisation and digitisation are contributing to change within and across these settings. It prepares graduates to be confident and knowledgeable practitioners in a diverse and rapidly changing international field of practice, while equipping them with the skills to successfully operate in the fast-changing environment of digital journalism. The degree also offers the potential for substantial coursework elements, including Internships, Journalism Project and Journalism Thesis, to be completed in international settings."
    ],
    "Overview table": {
        "Award title": "Master of International Journalism",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "096334F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. \nIELTS 6.5 overall with the written band 6.5 and no other band less than 6.0 - https://study.unimelb.edu.au/how-to-apply/english-language-requirements/graduate-english-language-requirements/course-specific-requirements#navigation-foa\n",
            "2. In order to be considered for entry, applicants must have completed:",
            "IELTS 6.5 overall with the written band 6.5 and no other band less than 6.0 -https://study.unimelb.edu.au/how-to-apply/english-language-requirements/graduate-english-language-requirements/course-specific-requirements#navigation-foa",
            "an undergraduate degree with a weighted average mark of at least H2B (70%), or equivalent.",
            "Meeting this requirement does not guarantee selection.",
            "1. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "relevance of previous studies.",
            "1. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "1. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required, with the written band not less than 6.5 and no other band less than 6.0",
            "Applicants with the following may be awarded up to 50 points of credit:",
            "an undergraduate degree in a cognate discipline, with a weighted average mark of at least H2B (70%) or equivalent; or",
            "an undergraduate degree in any discipline and a Graduate Certificate in a cognate discipline, with a weighted average mark of at least H2B (70%) or equivalent; or",
            "an undergraduate degree in any discipline, with a weighted average mark of at least H2B (70%) or equivalent, and at least two years of documented, relevant work experience.",
            "Applicants with the following may be awarded up to 100 points of credit:",
            "an honours degree in a cognate discipline, with a weighted average mark of at least H2B (70%), or equivalent; or",
            "an undergraduate degree in a cognate discipline, with a weighted average mark of at least H2B (70%), or equivalent, and at least two years of documented, relevant work experience.",
            "Applicants seeking credit for relevant work experience must document their experience with a brief curriculum vitae detailing the experience, contact details of two referees who can confirm the authenticity and nature of the experience claimed, and a covering letter that explains how the experience is relevant to the program and prepares them for it."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of International Journalism has three entry point programs: 200-point (two years full-time), 150-point (one and a half years full-time) and 100-point (one year full-time) programs."
            ],
            "Capstone Requirement:": {
                "overview": [
                    "All students are required to complete the Capstone Requirement for the program (at least 25 points). Students must complete one capstone option:",
                    "Capstone Stream 1 - Minor Thesis",
                    "JOUR90015 Journalism Thesis Part 1, JOUR90016 Journalism Thesis Part 2, and ARTS90032 Research Principles & Practices Graduate (50 points total)",
                    "Purpose: An opportunity to integrate knowledge and research skills to address a specific Journalism research by planning and executing a substantial research-based project",
                    "Capstone Stream 2 - Internship",
                    "JOUR90003 Journalism Internship (12.5 points) and JOUR90006 Dilemmas in Journalism: Law and Ethics (12.5 points) (25 points total)",
                    "Purpose: An opportunity to combine knowledge of and experience in international journalism, supporting potential professional pathways.",
                    "Capstone Stream 3 - Journalism Project",
                    "JOUR90025 Journalism Project Part 1 and JOUR90026 Journalism Project Part 2 (25 points total)",
                    "Purpose: An opportunity to complete a substantial professionally focussed project under industry standard supervision. This might be a book, portfolio of articles or other substantial journalistic project."
                ]
            },
            "200 point program": {
                "overview": [
                    [
                        "One compulsory subject (25 points)",
                        "A minimum of 37.5 points of core subjects (37.5 points)",
                        "A maximum of 100 points of elective subjects (100 points)",
                        "One of the capstone stream requirement (25 or 50 points)"
                    ],
                    "Students in the 200 point programs are strongly advised to complete JOUR90020 in their first semester of the degree. This subject will be a prerequisite for the existing subjects JOUR90005, JOUR90008 and JOUR90023, unless the course coordinator grants exemption from these requirements, which may be done on the grounds of previous study or industry experience.",
                    "Capstone Stream 1 - Minor Thesis Option",
                    [
                        "JOUR90020 International Journalism (25 points)",
                        "At least 37.5 points from the core subjects",
                        "No more than 100 points from the elective subjects",
                        "Capstone subjects (50 points): ARTS90032 Research Principles & Practices Graduate, JOUR90015 Journalism Thesis Part 1 and JOUR90016 Journalism Thesis Part 2"
                    ],
                    "or",
                    "Capstone Stream 2 - Internship Option",
                    [
                        "JOUR90020 International Journalism (25 points)",
                        "At least 50 points from the core subjects",
                        "No more than 100 points from the elective subjects",
                        "Capstone subjects(25 points): JOUR90003 Journalism Internship and JOUR90006 Dilemmas in Journalism: Law and Ethics"
                    ],
                    "or",
                    "Capstone Stream 3 - Journalism Project Option",
                    [
                        "JOUR90020 International Journalism (25 points)",
                        "At least 50 points from the core subjects",
                        "No more than 100 points from the elective subjects",
                        "Capstone subjects(25 points): JOUR90025 Journalism Project Part 1 and JOUR90026 Journalism Project Part 2"
                    ]
                ]
            },
            "150 point program": {
                "overview": [
                    [
                        "One compulsory subject (25 points)",
                        "A minimum of 37.5 points of core subjects (37.5 points)",
                        "A maximum of 50 points of elective subjects (50 points)",
                        "One of the capstone stream requirement (25 or 50 points)"
                    ],
                    "Students in the 150 point programs are strongly advised to complete JOUR90020 in their first semester of the degree. This subject will be a prerequisite for the existing subjects JOUR90005, JOUR90008 and JOUR90023, unless the course coordinator grants exemption from these requirements, which may be done on the grounds of previous study or industry experience.",
                    "Capstone Stream 1 - Minor Thesis Option",
                    [
                        "JOUR90020 International Journalism (25 points)",
                        "At least 37.5 points from the core Subjects",
                        "No more than 50 points from the elective subjects",
                        "Capstone subjects (50 points): ARTS90032 Research Principles & Practices Graduate, JOUR90015 Journalism Thesis Part 1 and JOUR90016 Journalism Thesis Part 2"
                    ],
                    "or",
                    "Capstone Stream 2 - Internship Option",
                    [
                        "JOUR90020 International Journalism (25 points)",
                        "At least 50 points from the core subjects",
                        "No more than 50 points from the elective subjects",
                        "Capstone subjects(25 points): JOUR90003 Journalism Internship and JOUR90006 Dilemmas in Journalism: Law and Ethics"
                    ],
                    "or",
                    "Capstone Stream 3 - Journalism Project Option",
                    [
                        "JOUR90020 International Journalism (25 points)",
                        "At least 50 points from the core subjects",
                        "No more than 50 points from the elective subjects",
                        "Capstone subjects(25 points): JOUR90025 Journalism Project Part 1 and JOUR90026 Journalism Project Part 2"
                    ]
                ]
            },
            "100 point program": {
                "overview": [
                    [
                        "A minimum of 25 points of core subjects (25 points)",
                        "A maximum of 37.5 points of elective subjects (37.5 points)",
                        "One of the capstone stream requirement (25 or 50 points)"
                    ],
                    "Capstone Stream 1 - Minor Thesis Option",
                    [
                        "At least 25 points from the core subjects",
                        "No more than 25 points from the elective subjects",
                        "Capstone subjects (50 points): ARTS90032 Research Principles & Practices Graduate, JOUR90015 Journalism Thesis Part 1 and JOUR90016 Journalism Thesis Part 2"
                    ],
                    "or",
                    "Capstone Stream 2 - Internship Option",
                    [
                        "At least 37.5 points from the core subjects",
                        "No more than 37.5 points from the elective subjects",
                        "Capstone subjects(25 points): JOUR90003 Journalism Internship and JOUR90006 Dilemmas in Journalism: Law and Ethics"
                    ],
                    "or",
                    "Capstone Stream 3 - Journalism Project Option",
                    [
                        "At least 37.5 points from the core subjects",
                        "No more than 37.5 points from the elective subjects",
                        "Capstone subjects(25 points): JOUR90025 Journalism Project Part 1 and JOUR90026 Journalism Project Part 2"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who complete the minor thesis may be eligible for entry into the PhD."
    ]
}