{
    "Course name": "Master of Science (Chemistry)",
    "Course code": "MC-SCICHE",
    "Overview text": [
        "The Master of Science (Chemistry) is a coursework masters degree incorporating a substantial research project.The Master of Science gives students the opportunity to undertake a substantive research project in a field of choice as well as a broad range of coursework subjects including a professional skills component, as a pathway to PhD study or to the workforce."
    ],
    "Overview table": {
        "Award title": "Master of Science (Chemistry)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "094594B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• An undergraduate degree with a major in Chemistry or equivalent with a weighted average mark of at least H3 (65%) in the best 50 points in the major or relevant discipline studies at third year; and• At least 25 points of third-year university-level Chemistry (of which 12.5 points must be practical-based subjects.Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:• Prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note:• Quotas may be applied and preference may be given to applicants with evidence of appropriate preparation or potential to undertake research.• Entry into  this stream of the Master of Science is subject to the capacity of the department(s) or schools(s) offering the program stream to provide adequate supervision in a research project appropriate to the interests and preparation of the individual student and may be subject to the agreement of a member of academic staff to supervise the project module."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry. The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Science (Chemistry) requires the successful completion of 200 credit points."
            ],
            "All students must complete:": {
                "overview": [
                    "75 credit points of discipline, professional skills and optional elective subjects including",
                    [
                        "Between 37.5 and 62.5 credit points of discipline subjects",
                        "Between 12.5 and 25 credit points of professional skills subjects",
                        "25 credit points of optional elective subjects including\n",
                        [
                            [
                                "A maximum of 12.5 credit points of Level 3 optional elective subjects"
                            ]
                        ]
                    ],
                    "And research project subjects",
                    "125 credit points of research project subjects"
                ]
            },
            "Subject Options": {
                "overview": [
                    "Discipline subjects",
                    "Students must take 37.5 to 62.5 credit points from the following subjects:",
                    [
                        "CHEM90039",
                        "CHEM90040",
                        "CHEM90041",
                        "CHEM90043",
                        "CHEM90045",
                        "CHEM90046",
                        "CHEM90047",
                        "CHEM90048",
                        "CHEM90049",
                        "CHEM90051",
                        "CHEM90052",
                        "CHEM90053",
                        "CHEM90054",
                        "CHEM90064",
                        "CHEM90065",
                        "CHEM90066"
                    ],
                    "Professional Skills subjects",
                    "Students must select 12.5 to 25 credit points of subjects from the following Professional Skills subject lists.",
                    "Business Skills"
                ],
                "": {
                    "overview": [
                        [
                            "SCIE90012",
                            "SCIE90013"
                        ],
                        "Optional elective subjects",
                        "Students may select up to 25 credit points of optional elective subjects, including a maximum of 12.5 credit points of Level 3  subjects.",
                        [
                            "CHEM30012",
                            "CHEM30014",
                            "CHEM30017",
                            "CHEM90006",
                            "CHEM90055",
                            "FOOD90022",
                            "CHEN90041",
                            "CHEN90010"
                        ],
                        "Students may take a different elective subject other than the above optional elective subjects at Course Coordinator approval.",
                        "Research Project",
                        "Students enrolled in the Master of Science (Chemistry) program are required to complete a 125 credit points Research Project.",
                        "The project will be taken over four consecutive semesters (or five semesters for part-time) and will begin on the Monday of semester of entry (semesters 1 or 2) and continue until the end of the fourth semester (or fifth semester for part-time), minus recreation leave of up to 2 weeks per semester over the four semesters (or five semesters for part-time).",
                        "For how long and at what time within the enrolment the actual period of leave is to be taken needs to be negotiated with a student’s supervisor.",
                        "The Research Project will be due for submission by the end of the formal examination period of the fourth semester (or fifth for part-time) of enrolment if an earlier date is not specified.",
                        "The assessment requirements below are applicable to the entire 125 credit points Research Project:",
                        [
                            "Attendance at a safety and induction program with at least a 65% result in a 60 minute safety examination held during the first week (pass/fail)",
                            "A preliminary literature survey and research plan (up to 10 pages of mixed text, diagrams and formulas) due at the end of the first semester of enrolment (pass/fail)",
                            "A project-related oral presentation (up to 25 min), given at the end of the second semester of enrolment (pass/fail)",
                            "A project-related oral presentation (up to 30 min), given at the end of the final semester (10%)",
                            "A major thesis, page limit of 60 pages, due at the end of the final semester (35%)",
                            "An oral exam (viva) on the content of the thesis after submission of the thesis (35%)",
                            "Assessment of research performance based on attendance, application, initiative and demonstrated skills (20%)",
                            "Attendance at a seminar series providing advanced theoretical and/or practical training (hurdle)."
                        ],
                        "Students may enrol in a combination of research project subjects and coursework subjects over their 24 months of full-time study (or 48 months part-time) as long as once the Research Project is commenced, the consecutive enrolment requirement is met. Students must ensure they have completed a total of 125 credit points for the research project by the end of their course.",
                        "Students will first enrol in Chemistry Research Project Pt 1, and then progress through to Pt 2, Pt 3 and Pt 4.",
                        "Note: In the case of part-time course enrolments, students will first enrol in Chemistry Research Project Pt 1, and then progress through to Pt 2, Pt 3, Pt 4 (Cont.) and Pt 5.",
                        "Students may only progress through Chemistry Sciences Research Project subjects upon successful completion of the earlier project component.",
                        "For all course enrolments:",
                        [
                            "CHEM90023",
                            "CHEM90024",
                            "CHEM90025",
                            "CHEM90026"
                        ],
                        [
                            "CHEM90027",
                            "CHEM90028",
                            "CHEM90029",
                            "CHEM90030"
                        ],
                        [
                            "CHEM90031",
                            "CHEM90032",
                            "CHEM90033",
                            "CHEM90034"
                        ],
                        "For full-time course enrolments - Research Project Pt 4:",
                        [
                            "CHEM90035",
                            "CHEM90036",
                            "CHEM90037",
                            "CHEM90038"
                        ],
                        "For part-time course enrolments - Research Project Pt 4 (Cont.) and Pt 5:",
                        [
                            "CHEM90056",
                            "CHEM90057",
                            "CHEM90058",
                            "CHEM90059"
                        ],
                        [
                            "CHEM90060",
                            "CHEM90061",
                            "CHEM90062",
                            "CHEM90063"
                        ]
                    ]
                }
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The Master of Science offers a pathway to a PhD."
    ]
}