{
    "Course name": "Master of Genomics and Health",
    "Course code": "MC-GENOHLT",
    "Overview text": [
        "The Master of Genomics and Health is designed to prepare a workforce that is knowledgeable and skilled in practical, ethical and socially responsible implementation of genomics in health-related, community and policy settings.",
        "The rapid advances in genomics in the last decade are expected to bring about benefits in health care but are not without their challenges in terms of upskilling a workforce that is able to incorporate new ways of thinking about and applying genomics, as well as consideration of ethical and social issues.",
        "This Master of Genomics and Health course is the first course of its kind in Australia and students will engage in discourse around the current and potential impact on health and medicine brought about by these advances in genomics and genomic technologies.",
        "The Master of Genomics and Health will take a blended learning approach to delivery, combining online and face-to-face interactions. It requires completion of a total of 200 points of study and is structured to suit individual needs and study preferences. Students have the option of enrolling in a Master degree (200 points) or enrolling in or exiting with one of the nested awards Graduate Diploma (100 points), Graduate Certificate (50 points).",
        "This course is designed to be available to students at different stages in their careers, including career starters and those who currently work and wish to further their knowledge, skills and qualifications. The coursework responds to students by allowing individual tailoring to find the optimal approach.",
        "Note that the Master of Genomics and Health is not equivalent to a clinical Master of Genetic Counselling and will not fulfil the eligibility requirements by the Human Genetics Society of Australasia to undertake certification in genetic counselling.",
        "Students who wish to transfer at any stage into the Master of Genetic Counselling must meet the course eligibility rules and successfully complete all of the compulsory subjects required for that stage of the Master of Genetic Counselling. This will only occur after approval from the Master of Genetic Counselling Curriculum Committee.",
        "Last updated: 6 May 2024"
    ],
    "Overview table": {
        "Award title": "Master of Genomics and Health",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "096349K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must provide evidence of having completed:a) an undergraduate degree, in a cognate discipline such as Science, Health Sciences, Social Work, Psychology, Medicine, or related discipline, with a weighted average mark of at least H3 (65%) or equivalentandpre-requisite studies with subject marks of at least 65% (H3) in: biology to first year undergraduate level, or equivalent and genetics to second year undergraduate level or equivalentORb) six years of documented relevant work experience in a cognate disciplineandpre-requisite studies with subject marks of at least 65% (H3) in biology to first year undergraduate level, or equivalent and genetics to second year undergraduate level, or equivalentORc) an undergraduate degree in any discipline, or equivalent, with a weighted average mark of at least H3 (65%), or equivalent,andpre-requisite studies with subject marks of at least 65% (H3) in: biology to first year undergraduate level, or equivalent and genetics to second year undergraduate level or equivalentandat least two years of documented relevant work experience in a cognate discipline",
            "AND",
            "All applicants must include a statement of no more than 400 words that explains",
            "Reason(s) for applying for the Master of Genomics and Health including known or proposed career objectives",
            "How their education/background addresses the entry requirements",
            "Applicants must attach relevant biology and genetics subject descriptions to this statement (not included in the word count).",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "relevant work experience; and",
            "the personal statement",
            "3. Short listed applicants will be contacted for interview. The Selection Committee may conduct tests and may call for referee reports or employer references to elucidate any of the matters referred to above. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required.",
            "Notes",
            "Students may choose to exit the course with a Graduate Certificate or Graduate Diploma in Genomics and  Health following successful completion of the first 50 or 100 credit points."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry. The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Genomics and Health will comprise 4 x12.5 pt, 6 x 6.25 pt, and 1 x 37.5 pt (year-long) compulsory subjects, totaling 125 pt AND elective subjects totaling 75 pt.",
                "Electives cluster into the following areas:",
                [
                    "Research methods and project",
                    "Bioinformatics and health informatics",
                    "Biostatistics and epidemiology",
                    "Public health, systems, policy and society",
                    "Health program evaluation",
                    "Economic evaluation",
                    "Science communication"
                ],
                "Important prerequisite information",
                "GENE90001 Human Genetics and Genomics in Healthcare, with a result of at least 70%, is a prerequisite for GENE90002 Clinical Genomics.",
                "GENE90002 Clinical Genomics, with a result of at least 70%, is a prerequisite for XXXX Frontiers in Genomics 1.",
                "XXXX Frontiers in Genomics 1, with a result of at least 70% on Assessment Task 3 (Presentation) is prerequisite for GENE90024 Frontiers in Genomics 2.",
                "GENE90026, Clinical Genome Variant Analysis 1, with a result of a least 70% in a prerequisite for GENE90025.",
                "WELF90004 Principles of Counselling 1, with a result of at least 70%, is a prerequisite for WELF90005 Principles of Counselling 2.",
                "HLTH90014 Healthcare Research-Principles & Design, with a result of least 70%, is a prerequisite for HLTH90011 Research Project in Human Genomics 1.",
                "HLTH90011 Research Project in Human Genomics 1, with a result of at least 70%, is a prerequisite for Research Project in Human Genomics 2."
            ]
        },
        "Compulsory subjects": {
            "overview": [],
            "Year 1": {
                "overview": [
                    [
                        "GENE90026",
                        "GENE90001",
                        "POPH90226",
                        "WELF90004",
                        "HLTH90014",
                        "GENE90002",
                        "WELF90005",
                        "GENE90025"
                    ]
                ]
            },
            "Year 2": {
                "overview": [
                    [
                        "GENE90027",
                        "GENE90024",
                        "HLTH90012"
                    ]
                ]
            }
        },
        "Health Research stream": {
            "overview": [
                "Compulsory subjects, plus:"
            ],
            "Year 1": {
                "overview": [
                    [
                        "HLTH90011"
                    ],
                    "And one elective subject (in Semester 2 / second half of the year)."
                ]
            },
            "Year 2": {
                "overview": [
                    [
                        "HLTH90013"
                    ],
                    "And two elective subjects (one in each semester / half of the year)."
                ]
            }
        },
        "Non-Research stream": {
            "overview": [
                "Compulsory subjects, plus:"
            ],
            "Year 1": {
                "overview": [
                    "Two elective subjects (in Semester 2 / second half of the year)."
                ]
            },
            "Year 2": {
                "overview": [
                    "Four elective subjects (two in each semester / half of the year)."
                ]
            }
        },
        "Electives": {
            "overview": [
                [
                    "POPH90093",
                    "POPH90209",
                    "POPH90231",
                    "SCIE90012",
                    "SCIE90006",
                    "COMP90014",
                    "INFO90001",
                    "ISYS90078",
                    "POPH90111",
                    "POPH90090",
                    "BINF90002",
                    "COMP90016",
                    "ISYS90069",
                    "POPH90013",
                    "POPH90014",
                    "POPH90058",
                    "POPH90217",
                    "POPH90020",
                    "POPH90206",
                    "POPH90095",
                    "POPH90270",
                    "POPH90201",
                    "SCIE90005",
                    "SCIE90013",
                    "POPH90205",
                    "MGMT90031"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}