{
    "Course name": "Master of Urban Horticulture",
    "Course code": "MC-URBHORT",
    "Overview text": [
        "The Master of Urban Horticulture (Coursework) was developed specifically for those seeking professional employment or developing research careers in urban horticulture and landscape management. There is a focus on the design, implementation and management of urban landscapes. Employment opportunities can be found in a variety of settings including arboricultural services and tree management, urban parks and public open space, revegetation and restoration, residential landscape design, landscape and asset management, landscape construction and services and in nursery and greenhouse management. Upon completion of the course students can progress to PhD studies at the University of Melbourne. Whilst it is beneficial for students to have some experience in the horticultural industry it is not essential to have previous employment to gain entry to the course. There are different pathways for students depending on the previous studies completed. The course has excellent linkages and contacts to the urban horticulture industry, adding to the currency and relevancy of the study experience, but also building employment opportunities for the future.",
        "The Master of Urban Horticulture is a graduate coursework program of 200 points completed over two years of full-time study or part-time equivalent. Offered primarily at the Burnley and Parkville campuses subjects are offered using semester long, intensive or online delivery modes to give students flexibility. Core studies are completed in the areas of plant production and establishment, horticultural science, urban soil and vegetation and landscape management as well as science and business tools subjects. Discipline electives include social and therapeutic horticulture, urban food production, garden design, urban tree management and green infrastructure subjects as well as a research project. Elective subjects to complement your degree are available from across the university.",
        "Note: Graduates of the Graduate Diploma or Graduate Certificate in Urban Horticulture may apply for up to 100 points credit into the Masters program."
    ],
    "Overview table": {
        "Award title": "Master of Urban Horticulture",
        "Year & campus": "2024— Burnley",
        "CRICOS code": "061121G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "• an undergraduate degree or a graduate or postgraduate certificate any discipline with at least an H3 (65%) weighted average, or equivalent;",
            "OR",
            "• an honours degree, graduate diploma or postgraduate diploma in any discipline, or equivalent;",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:• prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. The minimum English language requirements for this course are Band 6.5."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Science welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to make reasonable adjustments so as to enable the student’s participation in the Faculty's programs. The Faculty of Science contributes to the New Generation degrees and offers a broad range of programs across undergraduate and post-graduate levels many of which adopt a multi-disciplinary approach.",
            "Students of the Faculty's courses must possess intellectual, ethical, and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the Faculty. Candidates must have abilities and skills in observation; motor in relevant areas; communication; in conceptual, integrative, and quantitative dimensions; and in behavioural and social dimensions.",
            "Adjustments can be provided to minimise the impact of a disability, however students need to be able to participate in the program in an independent manner and with regard to their safety and the safety of others.",
            "I. Observation:In some contexts, the student must be able to observe demonstrations and experiments in the basic and applied sciences. More broadly, observation requires reading text, diagrams, maps, drawings and numerical data. The candidate should be able to observe details at a number of scales and record useful observations in discipline dependant contexts.",
            "II. Communication:A candidate should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. A candidate must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.",
            "III. Motor:Candidates should have sufficient motor function necessary for participation in the inherent discipline-related activities. The practical work, design work, field work, diagnostic procedures, laboratory tests, require varying motor movement abilities. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments.",
            "IV. Intellectual-Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving, the critical skill demanded of professionals in land and environment industries, requires all of these intellectual abilities. In addition, the candidate should be able to comprehend three-dimensional relationships and to understand the spatial relationships of structures.",
            "V. Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel their disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                [
                    "HORT90033",
                    "HORT90008",
                    "HORT90004",
                    "ERTH90028",
                    "HORT90039",
                    "HORT90044",
                    "ABPL90337",
                    "HORT90048"
                ]
            ]
        },
        "Professional Skills": {
            "overview": [
                [
                    "SCIE90027",
                    "SCIE90017",
                    "ENST90045",
                    "SCIE90012"
                ]
            ]
        },
        "Discipline Electives": {
            "overview": [
                [
                    "EVSC30006",
                    "FRST30003",
                    "ENST30003",
                    "NRMT90003",
                    "AGRI90075",
                    "HORT90034",
                    "HORT90035",
                    "HORT90011",
                    "HORT90046",
                    "HORT90038",
                    "HORT90041",
                    "HORT90042",
                    "EVSC90025",
                    "FRST90076",
                    "FRST90077",
                    "FRST90034",
                    "FRST90015",
                    "BOTA90005",
                    "ENST90043",
                    "NRMT90007",
                    "FRST90032",
                    "FRST90033"
                ],
                "Note:EVSC30003, FRST30003 AND ENST30003 can only be completed in the first 100 points of study in the Master of Urban Horticulture. Onlytwoof these subjects (a maximum of 25 points) can be completed."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Upon completion of the course students may be able to apply to progress to PhD studies at the University of Melbourne. There are different pathways for students depending on the previous studies completed. The course has excellent linkages and contacts to the urban horticulture industry, adding to the currency and relevancy of the study experience, but also building employment opportunities for the future."
    ]
}