{
    "Course name": "Master of Finance",
    "Course code": "MC-FINANCE",
    "Overview text": [
        "The Master of Finance is designed for students with a Bachelor of Commerce, or equivalent, with extensive previous finance studies to undertake a broader and more comprehensive training in finance than is feasible within an undergraduate degree. The course aims to equip graduates with the necessary technical skills and knowledge for a professional career in a finance industry characterised by increasing complexity and change.  The course will cover advanced material on financial markets and financial decision making which is academically rigorous, practically orientated and globally relevant.",
        "Last updated: 29 August 2024"
    ],
    "Overview table": {
        "Award title": "Master of Finance",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "0100876",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in a relevant discipline, or equivalent with studies (12.5 points each) in Accounting (level 1), Corporate Finance (level 2), Investments (level 3) and Derivatives (level 3) or their equivalents:",
            "a personal statement outlining why they wish to be considered for the course; and",
            "the Graduate Management Admissions Test (GMAT) or Graduate Record Examination (GRE) unless the applicant has completed an undergraduate degree in Australia or New Zealand or met one of the approved conditions for GMAT or GRE exemption.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the GMAT or GRE score unless the applicant has completed an undergraduate degree in Australia or New Zealand or met one of the approved conditions for GMAT or GRE exemption; and",
            "the personal statement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required overall (writing band no less than 6.5, other bands no less than 6.0).Note: Students who discontinue from the Master of Finance but have successfully completed 100 points of the Master of Finance including completion of the four compulsory subjects, will be eligible to receive the Graduate Diploma in Finance as an exit award.",
            "1.In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree with a major in finance, or with a major sequence in Finance, which includes the following subjects: Financial Accounting, Corporate Finance, Investments and Derivative Securities or equivalent.",
            "the Graduate Management Admissions Test (GMAT) or Graduate Record Examination (GRE) unless the applicant has completed an undergraduate degree in Australia or New Zealand or met one of the approved conditions for GMAT or GRE exemption.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the GMAT or GRE score unless the applicant has completed an undergraduate degree in Australia or New Zealand or met one of the approved conditions for GMAT or GRE exemption.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required (with no individual band less than 6.5)Notes:",
            "1. To meet prior study requirements, students must have completed, as part of their undergraduate studies, the following subjects: Financial Accounting (ACCT10002), Corporate Finance (FNCE20005), Investments (FNCE30001) and Derivative Securities (FNCE30007) or equivalent.  ",
            "2.  Applicants without a prior degree majoring in Finance will be excluded from entry to this degree.  Subject to meeting entry requirements, applicants are encouraged to apply for the Master of Management (Finance)\n",
            "3. Students who discontinue from the Master of Finance but have successfully completed 100 points of the Master of Finance, including the completion of the four compulsory subjects, will be eligible to receive the Graduate Diploma in Finance as an exit award."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Finance requires successful completion of 150 points which includes four compulsory subjects, at least four core subjects and two capstone subjects. The course can be taken over three semesters of full-time study (or six semesters of part-time study). The first semester of study comprises the four compulsory subjects. The capstone subjects are usually taken in the second and third semesters of study."
            ]
        },
        "Semester 1": {
            "overview": [
                "(50 credit points)",
                "Students must complete the following fourcompulsory subjects:",
                [
                    "ECON90033",
                    "ECON90034",
                    "ACCT90002",
                    "FNCE90047"
                ]
            ]
        },
        "Semesters 2 & 3": {
            "overview": [
                "(50 credit points each semester)",
                "Students must complete at least four of the followingfinance subjects:",
                [
                    "FNCE90012",
                    "FNCE90084",
                    "FNCE90080",
                    "FNCE90083",
                    "FNCE90082",
                    "FNCE90057",
                    "FNCE90081"
                ],
                "Students must complete the following twocapstone subjects:",
                [
                    "FNCE90085",
                    "FNCE90013"
                ],
                "Students may choose up to two of the followingelective subjects:",
                [
                    "FNCE90016",
                    "FNCE90046",
                    "FNCE90048",
                    "FNCE90049",
                    "FNCE90064",
                    "BUSA90473",
                    "BUSA90485",
                    "MGMT90146",
                    "ECON90010",
                    "BUSA90525",
                    "FNCE90086",
                    "FNCE90087"
                ],
                "Or any other subject consistent with the course learning outcomes, as approved by the Program Director."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}