{
    "Course name": "Master of Evaluation",
    "Course code": "MR-EVAL",
    "Overview text": [
        "The Master of Evaluation-Research is a program of professional qualification catering for the needs of those who wish to take a leadership role in evaluation theory, method, and practice local, national and international levels. Candidates in the course include policy and program planners, trainers, teachers, performance auditors internal monitoring and evaluation staff, health professionals project staff, managers, and independent consultants. They are drawn from the public sector, non-government agencies, and business in areas such as education, welfare, and health.",
        "The course aims to enable candidates to become familiar with theories underlying policy and program development, the roles of various types of evaluation as well as key concepts and approaches to evaluation. The Master of Evaluation-Research seeks to develop thought leaders in evaluation who critically review important issues in the design, conduct and use of evaluation."
    ],
    "Overview table": {
        "Award title": "Master of Evaluation",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "9",
        "Duration": "2 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a bachelor honours degree or equivalent in a cognate area; or",
            "a three-year undergraduate qualification and at least 50 credit points, or equivalent, of graduate study in a cognate area; or",
            "a three-year undergraduate qualification in a cognate area and at least two years of documented, relevant work experience;",
            "and",
            "a one page CV or resume; and",
            "a personal statement, of up to 400 words, outlining why they wish to be considered for the course and summarising relevant prior study and work experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the personal statement; and",
            "the CV or resume; and if relevant",
            "the professional experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the University’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne Graduate School of Education welcomes applications from students with disabilities. It is University and Graduate School policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Graduate School’s programs.The core participation requirements for study in the Melbourne Graduate School of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching.",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Evaluation (MR-EVAL) is a research classified course of 150 points (typically 4 subjects and a thesis) and is taken over 18 months full time study or part-time equivalent.",
                "Students in the Master of Evaluation (MR-EVAL) complete",
                [
                    "Two compulsory subjects being EDUC90850 Foundations of Evaluation and EDUC90848 Applied Research for Evaluation",
                    "One research methodology module being either EDUC90716 Qualitative Methods for Evaluation or EDUC90717 Mixed Methods Research & Evaluation or EDUC90729 Conducting Educational Research or MAST90078 Quantitative Methods for Evaluation (12.5 points each)",
                    "12.5 points of elective subjects",
                    "a 20,000 word thesis"
                ],
                "Students in the Master of Evaluation (MR-EVAL) must achieve an H2A (75% average) in the coursework component to proceed to the thesis. The Master of Evaluation is located at Level 9 of the Australian Qualifications Framework.",
                "Information on the 100 point coursework-classified Master of Evaluation (MC-EVAL and MC-EVALO) is available here:https://handbook.unimelb.edu.au/view/current/MC-EVALandhttps://handbook.unimelb.edu.au/view/current/MC-EVALO"
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Compulsory subjects": {
            "overview": [
                [
                    "EDUC90848",
                    "EDUC90850"
                ]
            ]
        },
        "Research methodology module": {
            "overview": [
                "Students select one of the research methodology modules from the following list:",
                [
                    "EDUC90716",
                    "EDUC90717",
                    "EDUC90729",
                    "MAST90078"
                ]
            ]
        },
        "Elective subjects": {
            "overview": [
                "Students undertake 12.5 points of electives from the following list:",
                [
                    "EDUC90716",
                    "EDUC90799",
                    "EDUC90933",
                    "EDUC90934",
                    "EDUC90935",
                    "EDUC90747",
                    "EDUC90717",
                    "MAST90078",
                    "EDUC90715",
                    "EDUC90719",
                    "EDUC90847",
                    "EDUC90849",
                    "EDUC90851"
                ]
            ]
        },
        "Thesis": {
            "overview": [
                "Detailed information on the thesis is available atGraduate Research Hub",
                "Students select one of the following thesis subjects:",
                [
                    "EDUC90356"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates from this program are eligible to apply for entry to the Doctor of Education program or a PhD provided they meet the entry requirements and subject to achievement of an H2A GPA."
    ]
}