{
    "Course name": "Master of Art Curatorship",
    "Course code": "038AB",
    "Overview text": [
        "The Master of Art Curatorship introduces students to key concepts in art curatorship and equips them for a career in the art museum and gallery world. Students will gain a deep understanding of the changing contexts in which the art curatorial profession operates, such as globalisation and decolonisation, new curatorial innovations, shifts in art and art museums, and the impact of new technologies on art museums, art galleries and professional practice. The program delivers subjects in the key areas of museum theory and practice, art collection management and conservation, and the interpretation and curating of exhibitions, together with challenging analytical content that assists graduates to participate in the ethical, political and philosophical dimensions of curating art in an international context. Students have the opportunity to do an industry internship as part of their studies. Students also have the option to undertake a research thesis that can provide a pathway to PhD study."
    ],
    "Overview table": {
        "Award title": "Master of Art Curatorship",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "027565G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree, or equivalent, including at least 50 credit points at second year level or above in subjects requiring written and analytical assessment, with a weighted average mark of at least H2B (70%), or equivalent.",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "relevance of previous studies.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note:",
            "Applicants with the following may be awarded up to 50 points of credit:",
            "an undergraduate degree in a cognate discipline, with a weighted average mark of at least H2B (70%); or equivalent;",
            "Applicants with the following may be awarded up to 100 points of credit:",
            "an Honours degree in a cognate discipline with a weighted average mark of at least H2B (70%), or equivalent ; or",
            "an undergraduate degree in a cognate discipline with a weighted average mark of at least H2B (70%), or equivalent, and at least two years documented relevant work and/or professional experience."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students are required to complete the program requirements/structure from the year that they commenced their program. All compulsory and capstone subjects must be completed to be eligible to graduate from the program.  Capstone subjects must be completed in the final hundred points of the program.  All students are required to complete one Capstone subject option (at least 25 points).  This requirement cannot be waived or replaced in any circumstances.",
                "200 point program",
                "Duration:2 years full-time / up to 4 years part-time",
                [
                    "Foundation Elective Subjects (50 points)",
                    "Compulsory subjects (50 points)",
                    "Capstone subjects (25 points or 50 points for the minor thesis option)",
                    "Elective subjects (75 points or 50 points for the minor thesis option)"
                ],
                "150 point program",
                "Duration:1.5 years full-time / up to 3 years part-time",
                [
                    "Compulsory subjects (50 points)",
                    "Capstone subjects (25 points or 50 points for the minor thesis option) ",
                    "Elective Subjects (75 points or 50 points for the minor thesis option)"
                ],
                "100 point program",
                "Duration:1 year full-time / up to 2 years part-time",
                [
                    "Compulsory subjects (50 points)",
                    "Capstone subjects (25 points or 50 points for the minor thesis option)",
                    "Elective subjects (25 points, or 0 points for the minor thesis option)"
                ],
                "For policies that govern this degree, seeAcademic Services Policyin theUniversity Melbourne Policy Framework. Students also should also refer to information in theStudent Policy Directory."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who complete the thesis option may be eligible to undertake a PhD or Masters by Research program."
    ]
}