{
    "Course name": "Master of Applied Linguistics",
    "Course code": "MC-APLING",
    "Overview text": [
        "Applied linguists possess specialised expertise in language and communication, which is highly valued across a range of professions in Australia and internationally. Linguistics at the University of Melbourne is ranked 22 in the world (QS World University Rankings 2019), and the Master of Applied Linguistics provides world class training and an internationally recognised professional qualification in one of three core specialisation areas: Teaching English to Speakers of Other Languages (TESOL), language testing and English language.",
        "Our Master of Applied Linguistics program provides a robust theoretical and practical foundation for graduates who are working or seeking to work in these areas, as well as in related fields of second language learning and teaching, interpreting and translating, language policy and planning, and speech pathology. As part of the program, students develop core intercultural and professional communication skills and expertise in applying linguistics to real world problems, such as language curriculum design and program evaluation relevant to diverse educational contexts.",
        "This is a coursework degree program with an optional research component, and high‐achieving students who complete a Minor Thesis may qualify for entry toMaster of Arts by Research(MA), or Doctor of Philosophy (PhD).",
        "This course is taught in both online and on campus study modes. The online option is not available to international students who are holders of an Australian student visa, for study onshore in Australia.  The online option is available to all other international students to study wholly online. This option involves self-directed learning using instructions and resources provided in the LMS, and participation in online discussions and tasks as directed by the subject coordinator. There is no class attendance in the online option.",
        "Please note: the 200-point Master of Applied Linguistics program in all specialisations is only available to on-campus students."
    ],
    "Overview table": {
        "Award title": "Master of Applied Linguistics",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "077928D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 24 months full-time or 48 months part-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline with a weighted average mark of at least H2B (70%), or equivalent.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "relevance of previous studies; and, if relevant",
            "the professional experience",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. The minimumEnglish language requirementfor this course is IELTS Band 6.5 on average with no band below 6.0.Applicants with the following may be awarded up to 50 points of credit:",
            "an undergraduate degree in a cognate discipline with a weighted average mark of at least an H2B (70%), or equivalent.",
            "Applicants with the following may be awarded up to 100 points of credit:",
            "an honours degree in a cognate discipline with a weighted average mark of at least an H2B (70%), or equivalent; or",
            "an undergraduate degree in a cognate discipline with a weighted average mark of at least H2B (70%), or equivalent, and at least two years of documented, relevant work experience.",
            "Applicants must provide the following documentation in support of their application for the recognition of prior professional experience:",
            "brief curriculum vitae, detailing work experience;",
            "contact details of two referees;",
            "a covering letter outlining the applicants professional background and how this prepares them to successfully undertake the program.",
            "In some cases, an interview and/or two reference letters from employers/managers detailing the period of employment and areas of responsibility, and/or evidence of written work or reports undertaken during the period of employment may be requested."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Applied Linguistics has three entry point programs: 200-point (two years full-time/up to four years part-time), 150-point (one and a half years full-time/up to three years part-time) and 100-point (one year full-time/up to two years part-time) programs.",
                "Completion of one specialisation is required.",
                "Please refer to individual Specialisations.",
                "All required compulsory, foundation core selective and capstone subjects for your specialisation and entry point must be completed to be eligible to graduate from the program.",
                "Capstone Requirement:",
                "Capstone subject options must be completed in the final hundred points of the program. All students are required to complete one Capstone subject option (25 points). This requirement cannot be waived or replaced in any circumstances:",
                "Capstone Stream 1: LING90010 Minor thesis (25 points)",
                "Purpose: an opportunity to integrate knowledge and research skills within the English Language specialisationorthe TESOL specialisationorthe Language Testing specialisation",
                "Capstone Stream 2: LING90041 Projects in Applied Linguistics (25 points)",
                "Purpose: an opportunity to integrate knowledge and skills from chosen specialisations: the English Languageorthe TESOLorthe Language Testing to real-world projects",
                "Melbourne Policy Library",
                "For policies that govern this degree, see the Courses, Subjects, Awards and Programs Policy in the University Melbourne Policy Library:",
                "https://policy.unimelb.edu.au/MPF1327/#section-4.15",
                "Students also should also refer to information in the Enrolment and Timetabling Policy:",
                "https://policy.unimelb.edu.au/MPF1294/#section-4.1"
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who complete the thesis option may be eligible to undertake a PhD or Masters by Research program."
    ]
}