{
    "Course name": "Master of Information Technology",
    "Course code": "MC-IT",
    "Overview text": [
        "The Master of Information Technology (MIT) is a200-point,150-point and 100-point programfor those interested in a career in technical IT.",
        "The key aspects of the course are:"
    ],
    "Overview table": {
        "Award title": "Master of Information Technology",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "077475F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "Undergraduate degree in any discipline with a weighted average mark of at least H3 (65%), or equivalent, and one technical subject focused on computer programming (taken at any tertiary year level).",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 6.5is required.",
            "Note:",
            "Applicants with the following may be awarded up to 50 points of credit:",
            "- A three-year undergraduate degree with a major in Computer Science, Information Technology, Software Engineering or related discipline, with a weighted average mark of at least H3 (65%) or equivalent.",
            "Applicants with the following may be awarded up to 100 points of credit:",
            "- A four-year undergraduate degree with a major in Computer Science, Information Technology, Software Engineering or related discipline, with a weighted average mark of at least H3 (65%) or equivalent, and either:",
            "(a) Studies in the area of specialization at an advanced undergraduate level or higher, or(b) Two years of documented relevant work experience in the area of specialisation.For more information on meeting the University's English language requirements, see:http://futurestudents.unimelb.edu.au/info/international/english_and_foundation_programs",
            "The University of Melbourne offers Graduate Degree Packages to high achieving school leavers, allowing them to secure places (Commonwealth Supported Places for domestic students or International fee places) in the Master of Information Technology provided that they meet certain requirements.",
            "For a Commonwealth Supported Place or an International Fee Place, the applicant must:",
            "achieve an ATAR of at least 95.00 in the final year of schooling in Australia;",
            "successfully complete a Bachelor of Commerce, Bachelor of Design or Bachelor of Science at the University of Melbourne including the specified prerequisite subject; and",
            "commence the Master of Information Technology within five (5) years of commencing their undergraduate degree",
            "Applicants should refer to the University handbook for the additional entry requirements for the undergraduate degrees in the Graduate Degree Packages."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Master of Information Technology welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the degree.",
            "The Master of Information Technology requires all students to enrol in subjects where they will require:",
            "The ability to comprehend complex theory and technology-related information",
            "The ability to clearly and independently communicate a knowledge and application of theory, and technology principles and practices during assessment tasks",
            "The ability to actively and safely contribute in IT development and management activities",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "There may be additional inherent academic requirements for some subjects, and these requirements are listed within the description of the requirements for each of these subjects.",
            "Students who feel their disability will impact on meeting this requirement are encouraged to discuss this matter with the relevant Subject Coordinator and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Computer Society",
            "Accredited by the Australian Computer Society."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Information Technology provides 200-point, 150-point and 100-point entry point programs.",
                "Completion of one specialisation is required.",
                "200-point program",
                "Students must complete 200 points, made up of 50 points of Foundation subjects, 50 points of Specialisation subjects and 100 points of Advanced Specialisation subjects (both based on the specialisation the student is enrolled in).",
                "150-point program",
                "Students must complete 150 points, made up of 50 points of Specialisation subjects and 100 points of Advanced Specialisation subjects (both based on the specialisation the student is enrolled in).",
                "100-point program",
                "Students must complete 100 points comprising of Core, Specialisation Selective and Advanced Specialisation Elective subjects."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a wide range of other graduate coursework degrees as well as research higher degree programs, including the Doctor of Philosophy."
    ]
}