{
    "Course name": "Master of Science (Bioinformatics)",
    "Course code": "MC-SCIBIF",
    "Overview text": [
        "The Master of Science (Bioinformatics) is a coursework masters degree incorporating a research project.",
        "The degree provides a broad education in bioinformatics, with strong foundations in computer science. You will undertake independent research in bioinformatics with the potential to progress to a PhD."
    ],
    "Overview table": {
        "Award title": "Master of Science (Bioinformatics)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "094592D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must havecompleted:",
            "an undergraduate degree major in Biology and Biomedicine; Mathematics and Statistics; or Computer Science, and",
            "a weighted average mark of at least H3(65%) in the best 50 points in that major or relevant discipline studies at third year; and",
            "completion of MAST10005 Calculus 1 or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note:",
            "Quotas may be applied and preference may be given to applicants with evidence of appropriate preparation or potential to undertake research.",
            "Entry into this stream of the Master of Science (Bioinformatics) is subject to the capacity of the department(s) or school(s) to provide adequate supervision in a research project appropriate to the interests and preparation of the individual student and may be subject to the agreement of a member of academic staff to supervise the project module"
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry. The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Completion of one entry point program is required.",
                "Master of Science (Bioinformatics) has two entry point programs: 200pt Program and 150pt Program (Bioinformatics cognate pathway).",
                "Exemptions will be granted for students who have completed equivalent subjects in their undergraduate studies. Students who meet subject equivalency criteria will take additional elective subjects to accomplish the course in a total of 200 or 150 credit points (Biology, Maths and Computer Science entry streams – 200 points; Bioinformatics major entry stream – 150 points).",
                "Students undertaking the Master of Science (Bioinformatics) 200pt Program will complete:",
                [
                    "Discipline subjects (137.5 points) including compulsory subjects listed for each specialisation plus general electives",
                    "Research Project subjects (50 points), commencing in Semester 2",
                    "Professional Skills subject (12.5 points)"
                ],
                "Students undertaking the Master of Science (Bioinformatics) 150pt Program - Bioinformatics cognate pathway will complete:",
                [
                    "Discipline subjects (87.5 points), including compulsory bioinformatics subjects plus general electives",
                    "Research Project subjects (50 points), commencing in Semester 2",
                    "Professional Skills subject (12.5 points)"
                ],
                "* Exemptions will be granted for students who have completed equivalent subjects in their undergraduate studies. Students who meet subject equivalency criteria will take additional elective subjects to achieve the requirements of the 150pt Program in the course."
            ],
            "Subject options": {
                "overview": []
            },
            "First year": {
                "overview": []
            },
            "First year Core Coursework - Biology/Biomedicine stream (for students with a biology /biomedicine background)": {
                "overview": [],
                "Students must take:": {
                    "overview": [
                        [
                            "BINF90002",
                            "COMP90038",
                            "COMP90059"
                        ],
                        "Note: Completing COMP90059 meets the prerequisite for COMP90038"
                    ]
                },
                "and one of:": {
                    "overview": [
                        [
                            "MAST20005",
                            "MAST90058"
                        ],
                        "Elective subjects",
                        "Students must take two 12.5-point Year 1 elective subjects (see electives list below)."
                    ]
                }
            },
            "First year Core Coursework - Mathematics/Statistics stream (for students with a mathematics and statistics background)": {
                "overview": [],
                "Students must take:": {
                    "overview": [
                        [
                            "BINF90002",
                            "CEDB20003",
                            "COMP90038",
                            "COMP90059",
                            "GENE20001",
                            "PHYS20008"
                        ],
                        "Elective subjects",
                        "Student must take one 12.5-point Year 1 elective subject (see electives list below)."
                    ]
                }
            },
            "First year Core Coursework - Computer Science stream (for students with a computing background)": {
                "overview": [],
                "Students must take:": {
                    "overview": [
                        [
                            "BINF90002",
                            "CEDB20003",
                            "GENE20001",
                            "PHYS20008"
                        ]
                    ]
                },
                "and one of:": {
                    "overview": [
                        [
                            "MAST20005",
                            "MAST90058"
                        ],
                        "Elective subjects",
                        "Student must take one 12.5-point Year 1 elective subject (see electives list below)."
                    ]
                }
            },
            "Year 1 electives": {
                "overview": [
                    [
                        "COMP90050",
                        "BTCH90005",
                        "MAST90125",
                        "PSYC20006",
                        "SCIE90026",
                        "POPH90013",
                        "BTCH30003",
                        "MAST10006",
                        "BCMB30004",
                        "INFO90002",
                        "ISYS90086",
                        "COMP90048",
                        "INFO90003",
                        "ISYS90069",
                        "COMP20008",
                        "POPH90014",
                        "FOOD90008",
                        "COMP90007",
                        "COMP90049",
                        "HLTH90021",
                        "MAST90101",
                        "MIIM30003",
                        "PSYC10003",
                        "PSYC10004",
                        "PSYC90098",
                        "COMP90089",
                        "MIIM20001",
                        "COMP90041",
                        "POPH90144",
                        "COMP90044",
                        "SCIE90017",
                        "POPH90226",
                        "MAST90007",
                        "COMP90051",
                        "MAST90139"
                    ],
                    "If a student wishes to take another 12.5pt subject that is not listed within the elective list, and for which they have satisfied the prerequisite requirements for, they may consult with the Course Coordinator to request approval to enrol."
                ]
            },
            "Second year - all streams": {
                "overview": [],
                "Students must take:": {
                    "overview": [
                        [
                            "BINF90001",
                            "BINF90004",
                            "COMP90014",
                            "SCIE90013"
                        ]
                    ]
                },
                "and one of the following subjects:": {
                    "overview": [
                        [
                            "BTCH90009",
                            "COMP90016"
                        ],
                        "Note: SCIE90013 should not commence until the Research Project has begun."
                    ]
                }
            },
            "Research project": {
                "overview": [
                    "All students undertake a research project for a total of 50 points. The research project comprises of a series of two, three or four consecutive subjects commencing in the first or second semester of enrolment. The following research project structures are possible. Students will determine which stream they follow in consultation with the project coordinator."
                ],
                "Stream A": {
                    "overview": [
                        [
                            "BINF90008",
                            "BINF90009",
                            "BINF90010"
                        ]
                    ]
                },
                "Stream B": {
                    "overview": [
                        [
                            "BINF90008",
                            "BINF90009",
                            "BINF90011",
                            "BINF90012"
                        ]
                    ]
                },
                "Stream C": {
                    "overview": [
                        [
                            "BINF90013",
                            "BINF90014"
                        ]
                    ]
                }
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The Master of Science offers a pathway to a PhD."
    ]
}