{
    "Course name": "Master of Theatre (Directing)",
    "Course code": "MC-THTRDIR",
    "Overview text": [
        "The Master of Theatre (Directing) focuses on developing the collaborative creative skills, reflective processes, leadership attributes and industry knowhow of directors for performance in the broadest sense of the term, including text-based theatre, new writing, devised work, live art and community and cultural development. Students will develop their potential as artistic leaders, attaining in-depth knowledge of their practice as a director, artist, performance-maker, collaborator and researcher.",
        "The course is built upon core principles of: intellectual rigour, commitment to craft, artistic inquiry and self-reflection, ethical practices, interdisciplinarity and artform innovation.",
        "During the course, students will experience a wide range of collaboration and leadership roles with students from disciplines within the VCA such as design, acting, production, playwriting, dramaturgy, musical composition, film and dance, as well as a range of creative encounters with local, national and international artists, organisations and communities.",
        "The course offers a balance of theory and practice organised to allow for a progression from the intensively-taught, skills-based, first year to a more independent, project-orientated second year which culminates in an independent, practice-led research performance project or written dissertation. The course facilitates international training and research experiences through industry placements in the second year of the course.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Master of Theatre (Directing)",
        "Year & campus": "2024— Southbank",
        "CRICOS code": "085432F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applications must have completed either:",
            "• an undergraduate degree in a relevant discipline (such as the performing arts, music, visual arts, film, dance and digital arts), or equivalent; or",
            "• an undergraduate degree in a cognate discipline (such as social sciences, architecture, landscape, computer science, cultural studies, applied sciences or international development fields), or equivalent; or",
            "• an honours degree, or equivalent, in a relevant discipline, with a weighted average mark of at least H2B (70%) across the honours year; or",
            "• at least six years of documented professional practice in the creative arts industry.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "• prior academic performance or professional experience; and",
            "• an artistic statement which may include written and visual elements; and",
            "• an interview/observing practice (for short-listed applicants only).",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required.",
            "Note. Applicants with the following may be awarded up to 100 points of credit:",
            "• an Honours degree in a relevant discipline, with a weighted average mark of at least H2B (70%) across the Honours year, or equivalent."
        ],
        "Inherent requirements (core participation requirements)": [
            "Participants should possess and/or display potential to develop:",
            "Skills in the creative arts: performing arts, circus, graphic design, digital media arts, music, painting, sculpture, etc.",
            "Competencies in applying tools & techniques in imaginative play, lateral thinking, interpersonal & intrapersonal skills, social creativity, emotional & multiple intelligence methods",
            "Commitment to an intense praxis study model that encompasses research and practice",
            "Behavioural and Social Attributes:",
            "Students must possess behavioural and social attributes that enable them to participate in a complex learning environment.",
            "Students must take full responsibility for their own participation and learning.",
            "Students also contribute to the learning of other students in collaborative environments and must therefore demonstrate a wide range of interpersonal skills, which consider the needs of other students. Assessment will include the outcomes of tasks completed in collaboration with other students.",
            "Disability:",
            "Students who have a disability which may prevent them from participating in tasks involving these inherent academic requirements are encouraged to contact the Disability Liaison Unit:  Adjustments can be provided to minimise the impact of a disability; however, students will need to participate in the course in an independent manner."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "200-point program of compulsory subjects"
            ],
            "Year 1": {
                "overview": [
                    [
                        "DRAM90020",
                        "DRAM90010",
                        "DRAM90019",
                        "DRAM90022",
                        "DRAM90012",
                        "DRAM90021",
                        "THTR90009"
                    ]
                ]
            },
            "Year 2": {
                "overview": [
                    [
                        "DRAM90016",
                        "DRAM90018",
                        "DRAM90017"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}