{
    "Course name": "Master of Genetic Counselling",
    "Course code": "MC-GENCOUN",
    "Overview text": [
        "Genetic counsellors are employed across many healthcare settings, often working as part of a multidisciplinary team with clinical geneticists, nurses, social workers, dietitians and other health professionals. Genetic counselling is defined as:",
        "“The process of helping people understand and adapt to the medical, psychological and familial implications of genetic contributions to disease. This process integrates the following:",
        "Resta,R; Biesecker,B.B; Bennett, R.L et al. Journal of Genetic Counseling (2006) 15:77 doi:10.1007/s10897-005-9014-3",
        "In Australasia, a professional qualification in genetic counselling is a two-part process:",
        "The Master of Genetic Counselling (MC-GENCOUN) program in the Department of Paediatrics at The University of Melbourne fulfils the requirements for academic training. Successful completion of the MC-GENCOUN is the entry point to become an Associate Genetic Counsellor following individual approval from The Human Genetics Society of Australasia (HGSA) Board of Censors (BOC) for Genetic Counselling.",
        "AND",
        "Associate genetic counsellors are required to have a minimum of one year full time equivalent on-the-job training in paid employment after which they are eligible to submit professional portfolios to qualify as a certified genetic counsellor. This process, involving a number of submissions, may take up to 5 years.",
        "For further information and the training guidelines –see the HGSA websitehttp://www.hgsa.org.au",
        "The MC-GENCOUN program is designed to develop a range of relevant skills and competencies across clinical practice and research. Assessment tasks mirror the skills needed in genetic counselling practice and for professional certification. Students must achieve 70% in all subjects to progress to the second year of the course. Students who pass the first 100 credit points but do not achieve the marks necessary to progress will be given the opportunity to exit with a Graduate Diploma award. Note, this Graduate Diploma is not accredited by the Human Genetics Society of Australasia and will not enable practice as a Genetic Counsellor.",
        "The MC-GENCOUN program has close associations with clinical genetics services across Victoria, interstate and overseas. Content is delivered using a range of learning modalities web based activities and tutorials within the University of Melbourne Academic Centre at the Royal Children’s Hospital in Parkville. Teaching faculty include genetic counsellors, medical specialists including clinical geneticists, scientists, patients and community members.",
        "The MC-GENCOUN program has well established links to international training programs. Overseas clinical placement opportunities are available to students in second year in addition to local and interstate placements. Past graduates are employed throughout Australia and in many countries overseas including New Zealand, England, Canada, Singapore and Malaysia.",
        "Last updated: 10 November 2023"
    ],
    "Overview table": {
        "Award title": "Master of Genetic Counselling",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "061969D",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must provide evidence of having completed:",
            "1. \nan undergraduate degree preferably in a cognate discipline such as Science, Health Sciences, Social Work, Nursing, Psychology, Medicine or related discipline, with a weighted average mark of at least 65% or equivalent; \n",
            "2. an undergraduate degree preferably in a cognate discipline such as Science, Health Sciences, Social Work, Nursing, Psychology, Medicine or related discipline, with a weighted average mark of at least 65% or equivalent; ",
            "an undergraduate degree preferably in a cognate discipline such as Science, Health Sciences, Social Work, Nursing, Psychology, Medicine or related discipline, with a weighted average mark of at least 65% or equivalent; ",
            "AND",
            "1. \nevidence of at least one first year undergraduate biology subject and at least one second year undergraduate genetics subject (preferably human genetics), completed in the last 10 years and with subject marks of at least 65%, or equivalent. Applicants should attach relevant biology and genetics subject descriptions (in English) to their application.\n",
            "2. evidence of at least one first year undergraduate biology subject and at least one second year undergraduate genetics subject (preferably human genetics), completed in the last 10 years and with subject marks of at least 65%, or equivalent. Applicants should attach relevant biology and genetics subject descriptions (in English) to their application.",
            "evidence of at least one first year undergraduate biology subject and at least one second year undergraduate genetics subject (preferably human genetics), completed in the last 10 years and with subject marks of at least 65%, or equivalent. Applicants should attach relevant biology and genetics subject descriptions (in English) to their application.",
            "AND",
            "1. \nrelevant voluntary/professional work experience (minimum 6 months) in providing peer/counselling support to others at times of need or crisis;\n",
            "2. relevant voluntary/professional work experience (minimum 6 months) in providing peer/counselling support to others at times of need or crisis;",
            "relevant voluntary/professional work experience (minimum 6 months) in providing peer/counselling support to others at times of need or crisis;",
            "AND",
            "1. \nup to three written, signed and dated references to attest to volunteer/work experience and ability including the duration and nature of the work (proforma available)\n",
            "2. up to three written, signed and dated references to attest to volunteer/work experience and ability including the duration and nature of the work (proforma available)",
            "up to three written, signed and dated references to attest to volunteer/work experience and ability including the duration and nature of the work (proforma available)",
            "AND",
            "\n\n",
            [
                [
                    "a personal statement outlining a) why they wish to be considered for the program and b) how their background and experience is relevant to a career in genetic counselling (1000 words maximum)"
                ]
            ],
            "a personal statement outlining a) why they wish to be considered for the program and b) how their background and experience is relevant to a career in genetic counselling (1000 words maximum)",
            "Shortlisted applicants will be invited to interview with the Selection Panel which involves:",
            "attending in person or by virtual interview to demonstrate interpersonal skills; and ",
            "writing a 500-word reflective piece on a relevant topic as determined by the Selection Committee; and ",
            "completion of a genetics quiz to demonstrate mastery of basic genetic/genomic concepts; and ",
            "completion of a resilience survey ",
            "1. \n \n",
            "2.  ",
            " ",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider",
            "1. \n\n\nprior academic performance; and\nthe nature and extent of relevant professional and/or voluntary work experience and\nthe personal statement; and\nthe performance at the interview; and\nmarks from the genetics quiz; and\nthe relevance of the references.\n\n\n",
            "2. \n\nprior academic performance; and\nthe nature and extent of relevant professional and/or voluntary work experience and\nthe personal statement; and\nthe performance at the interview; and\nmarks from the genetics quiz; and\nthe relevance of the references.\n\n",
            "3. prior academic performance; and",
            "4. the nature and extent of relevant professional and/or voluntary work experience and",
            "5. the personal statement; and",
            "6. the performance at the interview; and",
            "7. marks from the genetics quiz; and",
            "8. the relevance of the references.",
            "\n\n",
            [
                [
                    "prior academic performance; and",
                    "the nature and extent of relevant professional and/or voluntary work experience and",
                    "the personal statement; and",
                    "the performance at the interview; and",
                    "marks from the genetics quiz; and",
                    "the relevance of the references."
                ]
            ],
            "prior academic performance; and",
            "the nature and extent of relevant professional and/or voluntary work experience and",
            "the personal statement; and",
            "the performance at the interview; and",
            "marks from the genetics quiz; and",
            "the relevance of the references.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7+ is required.",
            "Notes",
            "Students may choose to exit the course with a Graduate Diploma in Genetic Counselling following successful completion of the first 100 credit points. The Graduate Diploma in Genetic Counselling is only available as an exit award. Completion of the Graduate Diploma in Genetic Counselling does not satisfy requirements to register as a practicing Genetic Counsellor."
        ],
        "Inherent requirements (core participation requirements)": [
            "Students must comply with Fitness to Practice Rules, which are accessible fromSchedule 1of theStudent Fitness to Practice Policy (MPF1345).",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Overview, Objectives, Assessment and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support:http://services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Board of Censors in Genetic Counselling (Human Genetics Society of Australasia)",
            "The Master of Genetic Counselling constitutes the professional qualification for entry into employment as an Associate Genetic Counsellor and for Part 1 Certification, awarded through the Board of Censors in Genetic Counselling (Human Genetics Society of Australasia)"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students will complete all 14 core subjects (200 credit points) to graduate with a Master of Genetic Counselling.",
                "Graduate Diploma in Genetic Counselling is available after completion of year one (100 credit points), only as an exit award. Completion of the Graduate Diploma in Genetic Counselling does not satisfy requirements to register as a practicing Genetic Counsellor."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Year One": {
            "overview": [
                [
                    "GENE90001",
                    "GENE90002",
                    "POPH90226",
                    "WELF90004",
                    "WELF90005",
                    "HLTH90014",
                    "HLTH90011",
                    "WELF90010"
                ]
            ]
        },
        "Year Two": {
            "overview": [
                [
                    "GENE90021",
                    "GENE90022",
                    "WELF90009",
                    "WELF90008",
                    "PAED90020",
                    "HLTH90013"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}