{
    "Course name": "Master of Law and Development",
    "Course code": "635AA",
    "Overview text": [
        "Effective legal frameworks and institutions are pivotal in tackling inequality, alleviating poverty and creating a sustainable environment. The specialisation in law and development offers a choice of subjects examining the legalisation of development and the role of international and regional actors in law reform projects. Also offered is an investigation and analysis of both international law and the ‘rule of law’ in a developmental context. Subjects take a range of practical, historical, critical, applied and theoretical perspectives.",
        "This program is ideal for those working in international development from a government, non-government or not-for-profit background, and those seeking to work in those areas or in international organisations more broadly, as well as for those who wish to undertake specialist study in the area in preparation for a research degree."
    ],
    "Overview table": {
        "Award title": "Master of Law and Development",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "051271K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "100 credit points",
        "Duration": "12 months full-time or 42 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "Start Year Intake 2024",
            "1. In order to be considered for entry, applicants must have completed:• a degree in law (LLB, JD or equivalent) leading to admission to practice, at honours standard, or equivalent; or• a degree in law (LLB, JD or equivalent) leading to admission to practice, or equivalent, and two years of documented relevant professional experience; or• an undergraduate degree in a relevant discipline; and two years of documented relevant professional experience; or• an undergraduate degree in a relevant discipline; and successful completion of four subjects in a cognate graduate diploma; and one year of documented relevant professional experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:• prior academic performance; and• the professional experience",
            "3.  The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4.  Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Mid-year Intake 2024",
            "1. In order to be considered for entry, applicants must have completed:• a degree in law (LLB, JD or equivalent) leading to admission to practice, at honours standard, or equivalent; or• a degree in law (LLB, JD or equivalent) leading to admission to practice, or equivalent, and two years of documented relevant professional experience; or• an undergraduate degree in a relevant discipline; and two years of documented relevant professional experience; or• an undergraduate degree in a relevant discipline; and successful completion of four subjects in a cognate graduate diploma; and one year of documented relevant professional experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:• prior academic performance; and• the professional experience",
            "3.  The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4.  Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.0 overall with no band less than 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne Law Masters welcomes applications from students with disabilities. The inherent academic requirements for study in the Melbourne Law Masters are:",
            "The ability to attend a minimum of 75% of classes and actively engage in the analysis and critique of complex materials and debate;",
            "The ability to read, analyse and comprehend complex written legal materials and complex interdisciplinary materials;",
            "The ability to clearly and independently communicate in writing a knowledge and application of legal principles and interdisciplinary materials and to critically evaluate these;",
            "The ability to clearly and independently communicate orally a knowledge and application of legal principles and interdisciplinary materials and critically evaluate these;",
            "The ability to work independently and as a part of a group;",
            "The ability to present orally and in writing legal analysis to a professional standard.",
            "Students who feel their disability will inhibit them from meeting these inherent academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete 100 credit points in total.",
                "Students who do not have a law degree must completeInternational Law, as well as at least 75 credit points from the prescribed list (including the compulsory subjectInternational Law and Development). Students may choose the remaining 12.5 credit points from the subjects available in the Master of Laws (excludingFundamentals of the Common Lawand theMinor Thesis).",
                "Students with a law degree must complete at least 75 credit points from the prescribed list (including the compulsory subjectInternational Law and Development). Students may choose their remaining 25 credit points from the subjects available in the Melbourne Law Masters (excludingFundamentals of the Common Law).Note: Most subjects in the MLM program are 12.5 credit points each. Check individual subject handbook entries for confirmation."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Asian Law": {
            "overview": [
                [
                    "LAWS70230",
                    "LAWS90142",
                    "LAWS70457",
                    "LAWS70105",
                    "LAWS90182",
                    "LAWS90302"
                ]
            ]
        },
        "Banking and Finance Law": {
            "overview": [
                [
                    "LAWS90169",
                    "LAWS70111",
                    "LAWS70420",
                    "LAWS70110",
                    "LAWS90143",
                    "LAWS90144"
                ]
            ]
        },
        "Dispute Resolution": {
            "overview": [
                [
                    "LAWS90021",
                    "LAWS90250",
                    "LAWS90051",
                    "LAWS70468"
                ]
            ]
        },
        "Energy and Resources Law": {
            "overview": [
                [
                    "LAWS70423",
                    "LAWS70161"
                ]
            ]
        },
        "Environmental Law": {
            "overview": [
                [
                    "LAWS70293",
                    "LAWS90088",
                    "LAWS70100",
                    "LAWS70386",
                    "LAWS70219",
                    "LAWS90114",
                    "LAWS70349",
                    "LAWS90053"
                ]
            ]
        },
        "Government Law": {
            "overview": [
                [
                    "LAWS90058",
                    "LAWS70269",
                    "LAWS90255",
                    "LAWS90149",
                    "LAWS70448",
                    "LAWS70397",
                    "LAWS70367",
                    "LAWS70425",
                    "LAWS90106",
                    "LAWS90150"
                ]
            ]
        },
        "Health and Medical Law": {
            "overview": [
                [
                    "LAWS90057",
                    "LAWS70151",
                    "LAWS90092",
                    "LAWS70451",
                    "LAWS70421",
                    "LAWS90120"
                ]
            ]
        },
        "Human Rights Law": {
            "overview": [
                [
                    "LAWS70382",
                    "LAWS90121",
                    "LAWS90124",
                    "LAWS70422",
                    "LAWS70452",
                    "LAWS90044",
                    "LAWS70091",
                    "LAWS90045",
                    "LAWS70360",
                    "LAWS90122",
                    "LAWS70171",
                    "LAWS70454",
                    "LAWS90175",
                    "LAWS70264",
                    "LAWS70120",
                    "LAWS70365",
                    "LAWS70366",
                    "LAWS70430",
                    "LAWS90049"
                ]
            ]
        },
        "International Economic Law": {
            "overview": [
                [
                    "LAWS70169",
                    "LAWS70013",
                    "LAWS70392",
                    "LAWS70121",
                    "LAWS70308",
                    "LAWS70304",
                    "LAWS70028",
                    "LAWS90052",
                    "LAWS70322",
                    "LAWS90181"
                ]
            ]
        },
        "International Law": {
            "overview": [
                [
                    "LAWS90127",
                    "LAWS70033",
                    "LAWS70303",
                    "LAWS70234",
                    "LAWS70173",
                    "LAWS70369",
                    "LAWS70455",
                    "LAWS70078",
                    "LAWS90128",
                    "LAWS70456",
                    "LAWS90129",
                    "LAWS70313",
                    "LAWS70327",
                    "LAWS90063",
                    "LAWS70403",
                    "LAWS90249"
                ]
            ]
        },
        "Law and Development": {
            "overview": [
                [
                    "LAWS90154",
                    "LAWS90018",
                    "LAWS70093",
                    "LAWS90042",
                    "LAWS70122",
                    "LAWS90179",
                    "LAWS90155",
                    "LAWS90253",
                    "LAWS90272"
                ]
            ]
        },
        "Tax Law": {
            "overview": [
                [
                    "LAWS70009",
                    "LAWS70353",
                    "LAWS70162"
                ]
            ]
        },
        "Other Subjects": {
            "overview": [
                [
                    "LAWS90111",
                    "LAWS90112",
                    "LAWS70016",
                    "LAWS70389",
                    "LAWS70218",
                    "LAWS70446",
                    "LAWS70242",
                    "LAWS70067",
                    "PPMN90046"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "A student who completes a masters degree in the Melbourne Law Masters is eligible to apply for entry to the PhD program."
    ]
}