{
    "Course name": "Master of Veterinary Studies",
    "Course code": "MC-VETSTDR",
    "Overview text": [
        "The Master of Veterinary Studies, or MVS, is a higher degree by coursework which provides students with advanced clinical training in a specialised area of veterinary science. The MVS course runs parallel with training for the Fellowship of the Australian and New Zealand College of Veterinary Scientists (FANZCVS), or other equivalent American or European Colleges. The MVS provides invaluable preparation for the FANZCVS certifying examinations.",
        "Students must enrol in this course on a part-time basis. Students enrolled in the Master of Veterinary Studies may enrol concurrently in theMaster of Veterinary Science (Clinical) by researchas part of the residency training program.",
        "The MVS provides advanced clinical training under the mentorship of registered specialists in each discipline and is based on supervised management of clinical cases in a selected field of veterinary clinical science, attendance and participation in clinical rounds, seminars, journal club and post-mortem presentations. Staff who are members of the American, Australian and European specialty Colleges of Internal Medicine, Surgery, Neurology, Diagnostic Imaging, Clinical Pathology, Anaesthesiology, Equine Medicine, Equine Surgery and Clinical Pharmacology contribute to the training for each student."
    ],
    "Overview table": {
        "Award title": "Master of Veterinary Studies",
        "Year & campus": "2024— Werribee",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a degree in Veterinary Science, or an equivalent qualification from a Veterinary School listed in the World Health Organisation Directory of Veterinary Schools; and",
            "eligibility for registration with the Veterinary Practitioners Registration Board of Victoria in accordance with legislative requirements to practice as a veterinarian in Victoria;",
            "documented evidence of the applicant's professional experience in the practice of veterinary science as it relates to the area to be studied; and",
            "documented evidence of the applicant's participation in continuing professional education activities as it relates to the discipline to be studied.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the professional experience; and",
            "the professional continuing education activities.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic BoardRuleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university'sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceBand 6.5is required.",
            "Notes",
            "Admission into the MVS is conditional on the applicant successfully applying for and enrolling into a research higher degree: the Master of Veterinary Science (Clinical). The successful applicant will be admitted into the two part time courses concurrently."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providing support to those with special requirements. Further information is available fromStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students will enrol in this course on a part-time basis for a total of 50 points each year and must pass all subjects each year in order to progress in the course.",
                "Successful applicants will receive a fee waiver for this course.",
                "The Master of Veterinary Studies comprises 12 subjects:",
                [
                    "Advanced Clinical Skills 1 Part A and Part B",
                    "Advanced Clinical Skills 2 Part A and Part B",
                    "Advanced Clinical Skills 3 Part A and Part B"
                ],
                "and",
                [
                    "Principles of Medicine & Surgery 1 Part A and Part B",
                    "Principles of Medicine & Surgery 2 Part A and Part B",
                    "Principles of Medicine & Surgery 3 Part A and Part B"
                ],
                "Students normally enrol into the Part A availability of Advanced Clinical Skills and Principles of Medicine & Surgery in the first semester, and the Part B availability of each subject in second semester, in all three years of the residency program. A final subject result will be recorded at the completion of Part B of each subject.",
                "Most students enrolled in this course will be enrolled through the Residency Training Program."
            ]
        },
        "Subject options": {
            "overview": [
                "All students will enrol in the following subjects:"
            ]
        },
        "First Year": {
            "overview": [
                [
                    "VETS90046",
                    "VETS90052",
                    "VETS90047",
                    "VETS90053"
                ]
            ]
        },
        "Second Year": {
            "overview": [
                [
                    "VETS90048",
                    "VETS90054",
                    "VETS90049",
                    "VETS90055"
                ],
                "Please note: the Semester 2 availabilities of \"Part A\" subjects above are only available to students who commenced MC-VETSTDR mid-year under exceptional circumstances. All other students must take the Part A subjects in the Semester 1 availability."
            ]
        },
        "Third Year": {
            "overview": [
                [
                    "VETS90050",
                    "VETS90056",
                    "VETS90051",
                    "VETS90057"
                ]
            ]
        },
        "": {
            "overview": []
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}