{
    "Course name": "Master of Urban Design",
    "Course code": "MC-URBDES",
    "Overview text": [
        "The Master of Urban Design at the Melbourne School of Design develops professionals who are capable of seeing the city from multiple viewpoints and who relish working with interdisciplinary teams.",
        "The strengths of this course are the people it involves and the atmosphere they create. People who make urban design at the Melbourne School of Design what it is are the staff and students. Our core group of staff brings together experience and active involvement in current urban design research, design research and education. A broader teaching team with expertise in landscape architecture and urban planning adds diversity and richness. Urban design students contribute their own experiences, energy, new themes and aspirations and add to a multicultural complexity that make our courses special.",
        "The Master of Urban Design encourages interaction and an appreciation of creativity and difference, which creates an atmosphere of collegiality and common endeavour.",
        "Course Specialties",
        "The key quality of the Master of Urban Design is its combined strength of urban design theory, urban morphological analysis and four design studios. Studio projects are always approached as design-research exercises, where innovation and discovery represent a major part of the educational experience. Studios emphasise the importance of place and fieldwork represents a significant component of studio work. Professional and wider community involvement is a regular part of the Master of Urban Design studio experience.",
        "",
        ""
    ],
    "Overview table": {
        "Award title": "Master of Urban Design",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "072812A",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in a cognate area with a weighted average mark of at least H3 (65%), or equivalent; and",
            "a portfolio of recent design work, submitted in accordance with the requirements of the Selection Committee.",
            "Meeting these requirements does not guarantee selection.2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the design portfolio.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 6.5is required.",
            "Additional notes",
            "The design portfolio is assessed digitally and must be saved as one PDF file in landscape format. The file size of your portfolio should not exceed 10 MB, and the number of pages should not exceed 20 single pages. Note that as portfolios are evaluated digitally images should be reproduced at a sufficient scale and resolution to be easily readable with limited zooming or scrolling. Where design work has been produced jointly, applicants must indicate their role in the production of the design. Work should be clear and legible.",
            "Guaranteed Transfer into Commonwealth Supported PlaceStudents with a fee place in this course who complete 100 points of the course with a weighted average of at least 75% and who are eligible for a Commonwealth Supported Place will be guaranteed a transfer to a Commonwealth Supported Place for the final 100 points of the course.",
            "For information about how to applyclick here."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne School of Design is the graduate school of the Faculty of Architecture, Building and Planning. It offers professional entry programs in Architecture, Construction Management, Landscape Architecture, Property and Urban Planning. It offers specialist development programs in Property Valuation, Planning and Design and in Urban Design.",
            "The Melbourne School of Design welcomes applications from students with disabilities. It is the University and Faculty (Architecture, Building and Planning) policy to take reasonable steps to make reasonable adjustments so as to enable students’ participation in degrees offered by the Melbourne School of Design (MSD).",
            "A candidate for degrees offered in the MSD must have abilities and skills which include the following: observation; communication; motor; conceptual, integrative, and quantitative; andbehavioural and social. Adjustments can be provided to minimise the impact of a disability, however, particularly at Masters level, students need to be able to participate in programs in an independent manner and with regard to their safety and the safety of others.",
            "(i)Observation:Candidates must be able to read text, diagrams, maps, drawings and numerical data. Candidates should be able to observe details at a number of scales and to record useful observations of environmental contexts.",
            "(ii)Communication:Candidates should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. Candidates must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing, presenting one's own work in front of a large group, receiving and responding to feedback about one's own work in a public setting. Assessment in studio subjects will involve 'crits' where students present their own work in front of a large group, where they will receive and respond to feedback about their work in a public setting. Crits are an integral part of working in the industry and are an inherent requirement of the course.",
            "(iii)Motor:Candidates should have sufficient motor function to elicit information from environmental contexts. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments. Candidates should have sufficient motor ability to prepare documentation of analytic texts, drawings and models of findings and for the preparation of proposals for environmental interventions via digital or other means. Candidates should have the ability to actively participate in appropriate site and/or design studio-based activities.",
            "(iv)Intellectual-Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, synthesis and, importantly, the ability to interpret results of such work. Problem resolution, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, given the disciplines pursued in the MSD, candidates should be able to comprehend three-dimensional relationships and to understand the spatial relationships in environmental structures of a wide range of scales – from smaller than the individual through individual buildings and urban spaces to large geographic areas. Further, graduate study entails learning to master one’s own abilities and skills and to deploy them strategically. This requires further developing skills in both reflective and reflexive thinking and being able to practice these skills.",
            "(v)Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. Assessment in studio subjects will involve 'crits' where students present their own work in front of a large group, where they will receive and respond to feedback about their work in a public setting. Crits are an integral part of working in the industry and are an inherent requirement of the course.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "It is expected that graduates of the Master of Urban Design will have completed the academic requirements for membership of:",
            "Planning Institute of Australia (PIA)"
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "All students must complete:",
                [
                    "150 points of core subjects, including 25 points of capstone subject(s).",
                    "50 points of elective subjects."
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects (125 points)": {
            "overview": [
                "Students must complete all of the following subjects.",
                [
                    "ABPL90061",
                    "ABPL90273",
                    "ABPL90017",
                    "ABPL90130",
                    "ABPL90246",
                    "ABPL90131",
                    "ABPL90389"
                ]
            ]
        },
        "Capstone Subject (25 points)": {
            "overview": [
                "Students must also complete the following subject, which comprise the degree's capstone experience and provide students with the necessary research preparation for doctoral study.",
                [
                    "ABPL90376"
                ]
            ]
        },
        "Electives (50 points)": {
            "overview": [],
            "Urban Design Theory": {
                "overview": [
                    [
                        "ABPL90266",
                        "ABPL90279",
                        "ABPL90425"
                    ]
                ]
            },
            "Urban Design Practice": {
                "overview": [
                    [
                        "ABPL90086",
                        "ABPL90120",
                        "ABPL90123",
                        "ABPL90132",
                        "ABPL90149",
                        "ABPL90167",
                        "ABPL90263",
                        "ABPL90283",
                        "ABPL90304",
                        "ABPL90307",
                        "ABPL90319",
                        "ABPL90320",
                        "ABPL90321",
                        "ABPL90366",
                        "ABPL90377",
                        "ABPL90380",
                        "ABPL90400",
                        "ABPL90404",
                        "EVSC90015",
                        "MULT90005",
                        "ABPL90316"
                    ]
                ]
            },
            "Urban Planning Issues": {
                "overview": [
                    [
                        "ABPL90022",
                        "ABPL90040",
                        "ABPL90090",
                        "ABPL90056",
                        "ABPL90064",
                        "ABPL90077",
                        "ABPL90134",
                        "ABPL90281",
                        "ABPL90315",
                        "ABPL90341",
                        "ABPL90405",
                        "EVSC90022",
                        "MULT90004",
                        "PLAN90002",
                        "PLAN90003"
                    ]
                ]
            },
            "Research Methods": {
                "overview": [
                    [
                        "ABPL90066",
                        "ABPL90135",
                        "ABPL90305",
                        "ABPL90407",
                        "ABPL90408",
                        "ABPL90322",
                        "ABPL90417"
                    ]
                ]
            },
            "To view a sample course plan go to:": {
                "overview": [
                    "http://edsc.unimelb.edu.au/graduate/course-planning/sample-course-plans-melbourne-school-of-design/urban-design"
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Completion of ABPL90376 Urban Design Thesis is necessary research preparation for doctoral study."
    ]
}