{
    "Course name": "Master of Food and Packaging Innovation",
    "Course code": "MC-FOODPI",
    "Overview text": [
        "The Master of Food and Packaging Innovation explores the inter-disciplinary food science, product, innovation, entrepreneurship and packaging at an advanced level. This course provides a sound foundation in food science, critical thinking, innovation, leadership and packaging, as well as introducing advanced research topics and their practical application in commercial settings. Students will have the opportunity to gain industry experience through completing an internship with some of Australia’s most well-known food manufacturers.",
        "",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Master of Food and Packaging Innovation",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "083118K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree with at least H3 (65%) weighted average, or equivalent",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic BoardRules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university'sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required.",
            "Note:Successful applicants whose undergraduate degree is in a cognate discipline may receive up to 50 points credit. Successful applicants with an honours degree in a cognate discipline, or with a postgraduate degree of at least 100 points in a cognate discipline, may receive up to 100 points credit."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Veterinary and Agricultural Sciences (FVAS) welcome applications from students with disabilities. It is University and School policy to take reasonable steps to make reasonable adjustments so as to enable the student’s participation in the School’s programs. FVAS contributes to the New Generation degrees and offers a broad range of programs across undergraduate and post-graduate levels many of which adopt a multi-disciplinary approach.",
            "Students of the School’s courses must possess intellectual, ethical, and emotional capabilities required to participate in the full curriculum and to achieve the levels of competence required by the School. Candidates must have abilities and skills in observation; motor in relevant areas; communication; in conceptual, integrative, and quantitative dimensions; and in behavioural and social dimensions.",
            "Adjustments can be provided to minimise the impact of a disability, however students need to be able to participate in the program in an independent manner and with regard to their safety and the safety of others.",
            "I. Observation:In some contexts, the student must be able to observe demonstrations and experiments in the basic and applied sciences. More broadly, observation requires reading text, diagrams, maps, drawings and numerical data. The candidate should be able to observe details at a number of scales and record useful observations in discipline dependant contexts.",
            "II. Communication:A candidate should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. A candidate must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.",
            "III. Motor:Candidates should have sufficient motor function necessary for participation in the inherent discipline-related activities. The practical work, design work, field work, diagnostic procedures, laboratory tests, require varying motor movement abilities. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments.",
            "IV. Intellectual-Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, and synthesis. Problem solving, the critical skill demanded of professionals in land and environment industries, requires all of these intellectual abilities. In addition, the candidate should be able to comprehend three-dimensional relationships and to understand the spatial relationships of structures.",
            "V. Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel their disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                [
                    "87.5 points of core subjects co‐taught across Faculties and Schools",
                    "25 points of Internship subjects OR 25 points of Minor Project subjects",
                    "87.5 points from a selection of existing elective subjects which will provide skills for diverse career opportunities"
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                "The following seven 12.5 point subjects are core to this degree:",
                [
                    "FOOD90007",
                    "FOOD90008",
                    "MGMT90030",
                    "MKTG90008",
                    "FOOD90031",
                    "MKTG90037",
                    "FOOD90032"
                ]
            ],
            "Students are required to complete 25 points of Internship subjectsOR25 points of Minor Project subjects": {
                "overview": []
            }
        },
        "Internship Option": {
            "overview": [
                "Students are required to enrol into an internship for a total of 25 points. It is recommended that the internship is completed across two semesters (FOOD90037 MFPI Internship Part 1 and FOOD90038 MFPI Internship Part 2). Students wishing to complete the internship across one semester (FOOD90036) will require approval from the subject coordinator and course coordinator.",
                [
                    "FOOD90036",
                    "FOOD90037",
                    "FOOD90038"
                ]
            ]
        },
        "Minor Project Option": {
            "overview": [
                "Students are required to enrol into a research project for a total of 25 points. AGRI90070 Minor Research Project is just taken for one standard semester at 25 points. If you wish to study the minor project over an entire year you should enrol into AGRI90079 Minor Research Project Part 1 and AGRI90081 Minor Research Project Part 2 for a total of 25 points.",
                [
                    "AGRI90070",
                    "AGRI90079",
                    "AGRI90081"
                ]
            ]
        },
        "Elective Subjects": {
            "overview": [
                "Students should select 87.5 points of electives from the following subjects (or other electives approved by the course coordinator).",
                "Please note that you must be able to meet the prerequisites of any individual elective subject listed prior to enrolling in the subject.",
                [
                    "FOOD90028",
                    "MGMT90123",
                    "MGMT90140",
                    "FOOD90022",
                    "FOOD90040",
                    "MKTG90022",
                    "MGMT90121",
                    "FOOD90023",
                    "FOOD90033",
                    "FOOD90012",
                    "FOOD90010",
                    "FOOD90041",
                    "AGRI90077",
                    "MKTG90002",
                    "FOOD90035"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The course provides a pathway to PhD via the minor research project."
    ]
}