{
    "Course name": "Master of Management (Human Resources)",
    "Course code": "MC-MGMTHRE",
    "Overview text": [
        "The Master of Management (Human Resources) provides foundation training in business and economics, and specialist training in human resource management. The core program covers a broad spectrum of management activities including all the key areas needed to become a successful manager and leader, such as: managing people; developing and implementing a strategic approach to managing an organisation’s human resources; motivating and rewarding employees; working in diverse and international contexts; dealing with stakeholders; and analysing data and developing HR policy and practice responses. Elective options allow for further study and specialisation in specific areas of HR practice. The program is ideal for those seeking specialist careers in human resource management, leadership development, or organisational development. This program is aligned with the internationally recognised Society for Human Resource Management (SHRM) and accredited with the Australian Human Resources Institute (AHRI)."
    ],
    "Overview table": {
        "Award title": "Master of Management (Human Resources)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "092726M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline, or equivalent; and",
            "a personal statement outlining why they wish to be considered for the course.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance (in previous intakes, a University of Melbourne equivalent 70 weighted average mark has been competitive);",
            "the ; and",
            "an interview or any other evidence required by the Committee (if required).",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAdmission and Selection into Course Policy",
            "4. The minimum English language requirements for this course areBand 6.5.",
            "Notes:",
            "1. Applicants with an undergraduate degree in a business/commerce or related discipline, or with a degree in any discipline with appropriate business breadth or minor, may be awarded up to 50 points of credit.",
            "2. Students who discontinue from the Master of Management (including any of its named streams) but have successfully completed the requirements of the Graduate Certificate in Management or the Graduate Diploma in Management will be eligible to receive the Graduate Certificate in Management or the Graduate Diploma in Management, respectively, as an exit award.",
            "Guaranteed PathwayFor those applicants with an undergraduate degree in any discipline who are assessed as not meeting the University of Melbourne WAM-equivalent requirement for entry into the Master of Management (Human Resources), a place in the Graduate Certificate in Business may be offered. Successful completion of the Graduate Certificate with a minimum average WAM of 65, and no failed subjects, provides a guaranteed pathway into the 200-point Master of Management (Human Resources). Advanced Standing for subjects completed in the Graduate Certificate in Business will be provided where subjects undertaken align with equivalent foundation subjects to be completed as part of this degree.",
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline, or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required (with no individual band less than 6.5).",
            "Notes:",
            "1. Applicants with an undergraduate degree in a business/commerce or related discipline, or with a degree in any discipline with appropriate business breadth or minor, may be awarded up to 50 points of credit.",
            "2. Students who discontinue from the Master of Management (Human Resources) but have successfully completed the requirements of the Graduate Certificate in Management or the Graduate Diploma in Management will be eligible to receive the Graduate Certificate in Management or the Graduate Diploma in Management, respectively, as an exit award.",
            "Guaranteed PathwayFor those applicants with an undergraduate degree in any discipline who are assessed as not meeting the University of Melbourne WAM-equivalent requirement for entry into the Master of Management (Human Resources), a place in the Graduate Certificate in Business may be offered. Successful completion of the Graduate Certificate with a minimum average WAM of 70, and no failed subjects, provides a guaranteed pathway into the 200-point Master of Management (Human Resources). Advanced Standing for subjects completed in the Graduate Certificate in Business will be provided where subjects undertaken align with equivalent foundation subjects to be completed as part of this degree."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Human Resource Institute",
            "The Master of Management (Human Resources) is aligned with the internationally recognised Society for Human Resource Management (SHRM) and is an Australian Human Resource Institute (AHRI) Accredited Program."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Completion of one entry point program is required.",
                "The Master of Management (Human Resources) has two entry point programs: 200pt and 150pt programs.",
                "The Master of Management (Human Resources) 200 Point (200pt) program consists of 16 subjects comprising four foundation subjects, three core subjects, four discipline core subjects, two capstone subjects and three elective subjects.",
                "Students who wish to take more capstone selective subjects can do so through selecting them in the electives list and completing them as elective subjects.",
                "Students who are in a 150 point version of the course should refer to the 'majors, minors and specialistions' section for their course structure."
            ],
            "Subject options (200pt program)": {
                "overview": []
            },
            "Foundation subjects": {
                "overview": [
                    "Students must complete the following subjects in their first semester of study:"
                ],
                "Foundation core subjects": {
                    "overview": [
                        [
                            "MGMT90140",
                            "MGMT90141",
                            "MKTG90037"
                        ],
                        "Students must complete one of the following subjects in their first semester of study:"
                    ]
                },
                "Foundation selective subjects": {
                    "overview": [
                        [
                            "ACCT90041",
                            "ECON90015",
                            "FNCE90065"
                        ]
                    ]
                }
            },
            "Core subjects": {
                "overview": [
                    "Students must complete the following subjects in their second semester of study:",
                    [
                        "MGMT90015",
                        "MGMT90018",
                        "MGMT90280"
                    ]
                ]
            },
            "Discipline core subjects": {
                "overview": [
                    "Students must complete the following subjects:",
                    [
                        "MGMT90176",
                        "MGMT90027",
                        "MGMT90016",
                        "MGMT90014"
                    ]
                ]
            },
            "Capstone subjects": {
                "overview": [
                    "Students must complete the following subjects:"
                ],
                "Capstone core subject (final semester)": {
                    "overview": [
                        [
                            "MGMT90010"
                        ],
                        "Students must complete one of the following subjects:"
                    ]
                },
                "Capstone selective subjects": {
                    "overview": [
                        [
                            "BUSA90473",
                            "BUSA90485",
                            "BUSA90525",
                            "ENGR90039",
                            "MGMT90017"
                        ]
                    ]
                }
            },
            "Elective subjects": {
                "overview": [
                    "Students must complete three subjects from the following list:",
                    [
                        "ACCT90031",
                        "BUSA90473",
                        "BUSA90485",
                        "BUSA90525",
                        "BUSA90529",
                        "ECON90016",
                        "ENGR90039",
                        "FNCE90087",
                        "IBUS90008",
                        "MGMT90011",
                        "MGMT90012",
                        "MGMT90013",
                        "MGMT90017",
                        "MGMT90025",
                        "MGMT90026",
                        "MGMT90031",
                        "MGMT90032",
                        "MGMT90037",
                        "MGMT90165",
                        "MGMT90201",
                        "MGMT90208",
                        "MGMT90227",
                        "MGMT90261",
                        "MKTG90049",
                        "MULT90014",
                        "MGMT90255",
                        "MGMT90257"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}