{
    "Course name": "Master of Screen Producing",
    "Course code": "MC-SCPROD",
    "Overview text": [
        "The Master of Screen Producing provides students with industry-leading knowledge and skills to work as professional producers in the rapidly evolving screen industry. The program develops students’ theoretical and practical understanding of all aspects of the functional and technical role of the producer, focusing on the creative, practical and business aspects of being a successful producer.",
        "In a collaborative learning environment and with mentoring from staff and industry guests, students will develop the interpersonal and intellectual skills that enable a producer to effectively lead a creative project and develop their own and others’ works. Students will establish themselves as multifaceted autonomous producers, with strong capacities in the business, creative development and leadership dimensions of the producer role, while also undertaking research into emerging and innovative directions of contemporary screen culture and storytelling.",
        "The course offers a balance of theory, interdisciplinary practice, and departmental collaborations organised to allow for a progression from an intensively taught knowledge and skills-based first year to a more autonomous project and research-orientated second year.",
        "Students will be given the opportunity to collaborate with students in the graduate film and television course, developing practical skills and building networks with other students.",
        "This course includes a professional industry placement, designed to connect students with industry, which can be taken within Australia or overseas, or a research pathway for further research studies. A film festival and industry market experience that can be taken overseas or locally, granting students insight into the distribution landscape, essential to ensuring a product reaches the market.",
        "Master of Screen Producing graduates will establish themselves as world artistic citizens and cultural agents within the international professional film, television, arts and streaming markets with the view to actively participating in the industry with a tailored and unique producing philosophy and a strong, diverse and resilient skill base.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Master of Screen Producing",
        "Year & campus": "2024",
        "CRICOS code": "110761K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree or equivalent; or",
            "six years of documented relevant work experience; AND",
            "portfolio; and",
            "interview (shortlisted applicants only).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; or",
            "relevant professional work experience; and",
            "portfolio; and",
            "interview (shortlisted applicants only).",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Notes:",
            "Details for the Portfolio and Interview can be found on the Fine Arts and Music Study website \n",
            "Successful applicants will be required to hold a current Working with Children Check and current police check.",
            "Successful applicants will be required to hold a current First Aid Certificate (HLTAID003) and this must remain valid for the duration of the course."
        ],
        "Inherent requirements (core participation requirements)": [
            "Communication Skills:Students need to be able to communicate effectively and efficiently. Communication with fellow students, professional and academic staff, and the wider public about their knowledge and application of practicing arts disciplines is essential.",
            "Creative, Intellectual and Organisational Abilities:Students require the capacity for high-level creative performance or production. They are also expected to have the ability to develop problem-solving skills and to comprehend disciplinary and cross-disciplinary information. Students must have the ability to establish study plans and prioritise training objectives and outcomes.",
            "Behaviouraland Social Attributes:Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. They must take responsibility for their own participation and learning. Students also contribute to the learning of other students in collaborative environments and must therefore demonstrate a wide range of interpersonal skills which consider the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who have a disability which may prevent them from participating in tasks involving these inherent academic requirements are encouraged to contact Student Equity and Disability Services:https://students.unimelb.edu.au/student-support/student-equity-and-disability-support"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Screen Producing requires the successful completion of 200 credit points."
            ],
            "Year 1": {
                "overview": [
                    "100 points of compulsory subjects",
                    [
                        "FLTV90028",
                        "FLTV90029",
                        "FLTV90030",
                        "FLTV90031",
                        "FLTV90032",
                        "FLTV90033",
                        "FLTV90034"
                    ]
                ]
            },
            "Year 2": {
                "overview": [
                    "75 points of compulsory subjects",
                    [
                        "FLTV90035",
                        "FLTV90036",
                        "FLTV90037",
                        "FLTV90038",
                        "FLTV90039",
                        "FLTV90040"
                    ],
                    "PLUS two core subjects (25 points) according to pathway being undertaken.",
                    "Research Pathway:",
                    [
                        "FLTV90043",
                        "FLTV90044"
                    ],
                    "Attachment Pathway:",
                    [
                        "FLTV90041",
                        "FLTV90042"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}