{
    "Course name": "Master of Music (Music Performance)",
    "Course code": "652MP",
    "Overview text": [
        "The Master of Music (Music Performance) is now offered in the consolidated Master of Music (Research) course.",
        "Information on the Master of Music (Research) can be found in the Handbookhere.",
        "If you wish to apply for entry to the Master of Music (Research), information on admissions is on the Study Hubhere.",
        "You can find details of our discipline areas and all the courses offered by the Faculty of Fine Arts and Musichere.",
        "The Master of Music is a professional research degree that prepares students for specialist careers in musicology, ethnomusicology, composition, performance, conducting, music therapy, jazz & improvisation, music psychology & performance science or interactive composition.",
        "Instrumental and vocal candidates present two major public recitals and conducting candidates prepare and conduct an ensemble in two major performances. Performances are normally presented at the 12 and 18 month points of candidature. Candidates will receive regular individual tuition and participate in the weekly Performance Class and Postgraduate Seminar.",
        "Further performance opportunities are available through ensemble electives, including chamber music and ensemble activities. Students can also undertake a minor thesis .",
        "Students enroled in the Master of Music (Music Performance) may apply to convert to PhD, see the degree structure section on our web page for details:http://mcm.unimelb.edu.au/study/degrees/master-of-music-mmus-music-performance/degree-structure"
    ],
    "Overview table": {
        "Award title": "Master of Music (Music Performance)",
        "Year & campus": "2024",
        "CRICOS code": "006671A",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "9",
        "Duration": "2 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "a Bachelor of Music (Honours) degree, or equivalent, with at least an H2A (75%) weighted average; and for",
            "\n\nMusic Performance (including conducting), and Jazz & Improvisation: a satisfactory audition;\nComposition: a satisfactory composition folio;\nMusicology/Ethnomusicology, Music Psychology & Performance Science, and Music Therapy: a satisfactory piece of scholarly writing;\nInteractive Composition: a satisfactory interactive composition folio.\n\n",
            "Music Performance (including conducting), and Jazz & Improvisation: a satisfactory audition;",
            "Composition: a satisfactory composition folio;",
            "Musicology/Ethnomusicology, Music Psychology & Performance Science, and Music Therapy: a satisfactory piece of scholarly writing;",
            "Interactive Composition: a satisfactory interactive composition folio.",
            "Music Performance (including conducting), and Jazz & Improvisation: a satisfactory audition;",
            "Composition: a satisfactory composition folio;",
            "Musicology/Ethnomusicology, Music Psychology & Performance Science, and Music Therapy: a satisfactory piece of scholarly writing;",
            "Interactive Composition: a satisfactory interactive composition folio.",
            "and",
            "Submit a Research Proposal (except for Music Performance and Composition)",
            "Exceptional applicants, with substantial professional experience, can be considered for entry into Master of Music (Jazz & Improvisation) and the Master of Music (Interactive Composition) without meeting the requirement of completion of an honours degree or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the selection committee will consider:",
            "prior academic performance; and",
            "the composition folio, audition, or piece of scholarly writing.",
            "3. The selection committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance Band 6.5 is required.",
            "Music Performance Auditions",
            "Applicants for the Performance stream who meet the academic requirements for entry are required to provide a recorded audition. Auditions for the Master of Music (Music Performance) are fifty (50) minutes in length.",
            "Applicants currently enrolled in the Bachelor of Music (Honours) at the University of Melbourne and who are enroled in Recital are permitted to use their final recital examination as their audition. If you intend to use your honours recital as a Masters audition please contact MCM technical services to ensure your honours recital is recorded and contact the VCA and MCM Academic Services Office informing them that you intend to use your honours recital as an audition for Masters entry.",
            "For more details see theentry requirements."
        ],
        "Inherent requirements (core participation requirements)": [
            "Communication:Students must be able to participate in and produce performances and exhibitions as required; they will also need to communicate effectively and efficiently in oral and written forms. Communication with fellow students, professional and academic staff, and the wider public about their knowledge and application of practising Arts disciplines is essential.Creative, Intellectual and Organisational Abilities:Students require the capacity for high-level creative performance or production. They are also expected to have the ability to develop problem-solving skills and to comprehend disciplinary and crossdisciplinary information. Students must have the ability to establish study plans and prioritise training objectives and outcomes.Behavioural and Social Attributes:Students must possess behavioural and social attributes that enable them to participate in a complex learning environment. They must take full responsibility for their own participation and learning. Students also contribute to the learning of other students in collaborative environments and must therefore demonstrate a wide range of interpersonal skills which consider the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Disability:For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/",
            "Seminars:Students enroled in the Master of Music (Music Performance) are required to attend the MCM Postgraduate Seminar at least 27 times during their candidature. Each student must present, to the satisfaction of the course coordinator, at least one paper related to their field of study. The presentation should be of 40 minutes followed by 20 minutes of discussion led by the student. Students must fulfil these requirements prior to submission of their folio for examination.",
            "Performance Class:Students enroled in the Master of Music (Music Performance) are required to attend MCM Performance Class at least 27 times during their candidature. Each student must perform at least 12 times in the MCM Performance Class during their candidature."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Full-time and Part-time study options are available, however the Conducting specialisation can only be undertaken on a full-time basis.",
                "Recital 1 is undertaken over the first two semesters of candidature, culminating in a recital at the end of the second semester. Recital 2 is undertaken over the final semester of candidature.",
                "Students are required to undertake Postgraduate Seminar and Performance Class throughout the three semesters of their candidature; this includes attending a minimum of 27 classes for each subject. Attendance and participation requirements in seminar and performance class must be completed before presenting for the second recital, see Core Participation Requirements below.",
                "Electives are usually undertaken in the first two semesters of candidature."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Candidates enroling in the Master of Music (Music Performance) are enroled as follows:": {
            "overview": [
                [
                    "MUSI90100",
                    "MUSI70014"
                ],
                "Candidates undertake TWO electives from the following list of options, or the minor thesis:",
                [
                    "MUSI90093",
                    "MUSI90094",
                    "MUSI90018",
                    "MUSI90019",
                    "MUSI90006",
                    "MUSI90026",
                    "MUSI90137",
                    "MUSI90185",
                    "MUSI90191"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}