{
    "Course name": "Master of Commerce (Actuarial Science)",
    "Course code": "MC-COMACTS",
    "Overview text": [
        "The Master of Commerce (Actuarial Studies) is for students who hold an actuarial degree and wish to pursue their actuarial training further. It focuses on actuarial theory and practice, specialising in quantitative techniques for insurance, superannuation and financial risk modelling. With sufficiently high results students are able to obtain exemptions from exams of the Actuaries Institute (Australia), including the whole of Part II. The Master of Commerce (Actuarial Studies) has a ‘practice’ pathway, which focuses on advanced professional training, and a ‘research’ pathway, which prepares students for the PhD in Actuarial Studies.",
        "Last updated: 10 November 2023"
    ],
    "Overview table": {
        "Award title": "Master of Commerce (Actuarial Science)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "089805E",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate or postgraduate degree in actuarial science or similar with a weighted average mark of at least H2A (75%);",
            "the Graduate Records Examination (GRE), unless the applicant has completed an undergraduate degree in Australia or New Zealand or met one of the approved conditions for GRE exemption; and",
            "a personal statement outlining why they wish to be considered for the course. Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the GRE score unless the applicant has completed an undergraduate degree in Australia or New Zealand or met one of the approved conditions for GRE exemption; and",
            "the personal statement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments4. Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note:",
            "Applicants with an Honours degree in Actuarial Science may be awarded up to 62.5 points of credit into the Master of Commerce (Actuarial Science). Credit will be assessed at the point of application."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "The course provides the possibility of exemptions from modules necessary to complete the associateship of the Actuaries Institute Australia."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The degree is designed to be completed in one and a half years of full time study and requires completion of 150 points, comprised of 75 points of core actuarial subjects and 75 points of elective subjects. Students can elect to follow one of two pathways: the practice pathway or the research pathway."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "PRACTICE PATHWAY": {
            "overview": [],
            "Core Subjects": {
                "overview": [
                    "Students must take the following subjects:",
                    [
                        "ACTL90003",
                        "ACTL90010"
                    ],
                    "Students must taketwo(25 points) of constrained choice core actuarial subjects, selected from the following subjects:",
                    [
                        "ACTL90004",
                        "ACTL90013",
                        "ACTL90016",
                        "ACTL90017",
                        "ACTL90018"
                    ]
                ]
            },
            "Capstone Subjects": {
                "overview": [
                    "Students must take the followingtwosubjects:",
                    [
                        "ACTL90011",
                        "ACTL90019"
                    ]
                ]
            },
            "Elective Subjects": {
                "overview": [
                    "Students must takesix(75 points) of elective subjects, selected from the following subjects and core actuarial subjects:",
                    [
                        "ECOM90004",
                        "ECOM90010",
                        "FNCE40003",
                        "MAST90045",
                        "MAST90082",
                        "MULT90014",
                        "MAST90083"
                    ],
                    "and other Masters level electives in actuarial studies, economics, finance or mathematics, as approved by the Academic Program Director.",
                    "Eligible students may complete one of the following competitive-entry practicum subjects in place of one 12.5 point elective:",
                    [
                        "BUSA90473",
                        "BUSA90485"
                    ]
                ]
            }
        },
        "RESEARCH PATHWAY": {
            "overview": [],
            "Core Subjects": {
                "overview": [
                    "Students must take the following subjects:",
                    [
                        "ACTL90003",
                        "ACTL90010"
                    ],
                    "Students must taketwo(25 points) of constrained choice core actuarial subjects, selected from the following subjects:",
                    [
                        "ACTL90018",
                        "ACTL90019",
                        "ACTL90013",
                        "ACTL90024",
                        "ACTL90004",
                        "ACTL90011",
                        ""
                    ]
                ]
            },
            "Capstone Subjects": {
                "overview": [
                    "Students must take the followingtwosubjects over the last two semesters or in the final semester:",
                    [
                        "ACTL90016",
                        "ACTL90017",
                        ""
                    ]
                ]
            },
            "Elective Subjects": {
                "overview": [
                    "Students must takesix(75 points) of elective subjects, selected from the following subjects and core actuarial subjects:",
                    [
                        "ECOM90004",
                        "ECOM90010",
                        "FNCE40003",
                        "MAST90045",
                        "MAST90082",
                        "MULT90014",
                        "MAST90083"
                    ],
                    "and other Masters level electives in actuarial studies, economics, finance or mathematics, as approved by the Academic Program Director.",
                    "Eligible students may complete one of the following competitive-entry practicum subjects in place of one 12.5 point elective:",
                    [
                        "BUSA90473",
                        "BUSA90485"
                    ],
                    "This program is available for Semester 1 entry only.",
                    "Note: Students interested in progressing to the PhD program will need to follow the research pathway."
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}