{
    "Course name": "Master of Industrial Research (Chemistry)",
    "Course code": "MR-IRCHEM",
    "Overview text": [
        "The Master of Industrial Research (Chemistry) is an innovative approach to the delivery of graduate research training. The degree offers research training integrated with and embedded within industry. Industry perspectives are incorporated into the curriculum and research project design through collaboration with industry partners and peak industry bodies which represent the broader discipline of Chemistry.",
        "The Master of Industrial Research (Chemistry) provides an alternative program for graduate researchers interested in pursuing an industry-based career as opposed to the traditional Graduate Research pathway which provides a clearer trajectory towards academia.",
        "Master of Industrial Research (Chemistry) candidates will gain industry-relevant research experience and develop professional skills including entrepreneurship, IP law, and chemical regulations frameworks. Graduates will be equipped with a strong theoretical understanding of relevant chemistry disciplines from targeted coursework, which will be taught through traditional methods of imparting knowledge from academics, but enabled through alternative teaching media including online delivery, short intensive modular subjects and traditional lecture style delivery where this is the most appropriate method for knowledge transfer."
    ],
    "Overview table": {
        "Award title": "Master of Industrial Research (Chemistry)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "098316C",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "9",
        "Duration": "2 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. To be considered for entry, applicants must have completed:",
            "An undergraduate degree in Chemistry (or equivalent), with a weighted average mark of at least 75% or (University of Melbourne) equivalent); or",
            "A qualification and professional experience considered to be equivalent; and",
            "Provide referee reports (except for applicants who have graduated from the University of Melbourne within the last 5 years); and",
            "Have obtained the endorsement of a prospective supervisor. More information regarding how to find a Supervisor is detailed under How to Apply.",
            "Meeting these requirements does not guarantee selection.",
            "2. In selecting applicants, the selection committee will consider the applicants:",
            "Prior academic performance and, if relevant, professional qualifications and industry experience;",
            "Understanding of the research question to be explored;",
            "Performance at an interview;",
            "Motivation and capacity to complete the course in a timely manner;",
            "Relevant prior research and/or industry experience; and",
            "Referee reports.",
            "3. The selection committee may seek further information",
            "In order to clarify any aspect of an application in accordance with the Selection and Admission Policy.",
            "4. Applicants are required to satisfy the University’s English language requirements",
            "All applicants (internationally and locally qualified) must meet theUniversity's English language entry requirements.Refer to ourGraduate English requirementsfor further information and to view English language entry requirements for the Faculty of Science Coursework Programs for the following approved English language examinations: IELTS (Academic English only), TOEFL (Paper-based and internet-based tests), Pearson Test of English (Academic) and Cambridge English: Advanced/Certificate of Advanced English (CAE)."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students with reasonable adjustments to assessment and participation under the Disability Standards for Education (2005), and the Assessment and Results Policy (MPF1326). Students are expected to meet the core participation requirements for their course. These can be viewed under Entry and Participation Requirements for the course outlines in the Handbook. Further details on how to seek academic adjustments can be found atStudent Equity and Disability Support"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "All Master of Industrial Research (Chemistry) candidates must complete 200 points including:",
                [
                    "Industry-based Research Project (150 points);",
                    "Core subject (CHEM90055, 12.5 points);",
                    "Professional Skills subjects (12.5-25 points);",
                    "Elective subjects (12.5-25 points)."
                ]
            ],
            "Core Subject:": {
                "overview": [
                    "Candidates must complete the 12.5 point core subject:",
                    [
                        "CHEM90055"
                    ]
                ]
            },
            "Professional Skills:": {
                "overview": [
                    "Candidates must select one or two subjects from the following list:",
                    "Business Skills",
                    [
                        "BUSA90403"
                    ],
                    "Science Skills",
                    [
                        "MAST90007",
                        "MAST90045",
                        "MKTG90022",
                        "MGMT90171",
                        "SCIE90005",
                        "SKIL90004"
                    ],
                    "Communication Skills",
                    [
                        "SCIE90013",
                        "SCIE90012"
                    ]
                ]
            },
            "Discipline Electives:": {
                "overview": [
                    "Candidates must take 12.5 to 25 points of the following subjects:",
                    [
                        "CHEM90039",
                        "CHEM90040",
                        "CHEM90041",
                        "CHEM90042",
                        "CHEM90043",
                        "CHEM90045",
                        "CHEM90046",
                        "CHEM90047",
                        "CHEM90048",
                        "CHEM90049",
                        "CHEM90050",
                        "CHEM90051",
                        "CHEM90052",
                        "CHEM90053",
                        "CHEM90054",
                        "CHEM90064",
                        "CHEM90065"
                    ],
                    "and/or up to 12.5 points of approved 300-level subjects."
                ]
            },
            "Research Project:": {
                "overview": [
                    [
                        "CHEM70002"
                    ],
                    "Candidates are required to complete a 150 point Industry-based Research Project. The research project will be conducted within industry laboratories, supervised by a member of academic staff in the Faculty of Science and by the industry collaborator.",
                    "For how long and at what time within the enrolment the actual period of leave is to be taken needs to be negotiated with a candidate's supervisors.",
                    "The Research Project thesis/report will be due for submission by the end of the formal examination period of the semester in which the candidate completes 150 points of enrolment in this subject, if an earlier date is not specified.",
                    "The assessment requirements below are applicable to the entire 150 point Research Project:",
                    [
                        "attendance at an industry-based safety and induction program before laboratory work commences (hurdle);",
                        "a project overview/research proposal (up to 10 pages of mixed text, diagrams and formulas) due after the student has enrolled in 25 points of Research project (pass/fail);",
                        "a project-related seminar (up to 30 min), given after the student has enrolled in 150 points of the Research Project (10%);",
                        "a major thesis/project report, page limit of 60 pages, due after the student has enrolled in 150 points of the Research Project (35%);",
                        "an oral examination (viva) on the content of the thesis/research report (35%);",
                        "assessment of research performance based on attendance, application, initiative and demonstrated skills (20%)."
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "The Master of Industrial Research (Chemistry) offers a pathway to a PhD."
    ]
}