{
    "Course name": "Master of Physiotherapy (Pelvic Health)",
    "Course code": "MC-PHTYPH",
    "Overview text": [
        "The Master of Physiotherapy (Pelvic Health) is designed to produce graduates with extended knowledge and skills for professional practice in the area of women’s, men’s and pelvic health, an area of specialisation in the physiotherapy profession. The course is designed for physiotherapists throughout career stages who wish to further their careers within this specialty area of physiotherapy practice. The curriculum includes community health through understanding the assessment and treatment of conditions across the lifespan, inclusive of paediatrics, adolescent, young and older adults. The program challenges and extends clinicians to anticipate, enhance and advance best practice.",
        "The course is a blended program that combines intensive face to face subjects and fully online subjects. The curriculum is designed for practicing clinicians, is internationally relevant, and can be studied part or full time. Graduate attributes are aligned with those of The Melbourne Graduate; and is further distinguished by established discipline-specific professional competencies and standards frameworks in the domain of women’s, men’s and pelvic health.",
        "The online curriculum is designed around three elements which will be covered explicitly within learning outcomes in each subject throughout the program: 1) Theory and Practice, 2) Evidence and Innovation and 3) Clinical Practice in Context.",
        "Linking theory, research and practice is emphasised, utilising scientific evidence to underpin clinical practice and decisions. The core subjects explore professional and clinical content in diverse contexts including anatomy, physiology, diagnosis & management and complex case management. These subjects all require analysis, synthesis and creative problem solving within a range of practice contexts; extended knowledge and understanding; research principles and new innovations that are necessary to undertake clinical practice in different environments. This course scaffolds students to strategically align their learning with established competencies to support their progress to women’s, men’s and pelvic health professional physiotherapy titling and to design their career for the local as well as international context.",
        "Last updated: 4 July 2024"
    ],
    "Overview table": {
        "Award title": "Master of Physiotherapy (Pelvic Health)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "150 credit points",
        "Duration": "18 months full-time or 36 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must:",
            "be qualified to practice as physiotherapists and",
            "have at least 2 years of relevant post-entry to practice professional experience in the area of women’s, men’s     and pelvic health.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applicants, the Selection Committee will consider:",
            "prior academic performance; and",
            "professional work experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry. The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "150 credit point program:",
                [
                    "Six compulsory subjects (75 credit points)",
                    "Four elective subjects (50 credit points)",
                    "One capstone subject (25 credit points)"
                ],
                "Students are required to complete all compulsory subjects prior to completing their capstone subject.",
                "Advanced standing of up to 50% of the Masters in Physiotherapy will be given for students who have previously completed core subjects."
            ],
            "Compulsory subjects": {
                "overview": [
                    "Students complete the following six subjects (75 credit points):",
                    [
                        "PHTY90002",
                        "PHTY90003",
                        "PHTY90004",
                        "PHTY90097",
                        "REHB90003",
                        "REHB90010"
                    ]
                ]
            },
            "Capstone": {
                "overview": [
                    "Students choose one of the two following capstone subjects (25 credit points):",
                    [
                        "REHB90013",
                        "REHB90012"
                    ]
                ]
            },
            "Elective subjects": {
                "overview": [
                    "Students select four of the following electives (50 credit points):",
                    [
                        "HLTH90001",
                        "PHTY90114",
                        "REHB90006",
                        "REHB90007",
                        "REHB90001",
                        "REHB90002",
                        "REHB90005",
                        "REHB90009",
                        "HLTH90017",
                        "PHRM90022",
                        "RADI90024"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}