{
    "Course name": "Master of Professional Psychology",
    "Course code": "MC-PROPSYC",
    "Overview text": [
        "The Master of Professional Psychology provides selected psychology graduates with training in the skills required to meet the core competencies outlined by the Psychology Board of Australia (PsyBA) as necessary to practice as a generalist psychologist. The two-year program includes coursework subjects addressing psychological assessment, interventions and related professional skills; with a research project and practical placement experience in the second year. Upon completion, graduates will be eligible to undertake one year of supervised generalist practice – enabling them to progress to full registration as a psychologist.",
        "This program is accredited byAustralian Psychology Accreditation Council (APAC). Graduates from the program will provide the 4th and 5th year of university study in the5+1 pathwayto registration as a Psychologist."
    ],
    "Overview table": {
        "Award title": "Master of Professional Psychology",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "In order to be considered for entry, applicants must:",
            "within the last 10 years, have completed a Australian Psychology Accreditation Council (APAC) accredited three-year undergraduate sequence in psychology with a weighted average mark of at least H2A (75%) or equivalent; and",
            "provide a personal statement of no more than 500 words; and",
            "provide two referee reports to be submitted online; and",
            "attend a selection interview (short-listed applicants only).",
            "Meeting these requirements does not guarantee selection.",
            "For applicants with results from the University of Melbourne for subjects undertaken in Semester 1, Winter Term and/or Semester 2, 2020, the following will apply:",
            "A Psychology Benchmark will be established based on all psychology subjects completed any time other than Semester 1, Winter Term and Semester 2, 2020.",
            "Subjects undertaken in Semester 1, Winter Term and/or Semester 2, 2020, for which results are lower than the Psychology Benchmark will be excluded from the entry score calculation.",
            "The above changes do not apply to yearlong subjects undertaken in 2020; such results will be included in the entry score calculation.",
            "In the case that applying this rule results in no eligible Level 2 and Level 3 marks for inclusion, then the Psychology Benchmark will be used as the entry score.",
            "For external applicants, the benchmark will not apply and we will use numerical scores for all available level 2 and level 3 psychology subjects in the selection formula.",
            "Pass/fail grades will be excluded from the selection formula.",
            "In the case that excluding pass/fail subjects from the selection formula leaves either the Level 2 or Level 3 terms in the formula empty, the entry score will be the non-empty term (i.e., average of eligible Level 2 subjects if no Level 3 marks are eligible for inclusion; average of eligible Level 3 subjects if no Level 2 marks are eligible for inclusion).",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "suitability for clinical training as determined by the interview, personal statement and referee reports. ",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the University’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7is required.",
            "Notes:",
            "1. In computing the weighted average, the average of the third year Psychology subjects is assigned twice the weight of the average of the second year Psychology subjects",
            "2. Eligible Guaranteed Pathways applicants will be required to:\n\nprovide 2 referee reports;\nprovide a personal statement demonstrating interest in the course and relevant experience and\nat interview demonstrate proficiency in communication skills and suitability for professional practice as a psychologist. Students who fail to achieve this will not be guaranteed entry to the course.\n\n",
            "3. provide 2 referee reports;",
            "4. provide a personal statement demonstrating interest in the course and relevant experience and",
            "5. at interview demonstrate proficiency in communication skills and suitability for professional practice as a psychologist. Students who fail to achieve this will not be guaranteed entry to the course.",
            "1. provide 2 referee reports;",
            "2. provide a personal statement demonstrating interest in the course and relevant experience and",
            "3. at interview demonstrate proficiency in communication skills and suitability for professional practice as a psychologist. Students who fail to achieve this will not be guaranteed entry to the course.",
            "Due to the expected number of graduates we are unable to provide feedback to unsuccessful applicants."
        ],
        "Inherent requirements (core participation requirements)": [
            "Students must comply with Fitness to Practice Rules, which are accessible fromSchedule 1of theStudent Fitness to Practice Policy (MPF1345).",
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Psychology Accreditation Council",
            "The course is accredited by the Australian Psychology Accreditation Council.",
            "Graduates from the degree will be required to complete a 1 year internship and pass the National Psychology Examination before they can apply for full registration as a psychologist. More information can be found on thePsychology Boardwebsite."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "This course consists of coursework, placement and a minor research thesis (6,000 words).",
                "The coursework component consists of 13 classroom-based subjects (some with online component) taken over the two years of the course. These subjects provide students with a comprehensive foundation in professional psychology theory and practice, that is essential to all aspects of psychology practice. This includes fundamental skills in assessment and counselling, ethics, adult and child psychopathology and basic intervention skills and includes the capstone experience of the course.",
                "Students will also complete 300 hours of practical placement over the duration of the course. This will provide an opportunity to apply the theoretical knowledge gained through the coursework subjects to the clinical practice environment. The placement experience will constitute a mix of simulation, role-play and direct client work, giving students the opportunity to consolidate their specialist training and apply the knowledge gained in the course to real world scenarios.",
                "The research thesis provides students the opportunity to explore a question that is relevant to contemporary psychological practice. All subjects are compulsory and satisfactory achievement of subjects in the first year of the course is required prior to progression to the second year.",
                "Students enrolled in the Master of Professional Psychology may exit with a Graduate Diploma in Professional Psychology after successfully completing the first 100 CP of the Masters."
            ]
        },
        "Subject options": {
            "overview": [
                "All subjects are compulsory and must be taken in sequence as the knowledge gained in one group of subjects will enable satisfactory completion of the next group of subjects."
            ],
            "Year 1": {
                "overview": [],
                "Yearlong": {
                    "overview": [
                        [
                            "PSYC90112"
                        ]
                    ]
                },
                "Semester 1": {
                    "overview": [
                        [
                            "PSYC40005",
                            "PSYC90023",
                            "PSYC90110",
                            "PSYC90111"
                        ]
                    ]
                },
                "Semester 2": {
                    "overview": [
                        [
                            "PSYC90113"
                        ]
                    ]
                }
            },
            "Year 2": {
                "overview": [],
                "Summer Semester": {
                    "overview": [
                        [
                            "PSYC90011",
                            "PSYC90031",
                            "PSYC90114"
                        ]
                    ]
                },
                "Semester 1": {
                    "overview": [
                        [
                            "PSYC90006",
                            "PSYC90007",
                            "PSYC90010",
                            "PSYC90115"
                        ]
                    ]
                },
                "Semester 2": {
                    "overview": [
                        [
                            "PSYC90116",
                            "PSYC90009",
                            "PSYC90102"
                        ]
                    ]
                }
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}