{
    "Course name": "Master of Leadership for Development",
    "Course code": "MC-LEADDEV",
    "Overview text": [
        "The Master of Leadership for Development is a joint graduate degree offered by The University of Melbourne and University of Manchester delivered wholly online. The course is designed to foster the necessary skills in leadership required to effectively address the rapidly changing landscape in the development sector globally.",
        "The contemporary development leader requires new skill sets to meaningfully respond to, and effectively navigate complex circumstances and challenges that they encounter in the changing global environment including shifting patterns of work, prolonged crisis and conflict, and poverty and widening inequality. In advancing individual leadership skills and competencies the course also offers techniques for development of leadership capacities of others and to meaningfully and effectively engage with a range of governmental, non-governmental, business and civil society stakeholders and partners.",
        "The course offers a balance of advancing critical thinking and the development of skills and competencies required in leadership for development across different roles and contexts. Key thematic streams that run throughout each subject module allow students flexibility to develop or hone their skills within a specific area. While addressing important competencies such as communication, decision-making and self-reflection, the design of the subject modules ensures exercises and assessments are practical and applicable to students’ professional leadership aspirations.",
        "The joint qualification draws on the combined strength of two world-class institutions: the University of Manchester and the University of Melbourne. The fully online programme provides the flexibility to study around your commitments and complete the course part-time over 24 months. The course embraces action-based, reflexive learning, facilitated through a comprehensive online platform, simulations, and individual and group projects. The course is designed to forge strong enduring networks among study fellows and alumni."
    ],
    "Overview table": {
        "Award title": "Master of Leadership for Development",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "112.5 credit points",
        "Duration": "24 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an honours degree in a cognate discipline, or equivalent; and ",
            "at least two years of documented relevant professional work experience, or",
            "an undergraduate degree in a cognate discipline or equivalent, with a weighted average mark of at least 70% or equivalent (eg University of Manchester’s 2:1); and",
            "at least two years of documented, relevant professional work experience, or",
            "a minimum of eight years documented, relevant work experience.",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "relevance of previous studies.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. If English is not your first language, you need to take an English language test to demonstrate your English language proficiency for university study at Masters level. You are required to meet the IELTS minimum average performance of 6.5 with no lower than 6 on any band or the equivalence from another relevant English Language test accepted by University of Manchester or University of Melbourne.",
            "Note:",
            "Applicants seeking entry based on relevant work experience must document their experience with a brief curriculum vitae detailing the experience, contact details of two referees who can confirm the authenticity and nature of the experience claimed, and a covering letter that explains how the experience is relevant to the program and prepares them for it."
        ],
        "Inherent requirements (core participation requirements)": [
            "The course is designed for online delivery, students are required to participate online. Students will be required to meet some basic technological requirements such as ongoing and stable access to the internet, up to date browsers, and a microphone and headset for webinars (as specified at:https://online.unimelb.edu.au/support/current-students/apps-and-software-info/systems-and-support)"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The 112.5-point program consists of:",
                [
                    "Six compulsory subjects (75 points), and a",
                    "Capstone Dissertation/ or Group Project (37.5 points)"
                ]
            ]
        },
        "Subject options": {
            "overview": [],
            "Compulsory subjects": {
                "overview": [
                    "(to be taken sequentially)",
                    [
                        "DEVT90082",
                        "DEVT90068",
                        "DEVT90081",
                        "DEVT90071",
                        "DEVT90083",
                        "DEVT90070"
                    ]
                ]
            },
            "Capstone subject": {
                "overview": [
                    "(to be taken in the second year of the course)",
                    [
                        "DEVT90069"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}