{
    "Course name": "Master of Biostatistics (Enhanced)",
    "Course code": "MC-BIOSENH",
    "Overview text": [
        "The Master of Biostatistics (Enhanced) is a four semester course that provides advanced biostatistical training with a solid foundation in mathematics and probability for a diverse range of students. Graduates acquire specialised knowledge and skills in the statistical methods used in health and medical investigations, with the necessary mathematical foundation to integrate sophisticated statistical understanding and specialised skills into their training. On completion of the Masters Enhanced degree, graduates will have had the opportunity to complete a range of elective subjects, a research-based project under expert biostatistical supervision and will attain the required skills for employment as a professional biostatistician or for continuing to a research higher degree.",
        "Last updated: 18 July 2024"
    ],
    "Overview table": {
        "Award title": "Master of Biostatistics (Enhanced)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "111031C",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "In order to be considered for entry, applicants must have completed:",
            "A Bachelor degree in a relevant discipline, such as statistics, mathematics, biomedicine, psychology, science, pharmacy, health sciences, economics, from an approved university, with an average mark over the degree of at least 70% or equivalent; and",
            "Successful completion (average mark of 65%) at tertiary level of at least one mathematics subject, including elements of multivariable calculus and linear algebra.",
            "Applicants may be required to attend a test to elucidate any of the matters listed above.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Where relevant, performance in an interview or test, and/or referee reports or employer references.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceBand6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Biostatistics (Enhanced) requires the successful completion of 200 credit points."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Compulsory subjects:": {
            "overview": [
                "Students must complete the following FIVE compulsory subjects:",
                [
                    "POPH90014",
                    "MAST90101",
                    "MAST90100",
                    "MAST90102",
                    "MAST90099"
                ]
            ]
        },
        "Elective subjects :": {
            "overview": [
                "Students must complete NINE electives subjects from the list below:",
                [
                    "POPH90118",
                    "POPH90117",
                    "POPH90123",
                    "ISYS90069",
                    "POPH90124",
                    "MAST90083",
                    "MAST90140",
                    "POPH90119",
                    "POPH90271",
                    "MAST90027",
                    "POPH90242",
                    "INFO90002",
                    "COMP90041",
                    "POPH90139",
                    "POPH90094",
                    "POPH90112",
                    "SCIE90013",
                    "MAST90141",
                    "POPH90243",
                    "POPH90095",
                    "POPH90229",
                    "POPH90093",
                    "POPH90111",
                    "LING90002"
                ]
            ]
        },
        "Capstone Subjects3": {
            "overview": [
                "OPTION 1:",
                "Students may take a 25 point Research Project.  Students have the option of enrolling in a year-long project or a semester-long project.  Students enrolling in the year-long project (POPH90288 & POPH90289) MUST complete the project in two semesters consecutively.",
                [
                    "POPH90288",
                    "POPH90289"
                ],
                "OR",
                [
                    "POPH90151"
                ],
                "OPTION 2:",
                "Students who choose this option must enrol in the following Research Project plus the capstone selective subject POPH90123.",
                [
                    "POPH90149",
                    "POPH90123"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}