{
    "Course name": "Master of Climate Science",
    "Course code": "MC-CLIMSCI",
    "Overview text": [
        "Climate change is one of the biggest challenges of the 21stcentury. To face this challenge, society and industry require individuals trained to understand the climate system and apply that knowledge to help quantify, mitigate and adapt to climate risks. In this course you will apply your prior experience in other disciplines and gain the extra skills and knowledge required to develop advanced knowledge of physical aspects of climate science, climate change science, techniques and limitations of climate modelling, and climate policy.",
        "Graduates will have the skills to work in the growing field of climate risk, environmental consulting, become a working climate scientist, or combine their learnings with their prior degree to apply climate knowledge to a broad range of occupations. Graduates could also choose to pursue further studies in climate science as part of a subsequent research degree.",
        "Core knowledge and real-world application",
        "In this course you’ll take subjects that provide you with advanced knowledge of physical aspects of how the climate system works and how and why it is changing. You’ll then be able to tailor your degree to focus on the areas you’re most interested in whether that be understanding climate change dynamics and extreme weather or learning how we can mitigate against ever more pervasive climate change impacts.",
        "Last updated: 30 August 2024"
    ],
    "Overview table": {
        "Award title": "Master of Climate Science",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "106786B",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree with a major in physics, chemistry, mathematics, computer science, engineering, environmental science, or equivalent, with a course weighted average mark of at least H3 (65%); and,",
            "MAST10005 (Calculus 1) or equivalent",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "200 Point Program",
                "Students must complete 200 points including:",
                [
                    "Foundational core (25 points)",
                    "Discipline core (75 points)",
                    "Discipline electives (75 points)",
                    "Professional skills  (25 points)"
                ]
            ],
            "Foundational Core Subjects (25 points)": {
                "overview": [
                    [
                        "ATOC30006",
                        "ATOC30008"
                    ]
                ]
            },
            "Discipline Core Subjects (75 points)": {
                "overview": [
                    [
                        "ERTH90026",
                        "ATOC90002",
                        "ATOC90017",
                        "ATOC90004"
                    ],
                    [
                        "ATOC90018",
                        "ATOC90019"
                    ],
                    "Note: ATOC90004 is a capstone subject and should be taken towards the end of the course with either ATOC90018 or ATOC90019."
                ]
            },
            "Discipline Electives (75 points)": {
                "overview": [
                    "Students may take discipline electives from any of the following areas:",
                    [
                        "Climate Dynamics",
                        "Climate Change",
                        "Non-Specialised"
                    ],
                    "Climate Dynamics",
                    "Completion of this stream requires students to have previously completed Calculus 2 or equivalent.",
                    [
                        "ATOC30003",
                        "ATOC30004",
                        "ATOC90011",
                        "ATOC90016"
                    ],
                    "AND an additional 25 points from the Non-Specialised elective list.",
                    "Note: Climate Dynamics requires students to take ATOC30003 and ATOC30004 in the first 100 points of study.",
                    "Climate Change",
                    [
                        "ENST90004",
                        "ENST90033",
                        "ENST90034",
                        "EVSC90017"
                    ],
                    "AND an additional 25 points from the Non-Specialised elective list.",
                    "Non-Specialised Electives",
                    "Student may take up to 75 points from:",
                    [
                        "ATOC30004",
                        "ATOC30003",
                        "ATOC90016",
                        "ATOC90011",
                        "ATOC90015",
                        "ATOC90010",
                        "SCIE90014",
                        "EVSC90017",
                        "EVSC90014",
                        "ENST90004",
                        "ENST90034",
                        "ENST90033"
                    ],
                    "Note: Students choosing to take ATOC30003 and/or ATOC30004 must do so in the first 100 points of study."
                ]
            },
            "Professionals Skills (25 points)": {
                "overview": [
                    "Students are required to take 25 points from:",
                    [
                        "BUSA90403",
                        "MAST90045",
                        "SCIE90005",
                        "MAST90044",
                        "MAST90007",
                        "SCIE90013",
                        "SCIE90017",
                        "SCIE90012",
                        "COMP90059",
                        "COMP90072",
                        "LAWS90203"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who successfully complete the Climate Science Research Project component within the Master of Climate Science with an H2A (75%) average are eligible to apply for M.Phil - Science and PhD-Science candidature."
    ]
}