{
    "Course name": "Master of Commerce (Management)",
    "Course code": "MC-COMMGMT",
    "Overview text": [
        "The Master of Commerce (Management) represents years 1 and 2 of the 5-year doctoral program in Management and is only available to students pursuing the doctoral program. Students enrolled in the Master of Commerce (Management) will acquire the necessary background knowledge to become independent researchers and scholars in the field of management.",
        "Last updated: 4 April 2024"
    ],
    "Overview table": {
        "Award title": "Master of Commerce (Management)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "098522G",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.In order to be considered for entry, applicants must have completed:",
            "an undergraduate or postgraduate degree with a major in management or cognate background in management with a University of Melbourne equivalent weighted average mark of least 75% (H2A) or equivalent or",
            "a qualification and professional experience considered to be equivalent; and submit:",
            "a personal statement outlining why they wish to be considered for the course (maximum of 1,000 words); and",
            "a Graduate Management Admission Test (GMAT) or Graduate Record Examination (GRE) test, unless the applicant has met one of the Faculty’s doctoral-level conditions for GMAT/GRE exemption; and",
            "academic referee reports (except for applicants who have graduated from the University of Melbourne within the last 5 years).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applicants, the selection committee will consider:",
            "prior academic performance; and",
            "the results of a Graduate Management Admission Test (GMAT) of a Graduate Record Examinations (GRE) test completed within the last 5 years. No minimum GMAT or GRE score is required. The average score of successful applicants is around 680-700 (GMAT) and 324 (GRE).**. The following applicants for this course are exempt from submitting a GMAT or GRE test:o Those who have completed an undergraduate degree in Australia or New Zealand within the 18 months prior to the date of application; oro Those who face significant humanitarian issues;• performance in an interview during which the applicant’s level of understanding, motivation and time commitment will be assessed; and• relevant prior research and/or professional experience; and• referee reports; and• the personal statement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Commerce (Management) is a 24-month full-time or part-time equivalent program. The program consists of five compulsory foundation subjects, two core discipline electives, one advanced methods subject and one additional methods subject that must be approved by the Program Director, two special topics subjects, three electives that must be approved by the Program Director and a research report (completed over two consecutive semesters)."
            ],
            "Year 1": {
                "overview": [
                    "During the first year of the course, students complete 100 points.",
                    "Progression from Year 1 to Year 2 of the Master of Commerce (Management) requires:",
                    [
                        "An average of no less than 75% overall in all subjects taken in Year 1; and",
                        "An average of no less than 80% in all the subjects that are offered by the Department of Management and Marketing (subject codes beginning with MKTG, MGMT, and IBUS)."
                    ],
                    "Students who discontinue from the Master of Commerce (Management) after Year 1 but have successfully completed the requirements of the Graduate Diploma in Commerce (Management) will be eligible to receive the Graduate Diploma in Commerce (Management) as an exit award."
                ]
            },
            "Year 2": {
                "overview": [
                    "In the final year of the course, students complete 100 points including the 25-point Research Report.",
                    "Progression from Year 2 of the Master of Commerce (Management) to the Doctor of Philosophy (Business and Economics) requires:",
                    "• An average of no less than 75% overall in all subjects taken in Year 2; and• An average of no less than 80% in all the subjects that are offered by the Department of Management and Marketing (subject codes beginning with MKTG, MGMT, and IBUS); and• An average of no less than 75% in MGMT90237 Research Report Part 1 and MGMT90238 Research Report Part 2"
                ]
            }
        },
        "Subject options": {
            "overview": [
                "In their first semester of study, students must take the following core subjects:",
                [
                    "MGMT90195",
                    "MGMT90202",
                    "MGMT90203",
                    "MGMT90249"
                ],
                "In their second semester of study, students must take the following core subject:",
                [
                    "MGMT90205"
                ],
                "And one of:",
                [
                    "MGMT90198",
                    "MGMT90199"
                ],
                "In their third semester of study, students must take the following core subjects:",
                [
                    "MGMT90237",
                    "MGMT90206"
                ],
                "In their fourth semester of study, students must take the following core subjects:",
                [
                    "MGMT90238",
                    "MGMT90207"
                ],
                "In addition to the core subjects shown above, students must complete:",
                [
                    "\nTwo Core Discipline subjects chosen from:"
                ],
                [
                    "IBUS90006",
                    "MGMT90193",
                    "MGMT90196",
                    "MGMT90197",
                    "MGMT90200",
                    "MKTG90023",
                    "MKTG90024"
                ],
                [
                    "\nOne additional methods subject approved by the Program Director"
                ],
                "This subject can be the advanced method subject not completed as a core subject (MGMT90198 Advanced Qualitive Methods or MGMT90199 Advanced Quantitative Methods). Alternatively, a graduate level subject with a significant research methods component can be chosen from another faculty to meet research interests. Enrolment in subjects from other faculties requires as permission from the Subject Coordinator as well as the Program Director.",
                [
                    "\nThree elective subjects approved by the Program Director"
                ],
                "Enrolment in subjects from other faculties requires permission from the Subject Coordinator as well as the Program Director approval."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}