{
    "Course name": "Master of Management (Accounting and Finance)",
    "Course code": "MC-MGMTAFN",
    "Overview text": [
        "The Master of Management (Accounting and Finance) provides foundation and advanced studies in the disciplines of accounting and finance. Advanced levels of knowledge and skill in the two disciplines of accounting and finance are developed through a combination of core and elective subjects. Through the appropriate selection of subjects, students will meet the requirements to enter Certified Practising Accountants Australia (CPA Australia) and Chartered Accountants Australia and New Zealand (CAANZ) professional studies programs. The program also provides advanced competencies, professional skills and knowledge in the finance discipline that will prepare graduates for entry into the finance profession.",
        ""
    ],
    "Overview table": {
        "Award title": "Master of Management (Accounting and Finance)",
        "Year & campus": "2024— Parkville",
        "CRICOS code": "085103A",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "either",
            "an undergraduate degree in a cognate discipline, or equivalent, including studies in subjects related to Accounting and Finance; or",
            "an undergraduate degree with a minor sequence of study in a cognate discipline;",
            "and",
            "a personal statement outlining why they wish to be considered for the course.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection committee will consider:",
            "prior academic performance (in previous intakes, a University of Melbourne equivalent 70 weighted average mark has been competitive);",
            "previous performance in discipline relevant subjects;",
            "the personal statement; and",
            "an interview or any other evidence required by the Panel (if required).",
            "3. The Selection committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the University’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required.",
            "Note:Students who discontinue from the Master of Management (Accounting and Finance) but have successfully completed the requirements of the Graduate Certificate in Management or the Graduate Diploma in Management will be eligible to receive the Graduate Certificate in Management or the Graduate Diploma in Management, respectively, as an exit award; the certificate and the diploma are only available as exit awards.",
            "1. In order to be considered for entry, applicants must have completed:",
            "completed an undergraduate degree in Accounting, Finance or a business/commerce degree with an Accounting major/specialisation or equivalent, or any other degree with a minor sequence of study in both Accounting and Finance.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection committee will consider:",
            "prior academic performance.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required (with no individual band less than 6.5).",
            "Note:",
            "1. Applicants without a prior degree majoring in Accounting and/or Finance will be excluded from entry to this degree. Subject to meeting entry requirements, applicants are encouraged to apply for the Master of Management (Accounting). ",
            "2. Students who discontinue from the Master of Management (Accounting and Finance) but have successfully completed the requirements of the Graduate Certificate in Management or the Graduate Diploma in Management will be eligible to receive the Graduate Certificate in Management or the Graduate Diploma in Management, respectively, as an exit award."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Management (Accounting and Finance) requires the successful completion of 200 credit points.",
                "The Master of Management (Accounting and Finance) program consists of 16 subjects, comprising three core finance subjects, seven core accounting subjects, three finance electives, two general electives and one capstone subject.",
                "Students who wish to take more Finance elective subjects can do so through selecting them in the General electives list and completing them as general elective subjects.",
                "To obtain the degree, students must complete:",
                [
                    "125 credit points of Discipline core subjects including\n",
                    [
                        [
                            "37.5 credit points of Finance subjects",
                            "87.5 credit points of Accounting subjects"
                        ]
                    ],
                    "12.5 credit points of Capstone subject (the final semester of the program)",
                    "62.5 credit points of Finance and General elective subjects including\n",
                    [
                        [
                            "A minimum of 37.5 credit points of Finance elective subjects"
                        ]
                    ]
                ]
            ],
            "Subject Options": {
                "overview": [
                    "Discipline core subjects",
                    "Students must complete all three of the following finance subjects:",
                    [
                        "FNCE90056",
                        "FNCE90018",
                        "FNCE90011"
                    ],
                    "Students must complete all seven of the following accounting subjects:",
                    [
                        "ACCT90002",
                        "ACCT90012",
                        "ACCT90009",
                        "ACCT90010",
                        "ACCT90013",
                        "ACCT90014",
                        "ACCT90030"
                    ],
                    "Capstone subjects",
                    "Students must complete one of the following capstone subjects in their final semester of the program:",
                    [
                        "ACCT90033",
                        "FNCE90062"
                    ],
                    "Finance elective subjects",
                    "Students must complete three subjects from the following list:",
                    [
                        "FNCE90016",
                        "FNCE90045",
                        "FNCE90046",
                        "FNCE90048",
                        "FNCE90049",
                        "FNCE90051",
                        "FNCE90057",
                        "FNCE90086",
                        "FNCE90087"
                    ],
                    "General elective subjects",
                    "Students must complete two subjects from any of the following lists:",
                    "Accounting subjects",
                    [
                        "ACCT90015",
                        "BISY90009",
                        "ACCT90031",
                        "ACCT90016",
                        "ACCT90026",
                        "MULT90014",
                        "ACCT90005",
                        "ACCT90006",
                        "ACCT90007",
                        "ACCT90008",
                        "BUSA90520"
                    ],
                    "Economics subjects",
                    [
                        "ECON90025",
                        "ECON90016",
                        "ECON90032",
                        "ECON90047",
                        "ECON90045"
                    ],
                    "Finance subjects",
                    [
                        "FNCE90057",
                        "FNCE90045",
                        "FNCE90051",
                        "FNCE90016",
                        "FNCE90048",
                        "FNCE90049",
                        "FNCE90046",
                        "FNCE90086",
                        "FNCE90087"
                    ],
                    "Management subjects",
                    [
                        "IBUS90002",
                        "MGMT90141",
                        "MGMT90037",
                        "MGMT90148",
                        "MGMT90201",
                        "MGMT90038",
                        "MGMT90017",
                        "MGMT90027",
                        "IBUS90003",
                        "MGMT90013",
                        "MGMT90140",
                        "MGMT90018",
                        "MGMT90012",
                        "MGMT90030",
                        "MGMT90015",
                        "MGMT90011",
                        "MGMT90032",
                        "MGMT90176",
                        "MGMT90025",
                        "MGMT90016",
                        "MGMT90031",
                        "MGMT90165",
                        "MGMT90026",
                        "MGMT90208",
                        "MGMT90014",
                        "MGMT90146",
                        "IBUS90008",
                        "BUSA90529",
                        "MGMT90261",
                        "BUSA90485",
                        "BUSA90525",
                        "BUSA90473"
                    ],
                    "Marketing subjects",
                    [
                        "MKTG90009",
                        "MKTG90006",
                        "MKTG90008",
                        "MKTG90017",
                        "MKTG90004",
                        "MKTG90033",
                        "MKTG90002",
                        "MKTG90003",
                        "MKTG90001",
                        "MKTG90007",
                        "MKTG90040",
                        "MKTG90049",
                        "MKTG90048",
                        "MKTG90037",
                        "MKTG90026"
                    ],
                    "Accreditation",
                    "The following subjects (or equivalent) are required for entry to Chartered Accountants Australia and New Zealand (CAANZ) and Certified Practising Accountants Australia (CPA) professional studies programs:",
                    [
                        "ACCT90012",
                        "ACCT90015",
                        "ACCT90009",
                        "ACCT90010",
                        "ACCT90013",
                        "ACCT90014",
                        "ACCT90016",
                        "ACCT90030"
                    ],
                    "Students wishing to enter CAANZ or CPA professional studies programs on the basis of their Master of Management (Accounting and Finance) studies will need to complete the following two subjects as general electives:",
                    [
                        "ACCT90015",
                        "ACCT90016"
                    ]
                ]
            }
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}