{
    "Course name": "Master of Educational Psychology",
    "Course code": "312AA",
    "Overview text": [
        "Please Note:This course has been re-named and has a new course code. Please refer toMC-PSYCHED Handbook entry.",
        "",
        "",
        "",
        "",
        "This program is a professional qualification for psychologists who wish to work in educational settings (including schools, TAFE colleges, universities, or those associated with hospitals, or business and industrial organizations, either as staff members or as private practitioners). Academic and professional studies are integrated to allow for maximum flexibility in their application.",
        "For International applicants:",
        "Please note applicants who wish to be considered for this course and have international qualifications, must provide confirmation from the Australian Psychological Society (APS) confirming eligibility for Associate Membership. More information about your eligibility can be located via the Australian Psychological Society (APS) websitewww.psychology.org.au",
        ""
    ],
    "Overview table": {
        "Award title": "Master of Educational Psychology",
        "Year & campus": "2024",
        "CRICOS code": "009699J",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "200 credit points",
        "Duration": "24 months full-time or 48 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "within the last 10 years, an Australian Psychology Accreditation Council (APAC) accredited four-year undergraduate sequence in psychology (namely a three-year major in psychology as part of an undergraduate degree plus a fourth year Honours specialisation in psychology, or equivalent) with a weighted average mark of at least H2A (75%) or equivalent; and",
            "a personal statement of no more than 500 words; and",
            "two academic referee reports to be submitted online; and",
            "attend a selection interview (short-listed applicants only).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "suitability for clinical training as determined by the interview, personal statement and",
            "referee reports.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAcademic Board ruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7+ is required.",
            "Note:",
            "The weighted average mark is calculated one third from third year psychology subjects and two thirds from fourth year psychology subjects.",
            "Applicants with non-Australian qualifications must provide an Australian Psychological Society (APS) comparability assessment with their application, to confirm their eligibility for Associate Membership. See the Australian Psychological Society (APS) website for details: www.psychology.org.au\n",
            "To be validly enrolled, applicants not currently registered with the Psychology Board of Australia must apply for Provisional Registration with the Psychology Board of Australia before the start of the first semester of enrolment, and applicants without a Working with Children Check must apply for one before the start of the first semester of enrolment."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne Graduate School of Education welcomes applications from students with disabilities. It is University and Graduate School policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Graduate School’s programs.The core participation requirements for study in the Melbourne Graduate School of Education are:1. The ability to comprehend complex information related to educational psychology.2. The ability to communicate clearly and independently in assessment tasks and knowledge of the content, principles and practices relating to educational psychology.3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.In courses requiring students to undertake practicum placements4. The ability to undertake professional practice placements independently, including:a. the ability based on personal maturity to establish a professional relationship with client groups and interact with them appropriately;b. the ability to create, monitor and maintain a safe physical environment, and a stable and supportive psychological environment;c. the ability to establish effective relationships with all members of the client and caregiver groups;d. the ability based on mental and physical health to exercise sound judgment and respond promptly to the demands of client groups, and the personal resilience to cope and maintain their wellbeing under stress.Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact Student Equity and Disability Supporthttp://services.unimelb.edu.au/student-equity"
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "Australian Psychology Accreditation Council",
            "This course is accredited by the Australian Psychology Accreditation Council, and recognised by the Australian Health Practitioner Regulation Agency. Graduates of this course will be qualified to practice as a registered psychologist, become a member of the Australian Psychological Society, and an Associate Member of the College of Educational and Developmental Psychologists."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students are required to complete a total of 200 points of study:",
                [
                    "nine compulsory subjects (totalling 100 points)",
                    "four field practica (totalling 50 points)",
                    "a research project (50 points)"
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Full time - year 1": {
            "overview": [
                [
                    "EDUC90225",
                    "EDUC90220",
                    "EDUC90229",
                    "EDUC90218",
                    "EDUC90227",
                    "EDUC90221",
                    "EDUC90223",
                    "EDUC90224",
                    "EDUC90226"
                ]
            ]
        },
        "Full time - year 2": {
            "overview": [
                [
                    "EDUC90217",
                    "EDUC90216",
                    "EDUC90219",
                    "EDUC90228",
                    "EDUC90222"
                ]
            ]
        },
        "Part time - year 1": {
            "overview": [
                [
                    "EDUC90229",
                    "EDUC90225",
                    "EDUC90226",
                    "EDUC90221",
                    "EDUC90224"
                ]
            ]
        },
        "Part time - year 2": {
            "overview": [
                [
                    "EDUC90220",
                    "EDUC90218",
                    "EDUC90227",
                    "EDUC90223"
                ]
            ]
        },
        "Part time - year 3": {
            "overview": [
                [
                    "EDUC90217",
                    "EDUC90228",
                    "EDUC90222"
                ]
            ]
        },
        "Part time - year 4": {
            "overview": [
                [
                    "EDUC90219",
                    "EDUC90216"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates from this program are eligible to apply for entry to the Doctor of Education program or a PhD provided they meet the entry requirements and subject to achievement of an H2A GPA. Please note also that graduates of an undergraduate Honours degree may already be eligible for doctoral studies, subject to the same entry and achievement requirements."
    ]
}