{
    "Course name": "Master of Teaching (Early Childhood and Primary)",
    "Course code": "MC-TEACHEP",
    "Overview text": [
        "From 2022, the Master of Teaching (Early Childhood and Primary) is offered under the course code MC-TCHECP.Prospective students please refer tohttps://handbook.unimelb.edu.au/courses/mc-tchecp",
        "",
        "The Master of Teaching (Early Childhood and Primary) prepares graduates for dual registration to teach in early childhood settings and across the primary school years.",
        "The course focuses on early years’ education (birth to 8 years), and on primary school teaching (5 to 12 years). It provides an in-depth understanding of child learning and development, as well as professional practice in early childhood settings so that graduates can operate in multi-disciplinary fields involving care, education and health. The program integrates curriculum studies and professional practice across the primary years, with a specific focus on literacy and numeracy teaching. Teacher candidates consolidate their learning through completion of a research-based capstone project.",
        "The course is completed in 250 credit points of study over two years full-time."
    ],
    "Overview table": {
        "Award title": "Master of Teaching (Early Childhood and Primary)",
        "Year & campus": "2024",
        "CRICOS code": "093002F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "9",
        "Credit points": "250 credit points",
        "Duration": "24 months full-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline; and",
            "a selection test as determined by the Selection Committee.",
            "Meeting these requirements does not guarantee selection.",
            "In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the results of the selection test.*",
            "The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "Applicants are required to satisfy the University’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7+ is required.",
            "Note.",
            "(a) The Academic Board may prescribe minimum grade point averages for undergraduate studies that must be met by applicants eligible for Guaranteed Entry in a given year. Applicants not eligible for Guaranteed Entry will normally be required to have a grade point average for undergraduate studies at least as high as the prescribed minimum for Guaranteed Entry.",
            "(b) All applicants must have a valid Working with Children Check prior to the commencement of the Practicum subjects, and for the duration of the program.",
            "(c) Higher English standards than those normally required for admission to postgraduate study at the University of Melbourne may be needed for eligibility for Australian teacher registration on graduation. The Selection Committee may require applicants who have not recently completed a full undergraduate degree in Australia or New Zealand to demonstrate English language ability using one of the standard tests approved by the Academic Board at performanceband 7+, even if their prior study of the English language, or their prior education and assessment in an English language university, would normally exempt them from standard testing.",
            "(d) *All applicants must complete the Teacher Capability Assessment Tool (TCAT) selection test and meet all TCAT benchmarks. Details of the selection test are available on the Melbourne Graduate School of Education’sTeacher Capability Assessment Tool website.",
            "(e) Graduate Degree Packages for School Leavers",
            "The University of Melbourne offers Graduate Degree Packages to high achieving school leavers, allowing them to secure places (Commonwealth Supported Places for domestic students or International fee places) in the Master of Teaching (Early Childhood and Primary) provided that they meet certain requirements.",
            "For a Commonwealth Supported Place or an International Fee Place, the applicant must:",
            "complete an Australian Year 12 or the International Baccalaureate (IB) in 2018 or later either:",
            "—in Australia; or",
            "—outside Australia and be an Australian citizen;",
            "achieve an ATAR (or notional ATAR) of at least 95.00;",
            "apply for a University of Melbourne Graduate Degree Package for commencement in the year following completion of Year 12 or IB via VTAC;",
            "enrol immediately or be granted deferral in the year following Year 12;",
            "successfully complete a Bachelor of Arts, Design, Fine Arts, Music or Science at the University of Melbourne including all the specified prerequisite subjects;",
            "complete the Teacher Capability Assessment Tool during application into the undergraduate degree; and",
            "commence the Master of Teaching (Early Childhood and Primary) within 18 months of completing the undergraduate degree. ",
            "Applicants should refer to the University handbook for the additional entry requirements for the undergraduate degrees in the Graduate Degree Packages."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne Graduate School of Education welcomes applications from students with disabilities. It is University and Graduate School policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Graduate School’s programs. The core participation requirements for study in the Melbourne Graduate School of Education are:",
            "In all courses",
            "1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching.",
            "2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.",
            "3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students. In courses requiring students to undertake practicum placements\n",
            "4. The ability to undertake professional practice placements independently, including:a. the ability based on personal maturity to establish a professional relationship with students and interact with them appropriately;b. the ability to communicate to students the subject matter being taught with clarity and in a way that is age-sensitive;c. the ability to model literacy and numeracy skills independently for students and in all their interactions meet community expectations of the literacy and numeracy skills teachers should have;d. the ability to demonstrate skilfully and safely activities required in particular discipline areas being taught (e.g. physical education activities, science laboratory techniques);e. the ability to create, monitor and maintain a safe physical environment, a stable and supportive psychological environment, and a productive learning environment in their classroom;f. the ability to establish effective relationships with all members of the school community, including colleagues, students, and caregivers;g. the ability based on mental and physical health to exercise sound judgment and respond promptly to the demands of classroom situations, and the personal resilience to cope and maintain their wellbeing under stress.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {
        "Professional accreditation": [
            "ACECQA",
            "VIT",
            "The Master of Teaching (Early Childhood and Primary) is accredited at professional level by the Victorian Institute of Teaching (according to the Australian Institute of Teaching and School Leadership (AITSL) Graduate Standards and Initial Teacher Education Program Standards) and is accredited at professional level by the Australian Children's Education and Care Quality Authority (ACECQA)."
        ]
    },
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Master of Teaching (Early Childhood and Primary) requires completion of 250 credit points of study (22 compulsory subjects) over two years full-time.",
                "The first year focuses on early years content, and the second year is a combination of early childhood and primary school content. Five placements are completed across the Clinical Teaching Practice subjects; three in early childhood settings and two in primary schools.",
                "The course is structured across four semesters, and includes two summer and two winter subjects. Subjects should be taken in the sequence by semester/intensive outlined in the Subject Options.",
                "Successful completion of 162.5 points of the Master of Teaching (Early Childhood and Primary) and of EDUC90987 Clinical Teaching Practice (EC&P) 4 is required to commence EDUC90988 Clinical Teaching Practice (EC&P) 5.",
                "All Teacher Candidates must meet the following course progression requirement:",
                "The Australian Commonwealth Government’s Literacy and Numeracy Test for Initial Teacher Education Students (the Test) is administered by the Australian Council for Educational Research (independently of The University of Melbourne). Each Teacher Candidate must satisfactorily complete the Test by the end of the first calendar year of their enrolment in the Master of Teaching (Early Childhood and Primary). This is necessary in order for each Teacher Candidate to continue beyond the first calendar year of their course.",
                "Failure to satisfactorily complete the Test by this progression point will result in referral to the Melbourne Graduate School of Education’s Course Academic Progress Committee and may result in exclusion from the course. Excluded Teacher Candidates may be granted an early exit award of a Graduate Diploma in Pedagogy (Early Childhood)* (subject to satisfactory completion of relevant subjects). Alternatively they may be withdrawn from the course.",
                "*Note that the Graduate Diploma in Pedagogy (Early Childhood) is not a qualification for registration to teach in schools nor early childhood settings."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "First year subjects": {
            "overview": [
                "Subjects taken in first semester of program:",
                "From 2022, students who have not yet completed EDUC90705 Language & Literacy Learning in Children will instead complete EDUC91063 Language and Literacy: Birth to 8 Years as shown below.",
                [
                    "EDUC90895",
                    "EDUC90898",
                    "EDUC90897",
                    "EDUC91063",
                    "EDUC90892"
                ],
                "Subject undertaken as winter intensive:",
                [
                    "EDUC90563"
                ],
                "Subjects undertaken in second semester of program:",
                [
                    "EDUC90891",
                    "EDUC90890",
                    "EDUC90899",
                    "EDUC90893"
                ]
            ]
        },
        "Second year subjects": {
            "overview": [
                "Subjects undertaken as summer intensive:",
                [
                    "EDUC91032",
                    "EDUC90977"
                ],
                "Subjects undertaken in third semester of program:",
                [
                    "EDUC90896",
                    "EDUC90875",
                    "EDUC91001",
                    "EDUC90894",
                    "EDUC91002"
                ],
                "Subjects undertaken in winter:",
                "The Professional Learning Capstone commences in winter and continues in fourth semester.",
                [
                    "EDUC90987",
                    "EDUC91004"
                ],
                "Subjects undertaken in fourth semester of program:",
                "Teacher Candidates continue the Professional Learning Capstone and take the three subjects below.",
                [
                    "EDUC90876",
                    "EDUC90988",
                    "EDUC91018"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates from this program are eligible to apply for entry to the Doctor of Education program or a PhD after completion of a 50-point Postgraduate Certificate in Educational Research, provided they meet the entry requirements and subject to achievement of an H2A GPA.",
        "Please note also that graduates of an undergraduate Honours degree may already be eligible for doctoral studies, subject to the same entry and achievement requirements."
    ]
}