{
    "Course name": "Ph.D.- Architecture & Planning",
    "Course code": "051AA",
    "Overview text": [
        "This course is no longer offered. Please refer toDR-PHILABP.",
        "The degree of Doctor of Philosophy signifies that the holder has undertaken a substantial piece of original research, which has been conducted and reported by the holder under proper academic supervision and in a research environment for a prescribed period.",
        "The PhD thesis demonstrates authority in the candidate's field and shows evidence of command of knowledge in relevant fields. It shows that the candidate has a thorough grasp of the appropriate methodological techniques and an awareness of their limitations. The thesis also makes a distinct contribution to knowledge. Its contribution to knowledge rests on originality of approach and / or interpretation of the findings and, in some cases, the discovery of new facts. The thesis demonstrates an ability to communicate research findings effectively in the professional arena and in an international context. It is a careful, rigorous and sustained piece of work demonstrating that a research 'apprenticeship' is complete and the holder is admitted to the community of scholars in the discipline.",
        "In scope, the PhD thesis differs from a research Masters thesis chiefly by its deeper and more comprehensive treatment of the chosen subject. It is written succinctly, in English, unless approval has been given for the thesis to be written in a language other than English. The normal length of a PhD thesis is 80,000 words, exclusive of words in tables, maps, bibliographies and appendices. Footnotes are included as part of the word limit. The thesis should not exceed 100,000 words (or equivalent) without special approval from the Research Higher Degrees Committee.",
        "The Doctor of Philosophy degree demands high level research, conceptual and writing skills. Doctoral candidates define research topics that position them in and across the intellectual endeavours of their discipline. Candidates play an important role in the research activities and culture of the Faculty, as they do in the University as a whole. Increasingly, candidates are undertaking PhD projects which have direct industry links or which include a corpus of creative work.",
        "Areas of ResearchStudents interested in applying for a PhD or Masters (by Thesis) course are advised to enter into written communication with a prospective supervisor to clarify and develop their research proposal prior to making a formal application. Staff research interests can be found in the Staff Profile pages under each discipline section of the Handbook, as well as on the Faculty's website:www.abp.unimelb.edu.au/people/staff",
        "A list of current research topics is available on the Faculty's website:http://www.abp.unimelb.edu.au/research/current-thesis-topics.html"
    ],
    "Overview table": {
        "Award title": "Doctor of Philosophy",
        "Year & campus": "2024",
        "CRICOS code": "056961K",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "3 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "The criteria for assessing applicants' eligibility for PhD candidature are:",
            "1. \nMinimum qualifications Applicants are normally required to have been awarded at least one of the following at equivalent to H2A standard from an Australian university: a coursework Masters degree (with required research compnent), a Masters by research degree or a four-year honours degree.\n",
            "2. \nMinimum level of academic achievementApplicants should have achieved an overall H1 (80-100%) or H2A (75-79%) grade in the relevant honours or Masters degree.\n",
            "3. \nRelevance of the degree The completed degree must be in an area that is relevant to the intended PhD, including sufficient specialisation such that the applicant will have already developed an understanding and appreciation of a body of knowledge relevant to the intended PhD.\n",
            "4. \nEvidence of research ability Applicants are normally required to have completed a research project/component that accounts for at least 25% of their year's work at 4th year or at Masters level. Graduates of certain professional degrees at the University of Melbourne, including MBBS, BVSc, LLB, BPhysio and BEng are deemed to have met this requirement.\n",
            "5. \nCurrency of applicant's knowledge of the discipline The applicant's degree/s and/or professional experience must demonstrate that their knowledge of the discipline in which they plan to undertake their research higher degree is current.\n",
            "6. \nAssessment of level of suitabilityBased on interview or other verbal communication, an assessment should be made of the level of understanding, motivation and time commitment of the student for the proposed program of study. For example, a full-time student would be expected to devote at least 40 hours a week and a part-time student about half of this.\n",
            "Minimum qualificationsApplicants are normally required to have been awarded at least one of the following at equivalent to H2A standard from an Australian university: a coursework Masters degree (with required research compnent), a Masters by research degree or a four-year honours degree.",
            "Minimum level of academic achievementApplicants should have achieved an overall H1 (80-100%) or H2A (75-79%) grade in the relevant honours or Masters degree.",
            "Relevance of the degreeThe completed degree must be in an area that is relevant to the intended PhD, including sufficient specialisation such that the applicant will have already developed an understanding and appreciation of a body of knowledge relevant to the intended PhD.",
            "Evidence of research abilityApplicants are normally required to have completed a research project/component that accounts for at least 25% of their year's work at 4th year or at Masters level. Graduates of certain professional degrees at the University of Melbourne, including MBBS, BVSc, LLB, BPhysio and BEng are deemed to have met this requirement.",
            "Currency of applicant's knowledge of the disciplineThe applicant's degree/s and/or professional experience must demonstrate that their knowledge of the discipline in which they plan to undertake their research higher degree is current.",
            "Assessment of level of suitabilityBased on interview or other verbal communication, an assessment should be made of the level of understanding, motivation and time commitment of the student for the proposed program of study. For example, a full-time student would be expected to devote at least 40 hours a week and a part-time student about half of this.",
            "Applicants must also meet the University’sEnglish Language requirements."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne School of Design is the graduate school of the Faculty of Architecture, Building and Planning. It offers professional entry programs in Architecture, Construction Management, Landscape Architecture, Property and Urban Planning. It offers specialist development programs in Property Valuation, Planning and Design and in Urban Design.",
            "The Melbourne School of Design welcomes applications from students with disabilities. It is the University and Faculty (Architecture, Building and Planning) policy to take reasonable steps to make reasonable adjustments so as to enable students’ participation in degrees offered by the Melbourne School of Design (MSD).",
            "A candidate for degrees offered in the MSD must have abilities and skills which include the following: observation; communication; motor; conceptual, integrative, and quantitative; andbehavioural and social. Adjustments can be provided to minimise the impact of a disability, however, particularly at Masters level, students need to be able to participate in programs in an independent manner and with regard to their safety and the safety of others.",
            "(i)Observation:Candidates must be able to read text, diagrams, maps, drawings and numerical data. Candidates should be able to observe details at a number of scales and to record useful observations of environmental contexts.",
            "(ii)Communication:Candidates should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. Candidatesmust be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.",
            "(iii)Motor:Candidates should have sufficient motor function to elicit information from environmental contexts. Off campus investigations may include visits to construction sites,urban, rural and/or remote environments. Candidates should have sufficient motor ability to prepare documentation of analytic texts, drawings and models of findings and for thepreparation of proposals for environmental interventions via digital or other means. Candidates should have the ability to actively participate in appropriate site and/or designstudio-based activities.",
            "(iv)Intellectual-Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, synthesis and, importantly, the ability tointerpret results of such work. Problem resolution, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, given the disciplines pursued in theMSD, candidates should be able to comprehend three-dimensional relationships and to understand the spatial relationships in environmental structures of a wide range of scales –from smaller than the individual through individual buildings and urban spaces to large geographic areas. Further, graduate study entails learning to master one’s own abilities andskills and to deploy them strategically. This requires further developing skills in both reflective and reflexive thinking and being able to practice these skills.",
            "(v)Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students arerequired to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstratinginterpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "-"
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}