{
    "Course name": "Ph.D.- Music",
    "Course code": "651AA",
    "Overview text": [
        "The Doctor of Philosophy (Music) is now offered in the Doctor of Philosophy – Fine Arts and Music course.",
        "Information on the Doctor of Philosophy – Fine Arts and Music can be found in the Handbookhere.",
        "If you wish to apply for entry to the Doctor of Philosophy – Fine Arts and Music, information on admissions is on the Study Hubhere.",
        "You can find details of our discipline areas and all the courses offered by the Faculty of Fine Arts and Musichere.",
        "The degree of Doctor of Philosophy signifies that the holder has undertaken a substantial piece of original research, which has been conducted and reported by the holder under proper academic supervision and in a research environment for a prescribed period.",
        "The PhD thesis demonstrates authority in the candidate's field and shows evidence of command of knowledge in relevant fields. It shows that the candidate has a thorough grasp of the appropriate methodological techniques and an awareness of their limitations. The thesis also makes a distinct contribution to knowledge. Its contribution to knowledge rests on originality of approach and / or interpretation of the findings and, in some cases, the discovery of new facts. The thesis demonstrates an ability to communicate research findings effectively in the professional arena and in an international context. It is a careful, rigorous and sustained piece of work demonstrating that a research 'apprenticeship' is complete and the holder is admitted to the community of scholars in the discipline.",
        "In scope, the PhD thesis differs from a research Masters thesis chiefly by its deeper and more comprehensive treatment of the chosen subject. It is written succinctly, in English, unless approval has been given for the thesis to be written in a language other than English. The normal length of a PhD thesis is 80,000 words, exclusive of words in tables, maps, bibliographies and appendices OR equivalent to 80,000 words in the case of the PhD (Composition), the PhD (Music Performance), the PhD (Jazz & Improvisation) and the PhD (Interactive Composition) – see Confirmed Candidature, below. Footnotes are included as part of the word limit. The thesis should not exceed 100,000 words (or equivalent) without special approval from the Research Higher Degrees Committee."
    ],
    "Overview table": {
        "Award title": "Doctor of Philosophy",
        "Year & campus": "2024",
        "CRICOS code": "056960M",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "3 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "The minimum requirement for admission to PhD candidature is a four-year honours degree from an Australian university, a Masters degree in a relevant discipline which includes a substantial research component or a qualification or combination of qualifications considered by the Research Committee to be equivalent.",
            "The Melbourne Conservatorium of Music generally requires applicants to have completed a Master of Music by research (or equivalent qualification) before being eligible for admission to the PhD program. Applicants who have not met this requirement are usually advised to apply for the Master of Music with a view to applying for Conversion to PhD Candidature after 9 months of enrolment in the Master of Music.",
            "Application Procedure",
            "Applicants for PhD candidature should obtain information from the Melbourne Conservatorium of Music about the department's research activities and potential supervisors who are qualified and available to accept PhD candidates for supervision, prior to lodging a formal application. For further information regarding the PhD in Music see the MCM degrees web page:mcm.unimelb.edu.au/study/degrees",
            "Detailed information for prospective PhD students regarding the application process, including the application form is available athttp://www.futurestudents.unimelb.edu.au/admissions/applications/research.",
            "Applicants must also meet the University’sEnglish Language requirements.",
            "Evidence of research ability",
            "Applicants are normally required to have completed a research project, component, subject or group of subjects that accounts for at least 25% of their work (i.e. Honours year), or 25% of one year accumulated over the length of a Masters course, and which has, or have, been conducted, and assessed, individually. Research carried out in groups should at least have been graded individually. This project, component, or subject(s) may include:",
            "(a) any obviously research oriented project, subject or sustained piece of scholarly writing conducted for assessment, such as small theses, research essays, long essays, or studios; AND/OR",
            "(b) any less-obviously research subjects, including practice-based subjects such as performance or fieldwork, where there is also scholastic rigor as documented in a sustained piece of writing analogous to (a); AND/OR",
            "(c) any subjects directed at the formation of research skills, such as methodology and reasoning, such as scientific reasoning, or legal reasoning, where a sustained piece of writing has also been produced.",
            "PhD (Musicology/Ethnomusicology, Music Therapy, Music Psychology and Performance Science) Applications",
            "Applicants are required to submit",
            "a research proposal of 2,500 words",
            "a recent example of scholarly writing of 4,000-5,000 words",
            "PhD (Composition) Applications",
            "The degree of Doctor of Philosophy signifies a substantial piece of original research, which has been conducted and reported by the holder under proper academic supervision and in a research environment for a prescribed period. In the creative arts (including composition), a PhD thesis may take the form of a corpus of creative work plus a dissertation that aims to address, elucidate and contextualise the work. The creative work and dissertation will be examined as an integrated whole.",
            "Eligibility",
            "The Melbourne Conservatorium of Music generally requires applicants to have completed a Master of Music by research (or equivalent qualification) before being eligible for admission to the PhD program. Successful applicants will already hold a degree in composition and typically be well on the way to developing a professional career as a composer. Representation at the Australian Music Centre (or international equivalent) would normally be expected.",
            "Application",
            "In addition to a proposal for the PhD folio & dissertation, applicants are required to submit two or three representative works only, including a major work of over 15 minutes duration for large acoustic ensemble (or alternative medium), equivalent to that required for Masters standard. These should include at least one notated, bound score and at least one work written in the last 2 years. Recordings of MIDI versions are not acceptable. Live or studio performances and electro-acoustic works should be submitted on CD. Applicants should discuss their submission with a member of the composition staff in person, or by email (if interstate or overseas).",
            "Applicants should also include a list of works composed (including instrumentation, duration, and date), together with a list of any publications (scores & recordings), performances and broadcasts to date.",
            "In addition to examples of their compositional work, applicants for the PhD in composition are required to submit a substantial piece of scholarly writing with their application.",
            "PhD (Music Performance) Applications",
            "Applicants for the PhD (Music Performance) degree are required to submit, in addition to the standard application form:",
            "a thesis proposal of 2-3 pages. The research proposal should outline how the applicant intends to use recorded performances to illustrate his or her research in the final PhD submission.",
            "a recent example of scholarly writing of 4-5000 words;",
            "a DVD of a single unedited recital of approximately 70 minutes’ duration consisting of major repertoire for the instrument on which he or she intends to undertake the performance component. A live audition of approximately 70 minutes’ duration might also be required.",
            "a list of repertoire performed for examination in prior tertiary music qualifications.",
            "Applicants should have completed MUSI40064 The Research Process for Musicians or equivalent with a result of H2A or above or may be required to take a research methodology subject in the first semester of their enrolment.",
            "PhD (Jazz & Improvisation)",
            "Applicants for the PhD (Jazz & Improvisation) degree are required to submit, in addition to the standard application form:",
            "a research proposal of 2,000 words",
            "Applicants will be interviewed and must demonstrate a very high standard of artistic ability via a live performance or live performance recordings.",
            "PhD (Interactive Composition)",
            "Applicants for the PhD (Interactive Composition) degree are required to submit, in addition to the standard application form:",
            "a research proposal of 2,000 words",
            "Applicants will be interviewed and must demonstrate a very high standard of artistic ability via a folio of original works. The folio must contain recordings of 4 of your original composition at a totalduration of 20 minutes. This can include audio visual recordings of your original music from any source such as: pop songs, concert music, band music, laptop performance, hip hop rapping, music theatre music, film music, or music for dance or other media, such as music for games, advertising and web use. If appropriate include music scores and/or charts depending on your background."
        ],
        "Inherent requirements (core participation requirements)": [
            "All PhD candidates are required to complete the equivalent of at least 12 months full-time (24 months part-time) advanced study and research in the University unless studying at an outside institution approved by the Research Higher Degrees Committee (RHDC). The RHDC will not approve entirely distance supervision or entirely on-line supervision for research higher degree students.Throughout their candidature candidates are expected to attend the University in order to benefit from planning, conducting and writing up their research within a University community and environment.The residency requirement is deemed especially important during the period of probationary candidature. During probationary candidature the student is expected to interact on a regular basis with the supervisor, the department (including staff and other research students) and the University, so as:",
            "to build the skills and knowledge necessary to carry out the proposed research program",
            "to acquire an understanding of the standards and requirements for a PhD awarded by the University",
            "to make use of support programs and facilities provided by the Melbourne School of Graduate Research throughout candidature.",
            "Candidates who do not have the appropriate research methodology background may be advised to take either of the following Research Methodology subject in the first semester of their candidature: MUSI90191 The Research Process for Musicians (RHD).",
            "All students in the PhD - Music must participate in regular seminars in their discipline area. Musicology, Ethnomusicology, Music Psychology and Performance Science, Music Performance and Composition students must attend at least 27 MCM Postgraduate Seminars during their enrolment (these are held every Thursday during semester, the MCM RHD Community on the Learning Management System has details of the MCM Postgraduate Seminar). Students in Music Therapy attend seminars and intensive weekends over the period of their candidature. Students in Jazz & Improvisation and Interactive Composition should consult their discipline heads for seminar details.",
            "Disability:For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "PhD candidates are first admitted as 'probationary' candidates, except for those who have converted from a Masters by Research, or, in some cases, have transferred from another institution.",
                "Probationary Candidature (Musicology/Ethnomusicology, Composition, Music Therapy, Music Psychology and Performance Science)",
                "Probationary candidature is for a minimum of 9 months and a maximum of 12 months (or 18 and 24 months for part-time students) except where an extension is officially approved. During the probationary period the student's suitability for sustained independent work is assessed, and the Student's Confirmation Committee must be satisfied of the student's readiness for full PhD candidacy before recommending Confirmation.",
                "The Confirmation Report Form is sent to the candidate after 9 months (full-time) probationary candidature. A Committee comprising the the student's supervisor(s), and additional members of academic staff co-opted for the confirmation, meets to interview the candidate toward the end of the probationary period. The candidate may be required to verbally defend his or her written report to the Confirmation Committee, and the Committee will assess the feasibility and resource requirements of the proposed project and offer suggestions towards its successful completion.",
                "In the Melbourne Conservatorium of Music, confirmation is generally recommended when all of the following are satisfied:",
                [
                    "A precise thesis topic and a fully-developed thesis proposal has been submitted, presented to, and approved by the Confirmation Panel;",
                    "The candidate has attended an interview with their Confirmation Committee and satisfied the Committee that he or she is ready for full PhD candidacy.",
                    "The Committee will normally require the presentation of 10,000 words of the thesis or, in the case of Composition, the presentation of at least 30 minutes of music and at least 3,000 words of the dissertation component;",
                    "The Confirmation Committee is satisfied with the student's research aptitude and progress;",
                    "The candidate has attended the Melbourne Conservatorium of Music’s Postgraduate Seminar at least nine times."
                ],
                "Some students will be transferring from a Masters degree, where they will have met some of these requirements. Consequently, the probationary program for each PhD student is arranged individually according to the research training and background of the student.",
                "Probationary Candidature (Music Performance)",
                "In the Melbourne Conservatorium of Music, confirmation is generally recommended when all of the following are satisfied:",
                [
                    "A precise thesis topic and a fully-developed thesis proposal have been submitted, presented to, and approved by the Melbourne Conservatorium of Music’s Confirmation Panel;",
                    "The candidate has attended an interview with their Confirmation Committee and satisfied the Committee that he or she is ready for full PhD candidacy. In the case of Music Performance, the Committee will normally require the presentation of a CD or DVD of performance equivalent to a public recital of at least 70 minutes and at least 4000 words of the dissertation component. If a public recital is to be presented in support of confirmation, candidates may present in Melba Hall during the graduate performance assessment period in mid year or December. Audio-visual technical support will be available for recording the recital if required.",
                    "The candidate has attended the Melbourne Conservatorium of Music’s Postgraduate Seminar at least nine times."
                ],
                "Some students will be transferring from a Masters degree, where they will have met some of these requirements. Consequently, the probationary program for each PhD student is arranged individually according to the research training and background of the student.",
                "Probationary Candidature (Jazz & Improvisation, Interactive Composition)",
                "In the Melbourne Conservatorium of Music, confirmation is generally recommended when all of the following are satisfied:",
                [
                    "A precise thesis topic and a fully-developed thesis proposal have been submitted, presented to, and approved by the Confirmation Panel",
                    "The candidate has attended an interview with their Confirmation Panel and satisfied the Panel that s/he is ready for full PhD candidacy"
                ],
                "Confirmed Candidature (Musicology/Ethnomusicology, Music Therapy, Music Psychology and Performance Science)",
                "Once confirmed, a PhD candidate undertakes supervised work that leads to a thesis (of approximately 80,000 words). The thesis may be presented after two or three years of full-time study (four to six years part-time), depending on whether the student entered with a prior Masters degree. Candidates are required to present the findings of their research at the Postgraduate Seminar prior to submission.",
                "Confirmed Candidature (Composition)",
                "For the PhD (composition), the folio will constitute 90-120 minutes of music and is weighted at 70%. The accompanying dissertation will be 20-25,000 words and weighted at 30%.",
                "In addition to the consolidation of compositional output and engagement, this degree prepares composers for the demands and responsibilities of employment in the tertiary sector.",
                "Confirmed Candidature (Music Performance)",
                "Once confirmed, a PhD candidate undertakes supervised work that leads, in the case of the PhD (Music Performance), to a thesis normally of 20-25,000 words and a folio of performances in CD, DVD or other approved format equivalent to 3 full recitals or 210 minutes. The thesis and folio may be presented for examination after two or three years of full-time study (four to six years part-time), depending on whether the student entered with a prior Masters degree. Candidates are required to present the findings of their research in a Completion Seminar at the Conservatorium’s Postgraduate Seminar prior to submission.",
                "The thesis and folio must be presented in a form that can be sent for assessment by external examiners who are usually international. The performance folio therefore must consist of CDs and/or DVDs created during the candidature for the purposes of fulfilling the requirements of the PhD.",
                "Confirmed Candidature (Jazz & Improvisation, Interactive Composition)",
                "Once confirmed, a PhD candidate undertakes supervised work that leads to a thesis normally of 40,000-50,000 words and a folio of creative work in CD, DVD or other approved format. The thesis and folio may be presented for examination after two or three years of full-time study (four to six years part-time), depending on whether the student entered with a prior Masters degree. Candidates are required to present the findings of their research in a Completion Seminar at the Melbourne Conservatorium of Music prior to submission.",
                "The thesis and folio must be presented in a form that can be sent for assessment by external examiners who are usually international."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}