{
    "Course name": "Ph.D.- Engineering",
    "Course code": "351AA",
    "Overview text": [
        "There will be no further entry into this course. The course structure below only applies to re-enrolling students who commenced their studies prior to 2015.",
        "From 2016, refer to the DR-PHILENG: Doctor of Philosophy - Engineering.",
        "The degree of Doctor of Philosophy signifies that the holder has undertaken a substantial piece of original research, which has been conducted and reported by the holder under proper academic supervision and in a research environment for a prescribed period.",
        "The PhD thesis demonstrates authority in the candidate's field and shows evidence of command of knowledge in relevant fields. It shows that the candidate has a thorough grasp of the appropriate methodological techniques and an awareness of their limitations. The thesis also makes a distinct contribution to knowledge. Its contribution to knowledge rests on originality of approach and / or interpretation of the findings and, in some cases, the discovery of new facts. The thesis demonstrates an ability to communicate research findings effectively in the professional arena and in an international context. It is a careful, rigorous and sustained piece of work demonstrating that a research 'apprenticeship' is complete and the holder is admitted to the community of scholars in the discipline.",
        "In scope, the PhD thesis differs from a research Masters thesis chiefly by its deeper and more comprehensive treatment of the chosen subject. It is written succinctly, in English, unless approval has been given for the thesis to be written in a language other than English. The normal length of a PhD thesis is 80,000 words, exclusive of words in tables, maps, bibliographies, and appendices. Footnotes are included as part of the word limit. The thesis should not exceed 100,000 words (or equivalent) without special approval from the Research Higher Degrees Committee.",
        "A candidate will have appropriately experienced supervisor(s) and an Advisory Committee who in consultation with the candidate, arranges a course of supervised research designed to suit the individual requirements and interests of the candidate. A candidate may be required to supplement their research program by attendance at, or enrolment in, additional subjects if considered necessary by the supervisor(s). All students are required to attend departmental seminars over the period of their candidature.",
        "Duration",
        "The normal period of candidature is three years for full-time candidates with the possibility of two, six month extensions. All PhD candidates are required to complete a minimum of 12 months full-time research at the University in order to benefit from planning, conducting and writing up their research within a University community and environment. Normally the entire PhD is undertaken at the University. To be eligible to submit a thesis students must be enrolled in their course for the minimum period of 24 months full-time equivalent.",
        "Intake",
        "Students may commence a PhD at any time during the year subject to prior arrangement with their nominated supervisor.",
        "Graduate research students in the School of Engineering are required to enrol in coursework components. Enrolment in these coursework subjects is dependent on commencement in the PhD-Engineering prior to the first day of scheduled classes. Students are encouraged to enrol into their graduate research degree prior to Semester 1 or Semester 2 class commencement if they are intending on enrolling in coursework subjects in the corresponding semester.",
        "Please check with the relevant department prior to making any arrangements for enrolment or travel."
    ],
    "Overview table": {
        "Award title": "Doctor of Philosophy",
        "Year & campus": "2024",
        "CRICOS code": "056957F",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Research",
        "AQFlevel": "10",
        "Duration": "3 years full-time, or equivalent part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• A four-year bachelor degree in a relevant discipline which includes a substantial research component equivalent to at least 25% of one year of full-time study and have achieved a minimum weighted average of 75% in the final year subjects or (University of Melbourne) equivalentor• A masters degree in a relevant discipline which includes a substantial research component equivalent to at least 25% of one year of full-time study and achieved a minimum weighted average of 75% or (University of Melbourne) equivalentor• A qualification and professional experience considered to be equivalentand• A research proposal• Referee reports (except for applicants who have graduated from the University of Melbourne within the last 5 years)• The endorsement of a prospective supervisor.Meeting these requirements does not guarantee selection.2. In selecting applicants, the selection committee will consider applicants’:• Prior academic performance and, if relevant, professional qualifications• Understanding of the research question to be explored• Performance at an interview• The applicant’s motivation and capacity to complete the course in a timely manner• Relevant prior research and/or professional experience• The referee reports.3. The selection committee may seek further information to clarify any aspect of an application in accordance with the Selection and Admission into Graduate Research Courses Policy.4. The minimum English language requirements for this course are:Band 6.5.",
            "http://futurestudents.unimelb.edu.au/admissions/entry-requirements/language-requirements",
            "For more information on the application process seehttp://www.eng.unimelb.edu.au/study/research/"
        ],
        "Inherent requirements (core participation requirements)": [
            "All PhD candidates are required to complete the equivalent of at least 12 months full-time (24 months part-time) advanced study and research in the University unless studying at an outside institution approved by the Research Higher Degrees Committee (RHDC). The RHDC will not approve entirely distance supervision or entirely on-line supervision for research higher degree students.Throughout their candidature candidates are expected to attend the University in order to benefit from planning, conducting and writing up their research within a University community and environment.The residency requirement is deemed especially important during the period of probationary candidature. During probationary candidature the student is expected to interact on a regular basis with the supervisor, the department (including staff and other research students) and the University, so as: to build the skills and knowledge necessary to carry out the proposed research program to acquire an understanding of the standards and requirements for a PhD awarded by the University to make use of support programs and facilities provided by the Melbourne School of Graduate Research throughout candidature. It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability will impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser and the Disability Liaison."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Coursework Component",
                "All PhD students in the School of Engineering must complete two subjects from the approved lists below prior to confirmation. Students in the Department of Electrical and Electronic Engineering must complete two additional subjects after confirmation, which may be chosen outside of the Departmental list with additional approval.",
                "Awarding of Final Mark & Grade",
                "Students must successfully complete the required coursework component in order to be awarded the PhD-Engineering. Where there is a coursework component the final mark and grade for the degree is the mark and grade awarded for the PhD thesis."
            ]
        },
        "Subject options": {
            "overview": [
                "All students in the School of Engineering must complete two subjects from the approved lists below prior to confirmation. Students in the Department of Electrical and Electronic Engineering must complete two additional subjects after confirmation, which may be chosen outside of the Departmental list with additional approval.",
                "If a student does not have sufficient background in the subjects or their area of research, they may be required by the supervisory panel to take preliminary undergraduate subjects or complementary subjects such as ‘LING90002 Presenting Academic Discourse’ or ‘MAST90007: Statistics for Research Workers’. Preliminary undergraduate and complementary subjects will not count towards the postgraduate level coursework requirement for 351AA PhD-Engineering.",
                "Students in the following Departments may select subjects from the complete list below;• Chemical and Biomolecular Engineering• Computing and Information Systems• Infrastructure Engineering• Mechanical Engineering",
                "Graduate/Postgraduate subjects NOT listed below may be selected in consultation with the student’s supervisor and are subject to the endorsement of the subject coordinator and Head of Department.",
                "Students in Electrical and Electronic Engineering must select from the Electrical and Electronic Engineering list.",
                "Subjects Available:"
            ]
        },
        "Biomedical Engineering": {
            "overview": [
                [
                    "BMEN90002",
                    "BMEN90004",
                    "BMEN90011",
                    "BMEN90012",
                    "BMEN90021",
                    "BMEN90022",
                    "ELEN90071"
                ]
            ]
        },
        "Chemical and Biomolecular Engineering": {
            "overview": [
                [
                    "BIEN90004",
                    "BMEN90011",
                    "BMEN90012",
                    "CHEN90007",
                    "CHEN90010",
                    "CHEN90011",
                    "CHEN90012",
                    "CHEN90018",
                    "CHEN90019",
                    "CHEN90027",
                    "CHEN90031",
                    "CHEN90032",
                    "CHEN90034",
                    "CHEN90035",
                    "CHEN90036",
                    "ENGR90024",
                    "FOOD90029"
                ]
            ]
        },
        "Computing and Information Systems Engineering": {
            "overview": [
                [
                    "BINF90002",
                    "COMP90007",
                    "COMP90014",
                    "COMP90015",
                    "COMP90016",
                    "COMP90017",
                    "COMP90018",
                    "COMP90019",
                    "COMP90020",
                    "COMP90024",
                    "COMP90025",
                    "COMP90038",
                    "COMP90041",
                    "COMP90042",
                    "COMP90043",
                    "COMP90044",
                    "COMP90045",
                    "COMP90046",
                    "COMP90048",
                    "COMP90049",
                    "COMP90050",
                    "COMP90051",
                    "COMP90054",
                    "COMP90057",
                    "COMP90058",
                    "GEOM90018",
                    "GEOM90042",
                    "INFO90001",
                    "INFO90002",
                    "ISYS90026",
                    "ISYS90031",
                    "ISYS90032",
                    "ISYS90034",
                    "ISYS90035",
                    "ISYS90036",
                    "ISYS90037",
                    "ISYS90038",
                    "ISYS90040",
                    "ISYS90043",
                    "ISYS90045",
                    "ISYS90048",
                    "ISYS90049",
                    "ISYS90050",
                    "ISYS90051",
                    "ISYS90052",
                    "ISYS90055",
                    "ISYS90068",
                    "ISYS90069",
                    "ISYS90076",
                    "ISYS90077",
                    "ISYS90078",
                    "ISYS90085",
                    "ISYS90086",
                    "SKIL90004",
                    "SWEN90002",
                    "SWEN90004",
                    "SWEN90006",
                    "SWEN90007",
                    "SWEN90009",
                    "SWEN90010",
                    "ISYS90070"
                ]
            ]
        },
        "Infrastructure Engineering": {
            "overview": [
                [
                    "CVEN90016",
                    "CVEN90017",
                    "CVEN90018",
                    "CVEN90019",
                    "CVEN90024",
                    "CVEN90026",
                    "CVEN90027",
                    "CVEN90035",
                    "CVEN90043",
                    "CVEN90044",
                    "CVEN90048",
                    "CVEN90050",
                    "ENEN90005",
                    "ENEN90006",
                    "ENEN90011",
                    "ENEN90014",
                    "ENEN90027",
                    "ENEN90028",
                    "ENEN90029",
                    "ENEN90030",
                    "ENEN90031",
                    "ENEN90032",
                    "ENEN90033",
                    "ENEN90034",
                    "ENGM90006",
                    "ENGM90007",
                    "ENGR90026",
                    "GEOM90005",
                    "GEOM90006",
                    "GEOM90007",
                    "GEOM90008",
                    "GEOM90015",
                    "GEOM90016",
                    "GEOM90018",
                    "GEOM90033",
                    "GEOM90038",
                    "GEOM90039",
                    "GEOM90040",
                    "GEOM90041",
                    "GEOM90042"
                ]
            ]
        },
        "Mechanical Engineering": {
            "overview": [
                [
                    "ELEN90064",
                    "ENGR90019",
                    "ENGR90020",
                    "ENGR90024",
                    "ENGR90026",
                    "MCEN90017",
                    "MCEN90018",
                    "MCEN90019",
                    "MCEN90020",
                    "MCEN90023",
                    "MCEN90027",
                    "MCEN90028",
                    "MCEN90029",
                    "MCEN90031",
                    "MCEN90032",
                    "ENGM90015"
                ]
            ]
        },
        "Graduate School of Science": {
            "overview": []
        },
        "School of Botany": {
            "overview": [
                [
                    "BIOL90001"
                ]
            ]
        },
        "School of Chemistry": {
            "overview": [
                [
                    "CHEM90009",
                    "CHEM90010",
                    "CHEM90017",
                    "CHEM90018"
                ]
            ]
        },
        "Department of Mathematics and Statistics": {
            "overview": [
                "Students are permitted to undertake the Department of Mathematics and Statistics, Masters level Mathematics and Statistics subjects listed below.",
                [
                    "MAST90011",
                    "MAST90012",
                    "MAST90013",
                    "MAST90014",
                    "MAST90017",
                    "MAST90019",
                    "MAST90020",
                    "MAST90023",
                    "MAST90025",
                    "MAST90026",
                    "MAST90027",
                    "MAST90029",
                    "MAST90030",
                    "MAST90031",
                    "MAST90045",
                    "MAST90050",
                    "MAST90051",
                    "MAST90053",
                    "MAST90056",
                    "MAST90057",
                    "MAST90058",
                    "MAST90059",
                    "MAST90060",
                    "MAST90064",
                    "MAST90065",
                    "MAST90067",
                    "MAST90068",
                    "MAST90069",
                    "MAST90080",
                    "MAST90081",
                    "MAST90082",
                    "MAST90083",
                    "MAST90084",
                    "MAST90085"
                ]
            ]
        },
        "School of Physics": {
            "overview": [
                [
                    "PHYC90006",
                    "PHYC90007"
                ]
            ]
        },
        "Electrical and Electronic Engineering": {
            "overview": [
                "Electrical and Electronic Engineering students may select subjects from the list below;",
                "Subjects Available:",
                [
                    "BMEN90004",
                    "ELEN90017",
                    "ELEN90018",
                    "ELEN90022",
                    "ELEN90026",
                    "ELEN90027",
                    "ELEN90028",
                    "ELEN90030",
                    "ELEN90031",
                    "ELEN90071",
                    "ELEN90072",
                    "ELEN90076",
                    "ELEN90078",
                    "ELEN90084"
                ],
                "Graduate/Postgraduate subjects NOT listed above may be selected in consultation with the student’s supervisor and are subject to the endorsement of the subject coordinator and Head of Department."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}