{
    "Course name": "Professional Certificate in Leadership",
    "Course code": "PR-LDSHIP",
    "Overview text": [
        "Rapid change and complexity are increasingly inherent to industry and organisations. Managers of today and tomorrow need to navigate this complexity, make agile decisions, lead the right change, do more with less, and enable their teams to achieve their best performance.",
        "The Professional Certificate in Leadership equips managers from across diverse industries to be high performers. This program develops the core competencies of contemporary management and leadership:",
        "The Professional Certificate in Leadership is delivered online to meet the needs of busy working professionals to study where and how they want, to connect with faculty and industry experts, and to network with their cohort.",
        "Last updated: 13 August 2024"
    ],
    "Overview table": {
        "Award title": "Professional Certificate in Leadership",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline or equivalent; and",
            "a minimum of three years of documented relevant professional experience; and",
            "a 500 word personal statement outlining why they wish to be considered for the course.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the professional experience; and",
            "the personal statement.",
            "3.The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments.",
            "4.Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required",
            "NOTE: Applicants who have completed the specified Melbourne MicroCerts listed below, will be eligible for advanced standing for Managing Teams (MGMT90265)orAdaptive Leadership (MGMT90264):",
            "MGMT90265 Managing Teams",
            "Effective Leadership Communication",
            "Leading Teams",
            "Effective Negotiation",
            "Performance Management",
            "MGMT90264 Adaptive Leadership",
            "Personal effectiveness",
            "Ethical Judgement",
            "Creativity & Innovation",
            "Leading Change"
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "This course comprises two x 12.5 point compulsory online subjects.",
                "Students must take the following two subjects:",
                "Core subjects (25 points)",
                [
                    "MGMT90264",
                    "MGMT90265"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Successful completion of the Professional Certificate in Leadership will provide the basis for advanced standing and a pathway into the Master of Professional Management."
    ]
}