{
    "Course name": "Professional Certificate in Innovation Practice",
    "Course code": "PR-INVPRAC",
    "Overview text": [
        "The Professional Certificate in Innovation Practice is offered to project mentors in ENGR90034 Creating Innovative Engineering (CIE), ENGR90039 Creating Innovative Professionals (CIP) and equivalent subjects. The core of these subjects involves teams of four to six students working alongside an independent mentor, or a mentor and a sponsor from a sponsoring organisation, to elaborate an innovation opportunity.",
        "This certificate provides a unique opportunity for candidates to develop the management, coaching and leadership skills required to guide innovation projects and take the next step in their careers.  During this certificate, participants learn about strategic and operational considerations in generating innovative products and services.  They also develop the leadership skills to guide teams that are innovating.",
        "There are two pathways through the certificate.  Either candidates can participate in an innovation team in CIE or CIP, and then complete the subject Leadership for Innovation (ENGR90036).  Alternatively, the two broad domains of the program – innovation and leadership for innovation – are delivered together as one subject (ENGM90017).",
        "In terms of innovation management, you will learn and facilitate the application of a human-centred design approach to an innovation project.  Along with your team, you will refine a project brief, design research, conduct interviews, generate insights, create a problem statement, generate proposals that respond to that problem statement and then, select, refine, hopefully test, and finally pitch a proposal.  Because you will be responsible for ensuring that the team delivers a good outcome, you will find that you need to develop a solid understanding of the human-centred innovation process.",
        "In terms of leadership, you will be in a unique position to learn how to become a great leader.  Your team is likely to be ethnically and professionally very diverse.  The project tasks will be well outside the prior experience of the members.  Furthermore, there will be no need to “manage” the team.  That is, rather than tell them what to do, you will use leadership behaviours such as facilitation, coaching, teaching, and so forth to move them in the desired direction.   However, we will give you instruction and support to create a psychologically safe environment in which you can learn.  Also, by writing a weekly reflection and giving feedback to a peer on their weekly reflection, you will learn mindfully and thoughtfully about yourself as a leader.",
        "The leadership program begins with a two-day intensive workshop in which you will be introduced to four fundamental leadership themes: adaptive leadership, authentic leadership, innovation leadership, and the leader as coach.  Over the twelve weeks of the semester you will generally learn a new skill each week, the underlying theory to support that skill, and you will have a chance to apply the skill with your team that week.  We aim to have you see yourself as a leader, understand what it means to be a leader, and have the skills to put that understanding into practice.",
        "Students may accrue up to 12.5 points towards the Certificate as part of their master’s degree, either as ENGR90034 (Creating Innovative Engineering) or ENGR90039 (Creating Innovative Professionals).",
        "Candidates who successfully complete the Professional Certificate of Innovation Practice with a grade of 75% or greater, and who are admitted to the Master of Business Administration or the Master of Enterprise, may apply for two subjects (25 points) of credit towards that qualification.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Professional Certificate in Innovation Practice",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have:",
            "- Completed an undergraduate degree or equivalent;or",
            "- At least 5 years of full-time documented relevant work experience; and;",
            "- Applicants will only be considered for entry to this course if they can demonstrate that they have been (or will be) nominated by a project sponsor to mentor a team in Creating Innovative Engineering (ENGR90034) or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "- Prior academic performance; and",
            "- Documented relevant professional experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band IELTS 6.0 is required.",
            "Notes: Students may accrue up to 12.5 points towards the Certificate as part of their master’s degree, either as ENGR90034 (Creating Innovative Engineering) or ENGR90039 (Creating Innovative Professionals)."
        ],
        "Inherent requirements (core participation requirements)": [
            "Candidates must be committed to attend a minimum of 80% of sessions during the program, in order to work with their teams and the other candidates effectively.  Any absences must be explained in writing to the Program Coordinator.",
            "The Professional Certificate in Innovation Practice welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the degree.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Commonwealth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with the Student Equity and Disability Support Team:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The certificate is comprised of either a single compulsory subject totalling 25 credit points, or two separate subjects totalling 25 credit points.",
                [
                    "ENGM90017"
                ],
                [
                    "ENGR90036"
                ],
                "AND one of the following:",
                [
                    "ENGR90034",
                    "ENGR90039"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}