{
    "Course name": "Professional Certificate in Education (CLIL)",
    "Course code": "GC-EDCLIL",
    "Overview text": [
        "The Professional Certificate in Education (CLIL) will introduce teachers to the pedagogical issues that impinge on the success of content and integrated language learning (CLIL). Its focus is on the general pedagogical principles and practice entailed in teaching content through a second or foreign language, and an understanding of the linguistic, sociolinguistic, cultural and cross-cultural issues that impinge on the success of such courses."
    ],
    "Overview table": {
        "Award title": "Professional Certificate in Education (CLIL)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "either",
            "an appropriate undergraduate degree and an appropriate fourth-year level education qualification, or equivalent, or\n",
            "an appropriate four-year education degree, or equivalent;",
            "and",
            "at least one year of documented relevant professional experience in a content area.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the professional experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs.The core participation requirements for study in the Faculty of Education are:In all courses1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching.2. The ability to communicate clearly and independently in assessment tasks a knowledge of the content, principles and practices relating to education and other relevant disciplines.3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact Student Equity and Disability Support:https://students.unimelb.edu.au/student-support/student-equity-and-disability-support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students complete 25 points of study."
            ]
        },
        "Subject options": {
            "overview": [
                "The Professional Certificate in Education (CLIL) is comprised of two compulsory subjects:",
                [
                    "EDUC90481",
                    "EDUC90482"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of other graduate coursework programs."
    ]
}