{
    "Course name": "Professional Certificate in Language Assessment",
    "Course code": "PR-LANGASS",
    "Overview text": [
        "This course will introduce students to the key issues in language assessment, both in the classroom and in other settings. Students will receive a thorough grounding in the assessment of the different language skills (such as listening, reading, writing and speaking) and get practical experience in developing and evaluating assessments for second and foreign language learners in different contexts."
    ],
    "Overview table": {
        "Award title": "Professional Certificate in Language Assessment",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have:",
            "completed an undergraduate degree or equivalent, or",
            "at least 5 years of full-time documented relevant professional experience.",
            "Meeting this requirement does not guarantee selection.",
            "1. In ranking applications, the Selection Committee will consider:",
            "prior academic performance, and",
            "the professional experience.",
            "1. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.\n",
            "2. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Students will be required to complete two compulsory 12.5 credit point subjects, which involve participation in online learning.",
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The subjects need to be taken in the following order:",
                [
                    "1. LING90038 General Concepts in Language Assessment",
                    "2. LING90037 Language Assessment for Learning"
                ],
                "Two compulsory subjects (25 points total):",
                [
                    "LING90038",
                    "LING90037"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who successfully complete the Professional Certificate in Language Assessment may be eligible to undertake further study in the Masters of Applied Linguistics, if they meet the entry requirements for the Master of Applied Linguistics."
    ]
}