{
    "Course name": "Professional Certificate in Supply Chain Management",
    "Course code": "PR-SCM",
    "Overview text": [
        "This course provides knowledge and capability of the core foundations of Supply Chain Management, in terms of the key frameworks and methods of design, modelling and analysis, required to professionally design run and improve supply chains. Benefits include the ability to set up supply chains and to operate and improve them so as to maximise their effectiveness. This includes capability to link the core elements of supply chain design and realise the value from coordinating supply with demand involving networks of organisations that collaborate to maximise their potential beneficial outcomes.  Key decisions can involve capacity, technology, inventory, network design, scheduling and planning, supply chain relationships, facility location and other elements. Source of uncertainty and disruption are included in the decision-making frameworks. Outcomes include cost, quality, delivery, flexibility and agility.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Professional Certificate in Supply Chain Management",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree or equivalent; and\n",
            "a minimum of at least 2 years of full-time documented professional experience (preferably some of which is in a supply chain, logistics or procurement role); or\n",
            "professional experience of at least 5 years of full-time documented relevant work experience (preferably some of which is in a supply chain, logistics or procurement role).",
            "Meeting these requirements does not guarantee selection.",
            "2.In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and/or",
            "the professional experience.",
            "3.The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic BoardRuleson the use of selection instruments.",
            "4.Applicants are required to satisfy the university’sEnglish language requirementsfor graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Professional Certificate in Supply Chain Management welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance the student’s participation in the degree.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Commonwealth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the University’s programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser andStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "This course comprises four x 6.25 point compulsory online subjects.",
                [
                    "MGMT90257",
                    "MGMT90256",
                    "MGMT90255",
                    "MGMT90258"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}