{
    "Course name": "Professional Certificate in Treaty",
    "Course code": "PR-TREATY",
    "Overview text": [
        "The Professional Certificate in Treaty will equip learners with advanced knowledge and skills for working at the interface between government, the private and public sectors and First Nations and self-determining Indigenous organisations in Victoria, and potentially across other Australian jurisdictions in the future.",
        "The course develops knowledge, skills and dispositions towards understanding Australian Indigenous politics, treaty and rights through multiple learning opportunities that meet the needs of key stakeholders involved in treaty processes.",
        "Last updated: 5 July 2024"
    ],
    "Overview table": {
        "Award title": "Professional Certificate in Treaty",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.In order to be considered for entry, applicants must have completed one of:",
            "1. an undergraduate degree or equivalent; OR",
            "2. at least 5 years of full-time relevant, documented professional or work experience (paid and/or voluntary) in areas such as public service or government (local, state/territory, federal) sector or the non-government sector or private organisation; OR",
            "3. at least 3 years of full-time relevant, documented professional or work experience [paid and/or voluntary in areas as specified above in (2)] AND completion of at least three Melbourne MicroCerts in the Preparing for Treaty series OR the Self-Determination and Community Services series; OR",
            "4. an Indigenous person with an interest, or engagement, in treaty process and completion of at least three Melbourne MicroCerts in Preparing for Treaty series OR Self-Determination and Community Services series. This interest and/or engagement in treaty process should be described as part of the 400 word personal statement (see below).",
            "All applicants must submit an additional 400-word personal statement outlining why they want to be considered, what relevant experience they bring, and how and where they will apply the learning outcomes.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the professional or work experience (paid and/or voluntary); and",
            "the personal statement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board Rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Note:",
            "Applicants who have successfully completed four Melbourne MicroCerts listed below, will be eligible for advanced standing for ARTS90034 Indigenous Treaties & Future Relations:",
            "Students must complete the following two Melbourne Microcerts:",
            "And two from the following list:",
            "Nationhood and Self Determination",
            "Stolen Generations, Truth-Telling and Treaty."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "This programs consists of 25 points of compulsory subjects at level 9.",
                "The course is a 25 credit point program comprised of two compulsory subjects:",
                [
                    "ARTS90034",
                    "ARTS90035"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}