{
    "Course name": "Professional Certificate in Indigenous Research",
    "Course code": "GC-IRPRO",
    "Overview text": [
        "The Professional Certificate in Indigenous Research is an interdisciplinary coursework program consisting of one core subject - MULT90022: Indigenous Research.",
        "The course explores research and develops research skills from an Indigenous perspective. The course is taught in a mixed mode of seminars, case studies, and group activities, with an emphasis on collaborative learning. Students engage in a range of activities, including structured reflection, academic writing, and formal verbal presentations. Students’ assessment tasks relate directly to their own research.",
        "Upon satisfactory completion of the course, students are awarded a Professional Certificate in Indigenous Research, which will give them 25 credit points towards the Graduate Certificate in Indigenous Research and Leadership."
    ],
    "Overview table": {
        "Award title": "Professional Certificate in Indigenous Research",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must:",
            "be currently enrolled in a Research Higher Degree course at Masters level or above; and",
            "provide a written statement of support from the applicant’s principal research project supervisor; and",
            "confirm eligibility as an Aboriginal and/or Torres Strait Islander applicant; and",
            "submit an expression of interest via the link below.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the written statement of support.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAcademic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 6.5is required.",
            "Note:",
            "Prospective applicants submit an expression of interest before lodging a formal course application. See:https://study.unimelb.edu.au/find/courses/graduate/professional-certificate-in-indigenous-research/"
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), andAssessment and Results Policy (MPF1326), academic requirements for this course are articulated in the Course Overview, Intended Learning Outcomes and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this with Student Equity and Disability Serviceshttps://students.unimelb.edu.au/student-support/student-equity-and-disability-services."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Professional Certificate in Indigenous Research (GC-IRPRO) is a single-subject 25-point award. At the completion of this compulsory subject students will be awarded a Professional Certificate in Indigenous Research, which will give them 25 credit points towards the Graduate Certificate in Indigenous Research and Leadership (GC-IRL)."
            ]
        },
        "Subject options": {
            "overview": [
                "Students must complete the following CORE subject:",
                [
                    "MULT90022"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}