{
    "Course name": "Professional Certificate in Educational Neuroscience",
    "Course code": "PR-EDNEURO",
    "Overview text": [
        "This course will explore the emerging fields of Educational Neuroscience and The Science of Learning. Particular focus will be on how an understanding of the mechanisms of learning can inform and improve pedagogical practice and learning outcomes. The course will provide students with a broad understanding of the scientific method, the application of that method to the design, delivery and evaluation of learning interventions, along with the neural and cognitive mechanisms which underpin learning.",
        "Specifically, students will learn how neuroscience and psychology can, and can not be, successfully translated into classroom practice. More generally, students will also learn key scientific principles, and so be equipped with the skills to evaluate the validity of educational, psychological and neuroscientific research. These skills will allow students to become informed consumers of commercial educational products and methods, and enable them to critically reflect on their own teaching philosophies and practices."
    ],
    "Overview table": {
        "Award title": "Professional Certificate in Educational Neuroscience",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate degree in any discipline.",
            "Meeting this requirement does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance",
            "professional experience/s",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Faculty of Education welcomes applications from students with disabilities. It is University and Faculty policy to take reasonable steps to enable the participation of students with disabilities, and reasonable adjustments will be made to enhance a student’s participation in the Faculty’s programs. The core participation requirements for study in the Faculty of Education are:In all courses1. The ability to comprehend complex information related to education and the disciplines in which the student is teaching.2. The ability to communicate clearly and independently in assessment tasks knowledge of the content, principles and practices relating to education and other relevant disciplines.3. Behavioural and social attributes that enable a student to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact Student Equity and Disability Support:https://students.unimelb.edu.au/student-support/student-equity-and-disability-support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The course comprises two compulsory subjects which must be taken in the following order:",
                [
                    "1. EDUC90872 Foundations of the Science of Learning",
                    "2. EDUC90873 Brain, Mind and Education"
                ],
                "This course is only available part time."
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "EDUC90872",
                    "EDUC90873"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of other graduate coursework programs."
    ]
}