{
    "Course name": "Specialist Certificate in Criminology (Offender Management)",
    "Course code": "SC-CRIMOM",
    "Overview text": [
        "THIS COURSE IS NOT TAKING APPLICATIONS FOR 2023.",
        "This course, taught through two four-day intensive subjects, is designed for professionals who work with complex and difficult offender populations, including those who have committed sexual and violent offences. It has been designed to give students the requisite knowledge about risk of reoffending, how to meet offender needs, and their effective management.",
        "The course is comprised of two subjects (an Introductory subject in June and an Advanced subject in November), both of which must be completed in order to receive theSpecialistCertificate in Criminology (Offender Management)."
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Criminology (Offender Management)",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:• either– an undergraduate degree with a major area of study related to psychology, criminology or a cognate social science discipline, or– an undergraduate degree in any discipline, and at least one year of documented relevant professional work experience, or– at least three years of documented relevant professional work experience which demonstrates the capacity to successfully undertake the course.Meeting these requirements does not guarantee selection.2. In ranking and/or assessing applications, the Selection Committee will consider:• prior academic qualification and performance; and/or• the professional experience.3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Specialist Certificate in Criminology (Offender Management) welcomes applications from students with disabilities. It is University and degree policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance the student’s participation in the degree.",
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Commonwealth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Overview, Objectives and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student’s participation in the University’s programs. Students who feel their disability may impact on meeting the requirements of this course are encouraged to discuss this matter with a Faculty Student Adviser and the Disability Liaison Unit:http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete 2 core subjects listed below. Students must attend all sessions of the course unless a specific exemption is granted by the program coordinator.",
                [
                    "CRIM90022",
                    "CRIM90023"
                ]
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                [
                    "CRIM90022",
                    "CRIM90023"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who complete the Graduate Certificate are eligible to apply for the Master of Criminology with advanced standing of 25 points.",
        ""
    ]
}