{
    "Course name": "Specialist Certificate in Health and Human Services",
    "Course code": "SC-HHS",
    "Overview text": [
        "The Specialist Certificate in Health and Human Services is designed to graduate advanced practitioners in the health and human service fields.",
        "The subjects in this course adopt an interdisciplinary, international and evidence-based approach to respond to the complex and growing challenges faced by health and human service workers working in a range of health, mental health and human services fields.",
        "Subjects are taught by leading academics in the fields of evidence-based research, health, mental health, child and family welfare, ageing, social policy, program evaluation and leadership. Students from around the globe will be provided with opportunities to work together to address the increasing challenges and opportunities in the health and human services fields.",
        "The course requires completion of a total of 25 credit points of study. The course is provided entirely on-line providing flexibility to design study times around other commitments and study preferences.",
        "This course is designed to be available to health and human service workers at different stages in their careers, including recent graduates, established practitioners and those seeking to move in new directions.",
        "Last updated: 1 August 2024"
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Health and Human Services",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate qualification related to a health or human services field; and",
            "at least two years of documented, relevant work experience; and",
            "a personal statement outlining why they wish to be considered for the course; and",
            "nomination of a professional referee.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "work experience; and",
            "the personal statement;",
            "the referee report.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Student Support and Engagement Policy, academic requirements for this subject are articulated in the Subject Overview, Learning Outcomes, Assessment and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support:https://services.unimelb.edu.au/student-equity"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Specialist Certificate in Health and Human Services is comprised of two 12.5 credit point, AQF Level 9 subjects."
            ]
        },
        "Subject options": {
            "overview": [
                "Students can select from the following subjects:",
                [
                    "SCWK90027",
                    "SCWK90067",
                    "SCWK90068",
                    "POPH90267",
                    "HLTH90003",
                    "HLTH90007",
                    "HLTH90008",
                    "HLTH90009",
                    "HLTH90018"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to a range of other graduate coursework programs, including the Graduate Certificate in Health and Human Services or the Master of Health and Human Services."
    ]
}