{
    "Course name": "Specialist Certificate in Anterior and Dry Eye Disorders",
    "Course code": "SC-ADED",
    "Overview text": [
        "THIS COURSE IS NOT TAKING APPLICATIONS FOR 2024.",
        "The Specialist Certificate in Anterior and Dry Eye Disorders offered by the Department of Optometry & Vision Sciences in the Faculty of Medicine, Dentistry & Health Sciences will allow optometrists to advance their clinical capabilities in the day-to-day management of eye disease by affording them the opportunity to review the most current theories on the pathophysiology, diagnosis and management of anterior eye disease, including dry eye. The subject will provide optometrists with the tools necessary to develop a deeper, evidence-based understanding of anterior eye disease, including dry eye, thus empowering them to improve their clinical skills."
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Anterior and Dry Eye Disorders",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applications must have completed: ",
            "a four-year undergraduate degree in Optometry, or equivalent or;",
            "professional experience deemed by the Selection Committee to be equivalent to a four-year Australian degree in Optometry ",
            "Meeting this requirement does not guarantee selection",
            "1.  In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and, if relevant",
            "any documented relevant professional experience. ",
            "1. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instructions. ",
            "1. Applicants are required to satisfy the university’s English language requirements for postgraduate courses.  For those applications seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Student Support and Engagement Policy, academic requirements for this subject are articulated in the Subject Overview, Learning Outcomes, Assessment and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support:http://services.unimelb.edu.au/disability"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "All students must complete one core subject;",
                [
                    "OPTO90006 Anterior Eye Disease and Dry Eye (formerly Management of Anterior Eye Disease) - 25 credit points"
                ]
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "OPTO90006"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who have completed this course may be awarded 25 credit points of advanced standing towards theMaster of Clinical Optometry."
    ]
}