{
    "Course name": "Specialist Certificate in Legal Leadership",
    "Course code": "SC-LGLLEAD",
    "Overview text": [
        "This unique qualification is a graduate leadership development program tailored for mid-career legal professionals. It comprises specific leadership and management capability-building subjects for those working in legal organisations. The program design is highly flexible, allowing participants considerable autonomy to customise study for their development needs.",
        "The program offers learning opportunities for legal professionals seeking to extend their business, communication, managerial and leadership skills and knowledge. Subjects are offered intensively in an executive education format to assist those with competing time commitments."
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Legal Leadership",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "Start Year intake 2024",
            "1. In order to be considered for entry, applicants must have completed:",
            "a degree in law (LLB, JD or equivalent) leading to admission to practice, or equivalent; and ",
            "two years of documented relevant professional experience. ",
            "or",
            "a three-year undergraduate degree or equivalent in any discipline area; and · ",
            "five years of documented relevant professional experience; and   ",
            "a personal statement of up to 500 words outlining why you wish to be considered for this course. ",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; ",
            "Relevant professional experience; and ",
            "Personal statement (for relevant applicants) ",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Mid-year Intake 2024",
            "1. In order to be considered for entry, applicants must have completed:",
            "a degree in law (LLB, JD or equivalent) leading to admission to practice, or equivalent; and",
            "two years of documented relevant professional experience.",
            "or",
            "a three-year undergraduate degree or equivalent in any discipline area; and ",
            "five years of documented relevant professional experience; and  ",
            "a personal statement of up to 500 words outlining why you wish to be considered for this course.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance;",
            "Relevant professional experience; and",
            "Personal statement (for relevant applicants)",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7.0 overall with no band less than 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The inherent academic requirements for study in the Legal Leadership Program are:",
            "The ability to attend all classes and actively engage in the analysis and critique of complex materials and debate;",
            "The ability to read, analyse and comprehend complex case studies and written materials;",
            "The ability to clearly and independently communicate in writing a knowledge and application of legal leadership principles and to critically evaluate these;",
            "The ability to clearly and independently communicate orally a knowledge and application of legal leadership principles and critically evaluate these;",
            "The ability to work independently and as a part of a group; and",
            "The ability to present orally and in writing analysis to a professional standard.",
            "The Melbourne Law School welcomes applications from students with disabilities. Students who feel their disability will inhibit them from meeting these inherent academic requirements are encouraged to contactStudent Equity and Disability Support."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "For the Specialist Certificate in Legal Leadership, students must complete 25 credit points of core subjects.",
                [
                    "LAWS90226",
                    "LAWS70350"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}