{
    "Course name": "Specialist Certificate in Clinical Ultrasound (Practical)",
    "Course code": "SC-CLINUSP",
    "Overview text": [
        "Clinical ultrasound (also referred to as ultrasound assisted examination, ultrasound guided procedures, bedside-, goal-focused-, focused-, point-of-care- and limited-ultrasound) improves clinical evaluation of patients and can be used to help guide procedures. Clinical Ultrasound is becoming widely accepted as a core component of clinical practice in health care. The Specialist Certificate in Clinical Ultrasound (Practical) equips students with the fundamental knowledge essential to the practice of clinical ultrasound (in the core subject) and equips students with both the practical and interpretive skills required to perform clinical ultrasound in a chosen ultrasound modality or modalities specific to the health-care speciality of the student through the practical elective subjects. The course also delivers the knowledge required to integrate these skills into clinical assessment and management of patients. The course provides knowledge on the process required for further study for those who wish to satisfy training requirements with their speciality college or credentialing body.",
        "The Specialist Certificate in Clinical Ultrasound (Practical) contains elective ultrasound subjects designed for, but not limited to, health care professionals practicing in the areas of critical care (intensive care medicine, emergency medicine, anaesthesia), additional surgical and medical specialities, primary care health care, junior doctors, nursing and nursing subspecialties, physiotherapists, and paramedics.",
        "The course structure consists of online learning, interpretation of online ultrasound cases of a wide range of pathology specific to the elective subjects, and practical experience using a combination of practice on ultrasound simulators and maintaining a log-book of ultrasound examinations on patients."
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Clinical Ultrasound (Practical)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.  In order to be considered for entry, applicants must have completed:",
            "a Doctor of Medicine or a Bachelor of Medicine/Bachelor of Surgery (MBBS) or equivalent, or",
            "an undergraduate degree or equivalent in allied health, nursing, physiotherapy, or science.",
            "Meeting this requirement does not guarantee selection.",
            "2.In ranking applications, the Selection Committee will consider:",
            "prior academic qualification, and performance",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 7is required.",
            "NoteThe Specialist Certificate in Clinical Ultrasound (Practical) has a quota and offers are sent out on a rolling basis.The quota may be reached before the application closing date."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/",
            "Please note: Participants must be able to use their upper limbs to operate the simulator and ultrasound machines"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "This course will consist of one core subject (6.25 credits) and additional three elective subjects (each 6.25 credits). The core subject will cover the fundamentals of clinical ultrasound, which provides the necessary background for completing the elective (‘specialist’) subjects."
            ]
        },
        "Subject options": {
            "overview": [
                "To satisfy the requirements of the Specialisation Certificate in Clinical Ultrasound student must successfully complete a total of 25 points.",
                [
                    "One compulsory subject (6.25 points)",
                    "Three elective subjects (totalling 18.75 points)"
                ],
                "Compulsory Subject",
                [
                    "MEDI90129"
                ],
                "Elective Subjects",
                [
                    "MEDI90130",
                    "MEDI90131",
                    "MEDI90132",
                    "MEDI90133",
                    "MEDI90134",
                    "MEDI90135",
                    "MEDI90136",
                    "MEDI90137",
                    "MEDI90138",
                    "MEDI90139",
                    "MEDI90140",
                    "MEDI90141",
                    "MEDI90142",
                    "MEDI90143",
                    "MEDI90144",
                    "MEDI90145"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}