{
    "Course name": "Specialist Certificate in Service Navigation",
    "Course code": "SC-SERVNAV",
    "Overview text": [
        "The Specialist Certificate in Service Navigation is designed for graduate advanced practitioners in the health and human service fields.",
        "The certificate includes a compulsory subject Service Navigation Theory coupled with a field of practice elective which will align with the student's interest. Service Navigation is a new paradigm influencing and changing the way services are delivered to consumers of health and welfare services.",
        "Subjects are taught by leading academics in the fields of evidence-based research, health, mental health, child and family welfare, ageing, social policy, program evaluation and leadership. Students from around the globe will be provided with opportunities to work together to address the increasing challenges and opportunities in the health and human services fields.",
        "The course requires completion of a total of 25 credit points of study. The course is provided entirely on-line providing flexibility to design study times around other commitments and study preferences.",
        "This course is designed for health and human service workers at different stages in their careers, including recent graduates, established practitioners and those seeking to move in new directions.",
        "Last updated: 1 August 2024"
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Service Navigation",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate qualification related to a health and human services field.",
            "at least two years of documented, relevant work experience.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "the work experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with theAcademic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providing support to those with special requirements. Further details on the disability support scheme can be found at the Student Equity and Disability Support website.http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "One compulsory subject (HLTH90010 Service Navigation Theory) and one elective subject."
            ]
        },
        "Compulsory Subject": {
            "overview": [
                [
                    "HLTH90010"
                ]
            ]
        },
        "Electives": {
            "overview": [
                [
                    "SCWK90027",
                    "POPH90267",
                    "HLTH90003",
                    "HLTH90009",
                    "HLTH90008",
                    "HLTH90007",
                    "HLTH90018"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}