{
    "Course name": "Specialist Certificate in Design for Health and Wellbeing",
    "Course code": "SC-DHW",
    "Overview text": [
        "The Specialist Certificate in Design for Health and Wellbeing introduces concepts such as why space matters, spatial research methods and how users’ health and wellbeing are impacted by their environments. Students will be introduced to skills such as how to brief and critically evaluate the spaces that we inhabit and impact our health and wellbeing; and interpret and critique visual communication techniques in various forms, including plans, sketch models, and 3D digital renderings. Students will be encouraged to develop their written, oral and visual communication skills within their selected core subjects.",
        "Last updated: 6 August 2024"
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Design for Health and Wellbeing",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applications must have completed either:",
            "an undergraduate degree, or equivalent; or",
            "a minimum of five years documents relevant work experience, including two referee reports",
            "Meeting these requirements does not guarantee selection.",
            "2. In assessing applications, the Selection Committee will consider:",
            "prior academic performance; the work experience as demonstrated by a CV; and•   referee reports",
            "3. The Selection Committee may see further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the University's English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard test as approved by the Academic Board, a performance band of6.5is required.",
            "Note:Relevant work experience includes human factors, design and built environment fields, health settings, local or state government roles, education, industry management roles."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The 25-point Specialist Certificate in Design for Health and Wellbeing comprised of two subjects:",
                [
                    "One core subject",
                    "One elective subject"
                ],
                "Students must complete the core subject:",
                [
                    "ABPL90428"
                ],
                "And one elective subject from:",
                [
                    "ABPL90426",
                    "ABPL90427"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}