{
    "Course name": "Specialist Certificate in Cancer Nursing",
    "Course code": "SC-CNCRNUR",
    "Overview text": [
        "The Specialist Certificate in Cancer Nursing is delivered by cancer nursing clinical experts and educators. This course provides students with the beginning scientific and theoretical knowledge related to cancer control and patient-family centered care.",
        "As a student of this course you will complete two wholly online core subjects: Applied Pathophysiology and the Foundations of Cancer Nursing. This course is completed part-time of six months duration.",
        "This course is suitable for nurses who are new to practising in cancer care services and as an entry pathway to the Graduate Certificate in Cancer Nursing.",
        "Last updated: 26 July 2024"
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Cancer Nursing",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have:",
            "Completed a Bachelor or Nursing (or equivalent qualification, i.e. Master of Nursing Science entry to practice); and",
            "Documented evidence of clinical experience in area of specialty practice within the preceding five years from the time of application; and",
            "Current unrestricted registration as a Division 1 Registered Nurse with AHPRA or equivalent registration with an international health practitioner regulation agency.",
            "Meeting these requirements does not guarantee selection",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance",
            "Area of speciality practice and clinical experience",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students with reasonable adjustments to assessment and participation under the Disability Standards for Education (2005), and the Assessment and Results Policy (MPF1326). Students are expected to meet the core participation requirements for their course. These can be viewed under Entry and Participation Requirements for the course outlines in the Handbook. Further details on how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must commence the course undertaking NURS90076 Applied Pathophysiology first, and then complete NURS90121 Foundations in Cancer Nursing.",
                "Students will commence with the pre-requisite subject NURS90076 Applied Pathophysiology. Applied Pathophysiology is a 12.5 point subject offered wholly online at the start of the year and at mid-year.",
                "Students then complete NURS90121 Foundations in Cancer Nursing which is a 12.5 point subject offered wholly online in Term 4 2020. In 2021, this subject will be available in both Term 2 and Term 4."
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "NURS90076",
                    "NURS90121"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}