{
    "Course name": "Specialist Certificate in Cross-Cultural Conservation and Heritage",
    "Course code": "SC-CCCONS",
    "Overview text": [
        "The Specialist Certificate in Cross-Cultural Conservation and Heritage is designed as a knowledge exchange program and draws on the Centre for Cultural Material Conservation’s extensive industry and community partnerships to combine traditional and contemporary approaches to the preservation of cultural objects across a range of cultural settings. The Specialist Certificate focuses on the conservation of cultural material as a foundation for broader understandings of the significance of culture as a source of identity, social cohesion and sustainable development. The Program provides students from diverse cultural and professional backgrounds with the opportunity to benefit from the expertise held by fellow students and their communities, and from Indigenous experts in Australia and other cultural leaders in the Asia-Pacific region. The Specialist Certificate is designed for practicing museum and heritage workers to gain access to and expertise in contemporary and traditional approaches to conservation, for Indigenous students seeking entry to graduate study and for a range of professionals seeking to work with Indigenous communities. The Specialist Certificate is a pathway to further study in the Graduate Certificate in Arts (Advanced) - Cultural Material Conservation and Master of Cultural Materials Conservation.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Cross-Cultural Conservation and Heritage",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "A statement of intent in seeking entry; and",
            "A three-year undergraduate degree in any discipline, or equivalent; or",
            "At least five years of documented professional experience in cultural conservation, cultural heritage and related professional and cultural fields, which demonstrates the capacity to successfully undertake the course.",
            "Meeting these requirements does not guarantee selection.2. In ranking and/or assessing applications, the Selection Committee will consider:",
            "Prior academic qualification and performance;",
            "The personal statement of intent; and, if relevant",
            "Professional experience. 3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Specialist Certificate in Cross-Cultural Conservation and Heritage requires the successful completion of:",
                [
                    "25 credit points of core subjects"
                ],
                [
                    "CUMC90038",
                    "CUMC90039"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "After the completion of this course, students are eligible to receive 25 credit points toward the following courses;",
        [
            "Master of Cultural Material Conservation",
            "Graduate Certificate in Arts (Advanced) Principles of Cultural Material Conservation specialisation",
            "Master of Arts and Cultural Management",
            "Graduate Diploma in Arts and Cultural Management (Advanced)",
            "Master of Art Curatorship "
        ]
    ]
}