{
    "Course name": "Specialist Certificate in Paediatric Critical Care Nursing",
    "Course code": "SC-PAECCN",
    "Overview text": [
        "The Specialist Certificate in Paediatric Critical Care Nursing is a 25 credit point, part-time, coursework program conducted over two terms. It consists of two core 12.5 credit point online subjects, NURS90076 Applied Pathophysiology and NURS90085 Foundations in Paediatric Critical Care.",
        "The program is targeted towards nurses who are beginning in the specialty of paediatric critical care nursing. The course is based on the latest evidence and best practice guidelines leading to high quality care for sick paediatric patients and their families.",
        "Last updated: 14 December 2023"
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Paediatric Critical Care Nursing",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have:",
            "Completed a Bachelor of Nursing (or equivalent qualification, i.e. Master of Nursing Science entry to practice); and",
            "Documented evidence of clinical experience in area of nursing practice within the preceding five years from the time of application; and",
            "Current unrestricted registration as a Division 1 Registered Nurse with AHPRA or equivalent registration with an international health practitioner regulation agency.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Area of speciality practice and clinical experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Specialist Certificate in Paediatric Critical Care Nursing requires the successful completion of 25 credit points.",
                "All students must complete:",
                "25 credit points of compulsory subjects",
                "Subject Options",
                [
                    "NURS90076",
                    "NURS90085"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "On completion of the course, students may be eligible to receive a full 25 credit points of advanced standing toward the Graduate Certificate in Nursing Practice (Paediatric intensive Care)."
    ]
}