{
    "Course name": "Specialist Certificate in Criminology (Forensic Disability)",
    "Course code": "SC-CRIMFD",
    "Overview text": [
        "The Specialist Certificate in Criminology (Forensic Disability) will provide an up-to-date understanding of key concepts and issues, including theoretical and practical training in the assessment (including risk assessment) and management of forensic disability populations, and the complex professional and ethical issues encountered when working with this needy and challenging group."
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Criminology (Forensic Disability)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed either:",
            "an undergraduate degree in medicine, an allied health profession, science or social science, and two years of documented relevant work experience, or",
            "at least five years documented relevant professional work experience which demonstrates the capacity to undertake the course successfully",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking and/or assessing applications, the Selection Committee will consider:",
            "prior academic qualification and performance; and/or",
            "the professional experience",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The course is based on a points structure with students required to accumulate 25 points in order to receive the award. The subject for the Specialist Certificate is offered at Masters level."
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Core Subjects": {
            "overview": [
                [
                    "CRIM90012",
                    "CRIM90013"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Students who complete the Graduate Certificate are eligible to apply for theMaster of Criminologywith advanced standing of 25 points."
    ]
}