{
    "Course name": "Specialist Certificate in Research Practice for Scientists",
    "Course code": "SC-RESPRSC",
    "Overview text": [
        "This course allows students to undertake a 3-6 month internship with a host organisation in an area relevant to their potential career destination.",
        "The internship will provide students with the opportunity to apply their research skills and capacity in an organisational context, gain practical experience and build professional networks in order to further enhance their career options.",
        "Students will have the opportunity to further develop their employability skills including communication, interpersonal, analytical, problem-solving, organisational, project-management and time-management skills, and gain a greater understanding of career planning and professional development considerations and employer expectations."
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Research Practice for Scientists",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have:",
            "completed a PhD in Science, or equivalent, or",
            "be admitted to the DR-PHILSCI Doctor of Philosophy – Science with a candidature status set to Under Examination (having submitted thesis).",
            "2. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "3. Applicants are required to satisfy the university's English language requirements. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance bands 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must take:",
                [
                    "SCIE90036"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}