{
    "Course name": "Specialist Certificate in Implementation Science",
    "Course code": "SC-IMPSC",
    "Overview text": [
        "The Specialist Certificate in Implementation Science will improve the knowledge and skills of health and human services professionals in this emerging area of research and practice – Implementation Science. It will provide an understanding of the core principles of Implementation Science and their application to the complex environment of health and human services. The course is aimed at the broad range of professionals working in health and social care who contribute to the implementation of policies, programs or projects.",
        "Last updated: 1 August 2024"
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Implementation Science",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:\r\n\nAn undergraduate degree in a cognate discipline; and\nAt least two years relevant professional experience in human services or a related field.\n\r\nMeeting these requirements does not guarantee selection.",
            "2. An undergraduate degree in a cognate discipline; and",
            "3. At least two years relevant professional experience in human services or a related field.",
            "4. In ranking applications, the Selection Committee will consider:\r\n\nprior academic performance; and\nprior professional work experience.\n\n",
            "5. prior academic performance; and",
            "6. prior professional work experience.",
            "7. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "8. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "An undergraduate degree in a cognate discipline; and",
            "At least two years relevant professional experience in human services or a related field.",
            "prior academic performance; and",
            "prior professional work experience."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Student Support and Engagement Policy, academic requirements for this subject are articulated in the Subject Overview, Learning Outcomes, Assessment and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support:http://services.unimelb.edu.au/disability"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students complete the two compulsory subjects:"
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "SCWK90067",
                    "SCWK90068"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}