{
    "Course name": "Specialist Certificate in the Management of Neuro-Ophthalmic Disorders",
    "Course code": "SC-MGTNOD",
    "Overview text": [
        "THIS COURSE IS NOT TAKING APPLICATIONS FOR 2024.",
        "The Specialist Certificate in the Management of Neuro-Ophthalmic Disorders offered by the Department of Optometry & Vision Sciences in the School of Health Sciences is designed to enable optometrists to extend their abilities to evaluate the sensory and motor pathways of the visual system, both in the context of evaluating visual complaints themselves as well as gaining further knowledge of how visual and ocular motor signs may reflect a range of systemic conditions, particularly of the central nervous system. Because complaints related to these pathways may reflect problems arising anywhere from the anterior visual pathways to the higher-order visual cortices, optometrists should benefit from gaining a deeper understanding of the current state of knowledge of these pathways and their assessment.",
        "It is achieved through successful completion of one compulsory 25 point subject, Management of Neuro-Ophthalmic Disorders (formerly Management of Neural Disorders of Vision)."
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in the Management of Neuro-Ophthalmic Disorders",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applications must have completed:",
            "a four-year undergraduate degree in Optometry, or equivalent or:",
            "professional experience deemed by the Selection Committee to be equivalent to a four-year Australian degree in Optometry",
            "Meeting this requirement does not guarantee selection",
            "1. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and, if relevant",
            "any documented relevant professional experience.",
            "1. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instructions.",
            "1. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applications seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering request for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Student Support and Engagement Policy, academic requirements for this subject are articulated in the Subject Overview, Learning Outcomes, Assessment and Generic Skills sections of this entry.",
            "It is University policy to take all reasonable steps to minimise the impact of disability upon academic study, and reasonable adjustments will be made to enhance a student's participation in the University's programs. Students who feel their disability may impact on meeting the requirements of this subject are encouraged to discuss this matter with a Faculty Student Adviser and Student Equity and Disability Support:http://services.unimelb.edu.au/disability"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Subject Level - 9",
                "Subject Title - Management of Neuro-Ophthalmic Disorders",
                "(formerly OPTO90015 Management of Neural Disorders of Vision)",
                "Points - 25",
                "Compulsory"
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "OPTO90015"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "After the completion of this course, students can get a full 25 credit points of advanced standing towards theMaster of Clinical Optometry."
    ]
}