{
    "Course name": "Specialist Certificate in Public Administration (Advanced)",
    "Course code": "SC-PAADV",
    "Overview text": [
        "The Specialist Certificate in Public Administration (Advanced) is a prestigious executive level qualification designed exclusively for practicing ministerial advisors in the public service. This course will equip participants with the necessary practical skills to excel in their existing role whilst enabling them to expand their knowledge and abilities around a range of core attributes to prepare them for a life after working in politics. Delivered in conjunction with leading practitioners and world-class academics, this course combines cutting-edge research with real-politik to enable ministerial officers to thrive in their important roles.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Public Administration (Advanced)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "12 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants:",
            "• must be employed as a ministerial officer (or equivalent); and,",
            "• must have completed an undergraduate degree in an appropriate discipline or equivalent; or",
            "• must have completed seven years of documented relevant work experience and demonstrated evidence of written and analytical skills appropriate for postgraduate study.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "• Prior academic performance; and",
            "• Relevant work experience.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application",
            "in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate",
            "courses. For those applicants seeking to meet these requirements by one of the standard",
            "tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students reasonable adjustments to assessment and participation under the Disability Standards for Education (2005) and the Assessment and Results Policy (MPF127). For the purposes of considering requests for reasonable adjustments, academic requirements for this course are articulated in the overview, attributes, outcomes and skills of this entry. Further details about how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students are required to complete four compulsory subjects.",
                [
                    "PADM90021",
                    "PADM90020",
                    "PADM90018",
                    "PADM90016"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}