{
    "Course name": "Specialist Certificate in Gerontology",
    "Course code": "SC-GERON",
    "Overview text": [
        "This course examines the complex and growing challenges of an ageing worldwide population. The Specialist Certificate provides specialised knowledge and skills to understand ageing as a social, physical and psychological experience within the context of national policies and models of health and community care. The disciplines of population health, nursing, physiotherapy, social work, psychology, architecture and design, computing and information systems, and economics contribute to the subjects within the course.",
        "Students have the opportunity to select interest areas from a range of subjects focused on ageing and its implications, in diverse settings and contexts, including health care, workforce, housing, economic and social policy and technological advances supporting healthy ageing and aged care. The course provides a specialised focus on gerontology for clinicians, health care managers, social and community care providers and policy makers. The two-subject Specialist Certificate articulates with the four-subject Graduate Certificate in Gerontology but may also be taken as a stand-alone qualification for those seeking professional development in gerontology in specific disciplinary areas.",
        "Last updated: 27 August 2024"
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Gerontology",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "An undergraduate degree in any discipline, or equivalent.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance.",
            "3.The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performanceband 6.5is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering requests for Reasonable Adjustments under the Disability Standards for Education (Cwth 2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this course are articulated in the Course Description, Course Objectives and Generic Skills of this entry. The University is dedicated to provide support to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete two of the following subjects:"
            ]
        },
        "Subject options": {
            "overview": []
        },
        "Course Structure & Available Subjects": {
            "overview": [
                "Students must choose TWO subjects from the following list:",
                [
                    "POPH90256",
                    "POPH90258",
                    "POPH90257",
                    "POPH90264",
                    "PSYT90092",
                    "POPH90267",
                    "ABPL90377",
                    "POPH90263"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}