{
    "Course name": "Specialist Certificate in the Management of Paediatric Patients",
    "Course code": "SC-MPP",
    "Overview text": [
        "THIS COURSE IS NOT TAKING APPLICATIONS FOR 2024.",
        "The Specialist Certificate in the Management of Paediatric Patients offered by the Department of Optometry & Vision Sciences in the School of Health Sciences course covers central issues within the field of paediatric optometry, with the aim of developing each student's capacity for highly evolved communication and co-management with other professionals involved in paediatric assessment and care. A range of areas will be covered, encompassing the developmental, visual, medical and educational issues relevant to paediatric optometry. Specific areas covered will include diseases and disorders such as amblyopia, comitant strabismus, ametropia, and disorders of refraction, accommodation and vergence.",
        "By introducing optometrists to a wide range of modern and classical literature, the course fosters a deeper, evidence-based understanding of central themes, thereby providing a solid context against which to evaluate emerging issues relevant to world's best practice of paediatric optometry.",
        "The Specialist Certificate is achieved through successful completion of one compulsory 25 point subject, Management of Paediatric Patients."
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in the Management of Paediatric Patients",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applications must have completed: ",
            "a four-year undergraduate degree in Optometry, or equivalent or;",
            "professional experience deemed by the Selection Committee to be equivalent to a four-year Australian degree in Optometry ",
            "Meeting this requirement does not guarantee selection",
            "1.  In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and, if relevant",
            "any documented relevant professional experience.",
            "1. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instructions.",
            "1. Applicants are required to satisfy the university’s English language requirements for postgraduate courses.  For those applications seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "For the purposes of considering a request for Reasonable Adjustments under the Disability Standards for Education (2005), and Students Experiencing Academic Disadvantage Policy, academic requirements for this subject are articulated in the Subject Description, Subject Objectives, Generic Skills and Assessment Requirements of this entry.The University is dedicated to providingsupport to those with special requirements. Further details on the disability support scheme can be found at the Disability Liaison Unit website.http://www.services.unimelb.edu.au/disability/"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Subject Level - 9",
                "Subject Title -Management of Paediatric Patients",
                "(formerly OPTO90010 Paediatric Optometry)",
                "Points - 25",
                "Compulsory"
            ]
        },
        "Subject options": {
            "overview": [
                [
                    "OPTO90010"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "After the completion of this course, students can get a full 25 credit points of advanced standing towards theMaster of Clinical Optometry."
    ]
}