{
    "Course name": "Specialist Certificate in Research Practice (HASS)",
    "Course code": "SC-RPHASS",
    "Overview text": [
        "This certificate allows students to undertake a 3 months internship with a host organisation in an area relevant to a potential career destination. Students will undertake a defined research project within the host organisation and/ or participate in team-based research or business activities, while also being exposed to the broader operational contexts of an organisation.",
        "This course offers graduate researchers the opportunity to engage in self-directed learning in relation to employability, and to understand and implement the application and transfer of discipline-specific knowledge to a not for profit, commercial and/ global business environment. The course emphasises and develops self-directed and self-facilitated learning on the part of the student, and requires them to relate discipline-specific learning to real-world scenarios in order to deliver high quality applied research and critically reflect on and demonstrate learning to enhance employability.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Research Practice (HASS)",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have:",
            "be admitted to the DR-PHILARTS Doctor of Philosophy – Arts, post confirmation or",
            "be admitted to the DR-PHILARTS Doctor of Philosophy – Arts with a candidature status set to Under Examination (having submitted thesis).",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:• prior academic performance",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance bands 6.5 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "Students must complete the following subject:",
                [
                    "ARTS90033"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}