{
    "Course name": "Specialist Certificate in Creativity and Health",
    "Course code": "SC-CRHLTH",
    "Overview text": [
        "THIS COURSE IS NOT TAKING APPLICATIONS FOR 2024.",
        "The Specialist Certificate in Creativity and Health is designed to equip students to understand and use performance to improve the health and well‐being for children and young people who are engaged with a range of health services. It is open to professionals who work within health settings and want to use performance with children and young people who interact with the primary, secondary and tertiary health services. It will provide foundational knowledge on theories of performance, child and adolescent development and how to work within both interdisciplinary settings. Case studies will be used to illustrate best practice in the field, and students will have the opportunity to develop their own program as part of the course.",
        "The course requires completion two 12.5 credit point subjects. The course is provided entirely online providing flexibility to design study times around other commitments and study preferences. This course is designed to be available to professionals at different stages in their careers, including recent graduates, established practitioners and those seeking to move in new directions.",
        "Last updated: 4 July 2024"
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Creativity and Health",
        "Year & campus": "2024",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "an undergraduate qualification related to a health and human services field; and",
            "at least two years of documented, relevant work experience; and",
            "a personal statement outlining why they wish to be considered for the course; and",
            "applicants must also nominate a professional referee from whom a report may be sought.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "prior academic performance; and",
            "work experience; and",
            "the personal statement.",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’sEnglish language requirements for postgraduatecourses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 7 is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "The University of Melbourne is committed to providing students with reasonable adjustments to assessment and participation under the Disability Standards for Education (2005), and the Assessment and Results Policy (MPF1326). Students are expected to meet the core participation requirements for their course. These can be viewed under Entry and Participation Requirements for the course outlines in the Handbook. Further details on how to seek academic adjustments can be found on the Student Equity and Disability Support website:http://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Specialist Certificate in Creativity and Health is comprised of two subjects (25 credit points). Students must complete both of:",
                [
                    "HLTH90015",
                    "HLTH90016"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}