{
    "Course name": "Specialist Certificate in Public Health",
    "Course code": "SC-PUBHLTH",
    "Overview text": [
        "The Specialist Certificate in Public Health will provide skills that prepare students for public health practice and augment existing professional skills in health care practice, policy and management. The Specialist Certificate will provide a stepped pathway into the Graduate Certificate in Public Health and/or the University’s flagship Master of Public Health (MPH) program. It will also provide an opportunity for current health sector professionals to gain a valuable skills-based qualification that strengthens their career path, enables them to respond to public health challenges in a variety of health and social policy contexts and responds to an Australia-wide urgent workforce need for health professionals with public health training. The Specialist Certificate in Public Health will provide full credit into the Master of Public Health.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Public Health",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1.  In order to be considered for entry, applicants must have completed:",
            "A pass-level undergraduate degree in any discipline",
            "Meeting these requirements does not guarantee selection.",
            "2.  In ranking applications, the Selection Committee will consider:",
            "Prior academic performance",
            "3.  The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Board rules on the use of selection instruments.",
            "4.  Applicants are required to satisfy the university’s English language requirements for postgraduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board, performance band 6.5 is required.",
            "Notes:",
            "This Certificate is used as a pathway to the MPH only and as an exit point from an incomplete MPH. Students will not be able to take this Certificate concurrently with the Master of Public Health."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "One compulsory subject:",
                [
                    "POPH90217"
                ],
                "One elective subject (1 x 12.5 points)  chosen from the core and/or elective list of subjects available in the Master of Public Health - see attached list derived fromhttps://handbook.unimelb.edu.au/courses/244cw/course-structure"
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Subjects completed within this degree from the University of Melbourne may receive advanced standing (with credit) within the Master of Public Health.",
        "This Specialist Certificate cannot be taken concurrently with the Master of Public Health. The Specialist Certificate cannot be claimed retrospectively when the relevant subjects are taken as part of a completed Master of Public Health."
    ]
}