{
    "Course name": "Specialist Certificate in Disaster Health Management",
    "Course code": "SC-DHM",
    "Overview text": [
        "The Specialist Certificate in Disaster Health Management is the first program of its kind in Australia, providing an evidence-based introduction to the key elements of this specialty.",
        "Disaster events are taking place with increasing frequency across the globe. In Australia, we've faced severe floods, bushfires, mass casualty events such as thunderstorm asthma, and the impacts of a pandemic within a short period. Neighbouring countries in our region have dealt with earthquakes, cyclones, and disease outbreaks, including the devastating measles epidemic in the Pacific Islands. Globally, we are seeing a rise in conflict and the convergence of natural disasters with conflict, leading to mass population displacement in vulnerable communities.",
        "The knowledge and experience of disaster medicine specialists is critical when it comes to managing such events in community and healthcare settings. Health practitioners, service managers and leaders must be prepared to respond quickly and decisively.",
        "With a focus on the fundamentals of disaster response, the course will equip clinicians, first responders, health service managers, relevant agency staff and policy makers with essential skills to effectively prepare for, and manage, a range of disaster events.",
        "What you will learn",
        "Who is the course for?",
        "Our program is targeted towards clinicians, hospital administrators, staff from emergency services, government and the military. The course will equip participants with an understanding of domestic and international factors involved in the management of these events.",
        "Who will you learn from?",
        "Developed at the Department of Critical Care in consultation with industry, the program draws on the deep knowledge and real-world experience of international experts in the field, including leading experts in emergency medicine, emergency management, paramedicine and public health.",
        "",
        "Pathways",
        "Credit obtained in some of these subjects can be used towards completion of theMaster of Advanced Nursing Practice,Graduate Certificate in Climate Change and Health,Graduate Certificate in Disaster and Terror MedicineandGradate Diploma in Disaster and Terror Medicine.",
        "",
        "Further information",
        "The Online delivery of the program provides you with the flexibility to fit study around work and personal commitments. Your online learning experience will be further enriched with an intensive 4-day program, which provides you with the opportunity to put what you've learned into practice through a series of bespoke workshops. It is highly recommended students attend campus for these workshops, but they may attend 2 of the 4 days virtually.",
        "Last updated: 3 September 2024"
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Disaster Health Management",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "1. In order to be considered for entry, applicants must have completed:",
            "A medical degree or,",
            "An undergraduate degree in any discipline and at least three years of documented relevant work experience in a health management, paramedicine, nursing or equivalent role; and",
            "A 500-word expression of interest detailing the applicant’s motivations for undertaking the course, which also serves as evidence of written and analytical skills appropriate for postgraduate study.",
            "Meeting these requirements does not guarantee selection.",
            "2. In ranking applications, the Selection Committee will consider:",
            "Prior academic performance; and",
            "Area of speciality practice and clinical experience.",
            "Statement of expression  ",
            "3. The Selection Committee may seek further information to clarify any aspect of an application in accordance with the Academic Boardruleson the use of selection instruments.",
            "4. Applicants are required to satisfy the university’s English language requirements for graduate courses. For those applicants seeking to meet these requirements by one of the standard tests approved by the Academic Board,performance band 7is required."
        ],
        "Inherent requirements (core participation requirements)": [
            "Inherent requirements are the abilities, knowledge and skills needed to complete this course that must be met by all students. For information on the inherent requirements specific to this course contact the course/program coordinator. In some circumstances reasonable adjustments may be available to enable students to meet these requirements while still preserving the academic integrity of the university's learning, assessment and accreditation processes. For more information on how to seek these adjustments refer to the Student Equity and Disability Support website:https://services.unimelb.edu.au/student-equity/home"
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "The Specialist Certificate in Disaster Health Management requires the successful completion of 25 credit points.",
                "Core subjects",
                [
                    "All of \n\n\nCode\nName\nStudy period\nCredit Points\n\n\n\nMEDI90107\nDisaster Medicine Principles & Responses\nJanuary (Dual-Delivery - Parkville)\n12.5\n\n\nMEDI90109\nManaging Complex Disasters\nOctober (On Campus - Parkville)\n12.5\n\n\n"
                ],
                [
                    "MEDI90107",
                    "MEDI90109"
                ]
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": [
        "Graduates may progress to theGraduate Certificate in Disaster and Terror Medicineor theGraduate Diploma in Disaster and Terror Medicine."
    ]
}