{
    "Course name": "Specialist Certificate in Urban and Cultural Heritage",
    "Course code": "SC-UCH",
    "Overview text": [
        "Exit award for the Master of Urban and Cultural Heritage.",
        "Last updated: 30 January 2024"
    ],
    "Overview table": {
        "Award title": "Specialist Certificate in Urban and Cultural Heritage",
        "Year & campus": "2024— Parkville",
        "Fees information": "Subject EFTSL, level, discipline and census date",
        "Study level & type": "Graduate Coursework",
        "AQFlevel": "Non-AQF",
        "Credit points": "25 credit points",
        "Duration": "6 months part-time"
    },
    "Entry and participation requirements": {
        "Entry requirements": [
            "The Specialist Certificate in Urban and Cultural Heritage is an exit award of the Master of Urban and Cultural Heritage program (MC-UCH). Entry requirements for the MC-UCH can be foundhere."
        ],
        "Inherent requirements (core participation requirements)": [
            "The Melbourne School of Design is the graduate school of the Faculty of Architecture, Building and Planning. It offers professional entry programs in Architecture, Construction Management, Landscape Architecture, Property and Urban Planning. It offers specialist development programs in Property Valuation, Planning and Design and in Urban Design.",
            "The Melbourne School of Design welcomes applications from students with disabilities. It is the University and Faculty (Architecture, Building and Planning) policy to take reasonable steps to make reasonable adjustments so as to enable students’ participation in degrees offered by the Melbourne School of Design (MSD).",
            "A candidate for degrees offered in the MSD must have abilities and skills which include the following: observation; communication; motor; conceptual, integrative, and quantitative; andbehavioural and social. Adjustments can be provided to minimise the impact of a disability, however, particularly at Masters level, students need to be able to participate in programs in an independent manner and with regard to their safety and the safety of others.",
            "(i)Observation:Candidates must be able to read text, diagrams, maps, drawings and numerical data. Candidates should be able to observe details at a number of scales and to record useful observations of environmental contexts.",
            "(ii)Communication:Candidates should be able to communicate with fellow students, professional and academic staff, members of relevant professions and the public. Candidates must be able to communicate effectively and sensitively. Communication includes not only speech but also reading and writing.",
            "(iii)Motor:Candidates should have sufficient motor function to elicit information from environmental contexts. Off campus investigations may include visits to construction sites, urban, rural and/or remote environments. Candidates should have sufficient motor ability to prepare documentation of analytic texts, drawings and models of findings and for the preparation of proposals for environmental interventions via digital or other means. Candidates should have the ability to actively participate in appropriate site and/or design studio-based activities.",
            "(iv)Intellectual-Conceptual, Integrative and Quantitative Abilities:These abilities include measurement, calculation, reasoning, analysis, synthesis and, importantly, the ability to interpret results of such work. Problem resolution, the critical skill demanded of graduates, requires all of these intellectual abilities. In addition, given the disciplines pursued in the MSD, candidates should be able to comprehend three-dimensional relationships and to understand the spatial relationships in environmental structures of a wide range of scales – from smaller than the individual through individual buildings and urban spaces to large geographic areas. Further, graduate study entails learning to master one’s own abilities and skills and to deploy them strategically. This requires further developing skills in both reflective and reflexive thinking and being able to practice these skills.",
            "(v)Behavioural and Social Attributes:A candidate must possess behavioural and social attributes that enable them to participate in a complex learning environment. Students are required to take responsibility for their own participation and learning. They also contribute to the learning of other students in collaborative learning environments, demonstrating interpersonal skills and an understanding of the needs of other students. Assessment may include the outcomes of tasks completed in collaboration with other students.",
            "Students who feel a disability will prevent them from meeting the above academic requirements are encouraged to contact the Disability Liaison Unit."
        ]
    },
    "Attribute, outcomes and skills": {},
    "Course Structure": {
        "Course structure": {
            "overview": [
                "This exit award requires completion of 25 points of core subjects within the Master of Urban and Cultural Heritage (MC-UCH). Course structure and available subjects for the MC-UCH can be foundhere."
            ]
        }
    },
    "Majors, minors and specialisations": {},
    "Further Study": []
}